-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_death.log
  log type:  text
 opened on:   1 Feb 2021, 12:32:37

. 
. *set trace on
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach dataset in MAIN W2 {
  3. forvalues x=0/1 {
  4. file write tablecontents_sense ("dataset") ("age") ("`x'") _n
  5. foreach sense in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timesc
> ale time_int SUS_censor {
  6. file write tablecontents_sense _n ("sense=") ("`sense'") _n
  7. forvalues i=1/3 {
  8. local endwith "_tab"
  9. 
.         foreach modeltype of any fulladj {
 10. 
.                 local noestimatesflag 0 /*reset*/
 11. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 12. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 13.             cap estimates use  ./output/an_sense_`outcome'_`sense'_ageband
> _`x'`dataset'
 14.                                 if _rc!=0 local noestimatesflag 1
 15.                                 }
 16. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "!="AAmain" {
 17.                         cap lincom `i'.`variable', eform
 18.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 19.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 20.                         }
 21. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 22.                         if "`modeltype'"=="fulladj" & "`sense'"!="AAmain" 
>  {
 23.                                 local hr = r(estimate)
 24.                                 local lb = r(lb)
 25.                                 local ub = r(ub)
 26.                                 local N=e(N_sub)
 27.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 28.                                 }
 29.                 }
 30.                 } /*min adj, full adj*/
 31. 
. } /*variable levels*/
 32. 
. forvalues i=1/3 {
 33. local endwith "_tab"
 34. 
.         foreach modeltype of any fulladj {
 35. 
.                 local noestimatesflag 0 /*reset*/
 36. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 37. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 /*if "`modeltype'"=="minadj" & "`variable'"!="agegroup" & "`v
> ariable'"!="male" {
>                         cap estimates use ./output/an_univariable_cox_models_
> `outcome'_AGESEX_`variable'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }
>                 if "`modeltype'"=="demogadj" {
>                         cap estimates use ./output/an_multivariate_cox_models
> _`outcome'_`variable'_DEMOGADJ_`sense'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }*/
.                 if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 38.                 cap estimates use  ./output/an_multivariate_cox_models_`ou
> tcome'_`variable'_MAINFULLYADJMODEL_ageband_`x'`dataset'
 39.                                 if _rc!=0 local noestimatesflag 1
 40.                                 }
 41. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "=="AAmain" {
 42.                         cap lincom `i'.`variable', eform
 43.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 44.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 45.                         }
 46. 
.                 *3) Save the estimates for plotting
.                         if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 47.                                 local hr = r(estimate)
 48.                                 local lb = r(lb)
 49.                                 local ub = r(ub)
 50.                                 local N=e(N_sub)
 51.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 52.                                 }
 53. 
.                 } /*min adj, full adj*/
 54. 
. } /*variable levels*/
 55. } /*age levels*/
 56. } /*sense levels*/
 57. } /*datsets*/
 58. 
. end

. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. 
. cap file close tablecontents_sense

. file open tablecontents_sense using ./output/12_an_sense_HRtable_`outcome'_SE
> NSE_ANALYSES.txt, t w replace
(note: file ./output/12_an_sense_HRtable_covid_death_SENSE_ANALYSES.txt not fou
> nd)

. 
. tempfile HRestimates_sense

. cap postutil clear

. postfile HRestimates_sense str10 dataset str10 x str10 outcome str27 variable
>  str27 sense i hr lci uci N using `HRestimates_sense'

. 
. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(1) max(3) outcome(`outcome')

. file write tablecontents_sense _n

. 
. file close tablecontents_sense

. 
. postclose HRestimates_sense

. 
. *use `HRestimates_sense', clear
. *save HRestimates_sense, replace
. *stop
. 
. foreach dataset in MAIN W2 {
  2. forvalues x=0/1 {
  3. 
. use `HRestimates_sense', clear
  4. keep if x=="`x'"
  5.  
. keep if dataset=="`dataset'"
  6. drop outcome variable
  7. sort sense i
  8. gen varorder = 1
  9. 
. 
. sort varorder sense i
 10. drop varorder
 11. 
. gen obsorder=_n
 12. expand 2 if sense!=sense[_n-1], gen(expanded)
 13. gsort obsorder -expanded
 14. 
. for var hr lci uci: replace X = 1 if expanded==1
 15. 
. drop obsorder
 16. gen obsorder=_n
 17. 
. 
. expand 2 if expanded==1, gen(expanded2)
 18. drop obsorder
 19. gsort sense i -expanded -expanded2
 20. gen obsorder=_n
 21. 
. for var hr lci uci : replace X=. if expanded==1 & expanded2==1
 22. 
. gen varx = 0.03
 23. gen levelx = 0.033
 24. gen intx=0.08
 25. gen lowerlimit = 0.15
 26. gen disx=2.5
 27. 
. *Levels
. gen leveldesc = ""
 28. replace leveldesc = "Only children aged 0-11 years" if i==1 & hr!=1 & hr!=
> .
 29. replace leveldesc = "Only children aged ≥12 years" if i==2
 30. replace leveldesc = "Children aged 0-11 years and ≥12 years" if i==3
 31. 
. gen Name = sense if hr==1
 32. 
. foreach type in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timescale 
> time_int  {
 33. sum N if sense=="`type'"
 34. local number_`type'=r(mean)
 35. di `number_`type''
 36. }
 37. 
. replace Name = "Fully adjusted result  (N=`number_AAmain')" if Name=="AAmain"
 38. replace Name = "Participants with complete BMI and smoking data  (N=`numbe
> r_CCeth_bmi_smok')" if Name=="CCeth_bmi_smok"
 39. replace Name = "Underlying timescale in the cox model revised to age   (N=
> `number_age_underlying_timescale')" if Name=="age_underlying_timescale"
 40. replace Name = "Participants with at least 12 months registration at GP  (
> N=`number_plus_eth_12mo')" if Name=="plus_eth_12mo"
 41. replace Name = "Non-proportional hazards fitted (N=`number_time_int')" if 
> Name=="time_int"
 42. replace Name = "Censor study at 1st November (N=`number_SUS_censor')" if N
> ame=="SUS_censor"
 43. 
. for var hr lci uci: replace X = . if X==1
 44. 
. 
. gen displayhrci = string(hr, "%3.2f") + " (" + string(lci, "%3.2f") + "-" + s
> tring(uci, "%3.2f") + ")"
 45. replace displayhrci="" if hr==.
 46. list display
 47. 
. drop obsorder
 48. 
. gen obsorder=_n
 49. gsort -obsorder
 50. gen graphorder = _n
 51. sort graphorder
 52. list graphorder Name leveldesc hr  lci uci
 53. 
. gen hrtitle="Hazard Ratio (95% CI)" if graphorder == 28
 54. 
. gen bf_hrtitle = "{bf:" + hrtitle + "}"
 55. gen bf_Name = "{bf:" + Name + "}"
 56. 
. scatter graphorder hr, mcol(black)      msize(small)            ///          
>                                                                    ///
>         || rcap lci uci graphorder, hor mcol(black)     lcol(black)          
>            ///
>         || scatter graphorder varx , m(i) mlab(bf_Name) mlabsize(vsmall) mlab
> col(black)         ///
>         || scatter graphorder levelx, m(i) mlab(leveldesc) mlabsize(vsmall) m
> labcol(black)      ///
>         || scatter graphorder disx, m(i) mlab(displayhrci) mlabsize(vsmall) m
> labcol(black) ///
>         || scatter graphorder disx, m(i) mlab(bf_hrtitle) mlabsize(vsmall) ml
> abcol(black) ///
>                 xline(1,lp(solid))                                           
>                                                                            //
> /
>                 xscale(log range(0.1 6)) xlab(0.5 1 2, labsize(vsmall)) xtitl
> e("")  ///
>                 ylab(none) ytitle("")           yscale( lcolor(white))       
>                            ///
>                 graphregion(color(white))  legend(off)  ysize(4) ///
>                 text(-2 0.2 "Lower risk in those living with children", place
> (e) size(vsmall)) ///
>                 text(-2 1.5 "Higher risk in those living with children", plac
> e(e) size(vsmall))
 57. 
. graph export ./output/12_an_HRforest_SENSE_`outcome'_ageband_`x'_`dataset'.sv
> g, as(svg) replace
 58. }
 59. }
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9334392           0    9334392    9334392
9334392

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     7665303           0    7665303    7665303
7665303

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     8585489           0    8585489    8585489
8585489

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9334392           0    9334392    9334392
9334392

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9334392           0    9334392    9334392
9334392
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 0.71 (0.57-0.90) |
  4. | 0.87 (0.69-1.09) |
  5. | 0.76 (0.56-1.03) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.70 (0.55-0.90) |
  9. | 0.83 (0.65-1.06) |
 10. | 0.79 (0.57-1.10) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 0.70 (0.56-0.89) |
 14. | 0.87 (0.69-1.10) |
 15. | 0.75 (0.55-1.02) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 0.74 (0.59-0.94) |
 19. | 0.90 (0.72-1.13) |
 20. | 0.79 (0.58-1.08) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 0.71 (0.57-0.90) |
 24. | 0.87 (0.69-1.09) |
 25. | 0.76 (0.56-1.03) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .7591106   |  .5584368   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.031896                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .8665914   |  .6903654   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.087802                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .7146784   |  .5690513   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .8975732                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                          Non-proportional hazards fitted (N=9334392) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .7908232   |  .5786519   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.08079                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .9000428   |  .7152521   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.132575                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .7418703   |  .5878538   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .9362388                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=8585489) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .7507546   |   .550936   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.023045                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .8705972   |  .6914024   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.096235                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |   .703114   |  .5584335   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .8852787                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=9334392) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .7908739   |  .5711542   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.095118                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .8286169   |   .646329   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.062316                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |   .704637   |  .5506818   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .9016337                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=7665303) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 21. |                               grapho~r                               |
     |                                     21                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .7593822   |  .5586096   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.032315                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 22. |                               grapho~r                               |
     |                                     22                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .8667304   |   .690472   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.087983                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 23. |                               grapho~r                               |
     |                                     23                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .7146789   |  .5690438   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .8975863                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 24. |                               grapho~r                               |
     |                                     24                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=9334392) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 25. |                               grapho~r                               |
     |                                     25                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_MAIN.svg not fo
> und)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_MAIN.svg written in S
> VG format)
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2684524           0    2684524    2684524
2684524

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2531893           0    2531893    2531893
2531893

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2611987           0    2611987    2611987
2611987

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2684524           0    2684524    2684524
2684524

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2684524           0    2684524    2684524
2684524
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 0.86 (0.70-1.06) |
  4. | 0.80 (0.62-1.03) |
  5. | 0.92 (0.68-1.24) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.89 (0.73-1.10) |
  9. | 0.78 (0.60-1.02) |
 10. | 0.90 (0.66-1.23) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 0.84 (0.68-1.03) |
 14. | 0.80 (0.62-1.03) |
 15. | 0.91 (0.67-1.23) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 0.91 (0.74-1.12) |
 19. | 0.79 (0.61-1.03) |
 20. | 0.91 (0.66-1.24) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 0.86 (0.70-1.06) |
 24. | 0.80 (0.62-1.03) |
 25. | 0.92 (0.68-1.24) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .9156424   |  .6779639   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.236646                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .8028635   |  .6233012   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.034155                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .8586866   |  .6986546   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.055375                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                          Non-proportional hazards fitted (N=2684524) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .9074292   |  .6628948   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.242169                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .7897425   |  .6055118   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.030027                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .9113037   |  .7391488   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.123555                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=2611987) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .9107696   |  .6734883   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.231649                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .7983429   |   .619662   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.028547                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .8396524   |  .6825033   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.032986                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=2684524) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .9032521   |  .6619369   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.232541                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .7837001   |  .6019825   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.020272                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |   .893733   |  .7251189   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.101555                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=2531893) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 21. |                               grapho~r                               |
     |                                     21                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .9159616   |  .6781842   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.237106                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 22. |                               grapho~r                               |
     |                                     22                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .8030178   |  .6233894   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.034406                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 23. |                               grapho~r                               |
     |                                     23                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .8584479   |  .6984636   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.055077                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 24. |                               grapho~r                               |
     |                                     24                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=2684524) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 25. |                               grapho~r                               |
     |                                     25                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_MAIN.svg not fo
> und)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_MAIN.svg written in S
> VG format)
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9266919           0    9266919    9266919
9266919

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     7493197           0    7493197    7493197
7493197

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     8733513           0    8733513    8733513
8733513

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9266919           0    9266919    9266919
9266919

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9266919           0    9266919    9266919
9266919
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 0.52 (0.35-0.78) |
  4. | 0.97 (0.71-1.33) |
  5. | 0.84 (0.54-1.30) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.49 (0.31-0.76) |
  9. | 0.91 (0.65-1.28) |
 10. | 0.87 (0.55-1.38) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 0.53 (0.35-0.79) |
 14. | 0.97 (0.71-1.33) |
 15. | 0.83 (0.54-1.30) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 0.55 (0.37-0.82) |
 19. | 0.97 (0.70-1.34) |
 20. | 0.84 (0.53-1.31) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 0.52 (0.35-0.78) |
 24. | 0.97 (0.71-1.33) |
 25. | 0.83 (0.54-1.29) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .8340515   |  .5377268   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.293672                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .9728411   |  .7107093   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.331655                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .5224978   |  .3490472   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .7821406                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                          Non-proportional hazards fitted (N=9266919) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |     .8352   |  .5335721   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.307338                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .9691441   |  .7030334   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.335982                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .5473797   |  .3650938   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .8206784                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=8733513) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .8349432   |    .53588   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.300907                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .9699537   |  .7076717   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.329444                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |   .525968   |  .3513793   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .7873037                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=9266919) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .8692649   |  .5476938   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.379642                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .9137781   |  .6515542   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.281536                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .4875467   |  .3134498   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .7583409                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=7493197) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 21. |                               grapho~r                               |
     |                                     21                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .8355445   |  .5386806   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.296008                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 22. |                               grapho~r                               |
     |                                     22                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .9724982   |   .710509   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.331092                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 23. |                               grapho~r                               |
     |                                     23                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .5232921   |  .3495817   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               .7833207                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 24. |                               grapho~r                               |
     |                                     24                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=9266919) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 25. |                               grapho~r                               |
     |                                     25                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_W2.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_W2.svg written in SVG
>  format)
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2706505           0    2706505    2706505
2706505

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2539976           0    2539976    2539976
2539976

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2651492           0    2651492    2651492
2651492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2706505           0    2706505    2706505
2706505

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2706505           0    2706505    2706505
2706505
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.09 (0.86-1.40) |
  4. | 1.14 (0.86-1.50) |
  5. | 1.44 (1.05-1.97) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.12 (0.87-1.44) |
  9. | 1.08 (0.81-1.45) |
 10. | 1.46 (1.06-2.01) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.09 (0.86-1.40) |
 14. | 1.14 (0.87-1.51) |
 15. | 1.48 (1.08-2.02) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.10 (0.86-1.41) |
 19. | 1.15 (0.87-1.52) |
 20. | 1.46 (1.06-2.00) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 1.09 (0.86-1.40) |
 24. | 1.14 (0.86-1.50) |
 25. | 1.44 (1.05-1.97) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.440614   |   1.05378   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.96945                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.136035   |  .8615962   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.497888                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.094411   |  .8570349   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.397535                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                          Non-proportional hazards fitted (N=2706505) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.459517   |  1.064828   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.000502                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.151704   |    .87079   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.52324                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.102393   |    .86035   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.41253                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=2651492) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |   1.47514   |  1.077857   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.018856                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.142602   |  .8666693   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.506386                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |   1.09314   |  .8554972   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.396796                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=2706505) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.460597   |  1.059689   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.013179                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.079878   |  .8061283   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.446588                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |   1.12318   |  .8747997   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.442083                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=2539976) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 21. |                               grapho~r                               |
     |                                     21                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.440496   |  1.053672   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.96933                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 22. |                               grapho~r                               |
     |                                     22                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.136009   |  .8615543   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.497892                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 23. |                               grapho~r                               |
     |                                     23                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.094293   |  .8569463   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.397377                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 24. |                               grapho~r                               |
     |                                     24                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=2706505) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 25. |                               grapho~r                               |
     |                                     25                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_W2.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_W2.svg written in SVG
>  format)

. log close
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_death.log
  log type:  text
 closed on:   1 Feb 2021, 12:32:41
-------------------------------------------------------------------------------
