-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_icu.log
  log type:  text
 opened on:   1 Feb 2021, 12:33:05

. 
. *set trace on
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach dataset in MAIN W2 {
  3. forvalues x=0/1 {
  4. file write tablecontents_sense ("dataset") ("age") ("`x'") _n
  5. foreach sense in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timesc
> ale time_int SUS_censor {
  6. file write tablecontents_sense _n ("sense=") ("`sense'") _n
  7. forvalues i=1/3 {
  8. local endwith "_tab"
  9. 
.         foreach modeltype of any fulladj {
 10. 
.                 local noestimatesflag 0 /*reset*/
 11. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 12. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 13.             cap estimates use  ./output/an_sense_`outcome'_`sense'_ageband
> _`x'`dataset'
 14.                                 if _rc!=0 local noestimatesflag 1
 15.                                 }
 16. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "!="AAmain" {
 17.                         cap lincom `i'.`variable', eform
 18.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 19.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 20.                         }
 21. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 22.                         if "`modeltype'"=="fulladj" & "`sense'"!="AAmain" 
>  {
 23.                                 local hr = r(estimate)
 24.                                 local lb = r(lb)
 25.                                 local ub = r(ub)
 26.                                 local N=e(N_sub)
 27.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 28.                                 }
 29.                 }
 30.                 } /*min adj, full adj*/
 31. 
. } /*variable levels*/
 32. 
. forvalues i=1/3 {
 33. local endwith "_tab"
 34. 
.         foreach modeltype of any fulladj {
 35. 
.                 local noestimatesflag 0 /*reset*/
 36. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 37. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 /*if "`modeltype'"=="minadj" & "`variable'"!="agegroup" & "`v
> ariable'"!="male" {
>                         cap estimates use ./output/an_univariable_cox_models_
> `outcome'_AGESEX_`variable'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }
>                 if "`modeltype'"=="demogadj" {
>                         cap estimates use ./output/an_multivariate_cox_models
> _`outcome'_`variable'_DEMOGADJ_`sense'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }*/
.                 if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 38.                 cap estimates use  ./output/an_multivariate_cox_models_`ou
> tcome'_`variable'_MAINFULLYADJMODEL_ageband_`x'`dataset'
 39.                                 if _rc!=0 local noestimatesflag 1
 40.                                 }
 41. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "=="AAmain" {
 42.                         cap lincom `i'.`variable', eform
 43.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 44.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 45.                         }
 46. 
.                 *3) Save the estimates for plotting
.                         if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 47.                                 local hr = r(estimate)
 48.                                 local lb = r(lb)
 49.                                 local ub = r(ub)
 50.                                 local N=e(N_sub)
 51.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 52.                                 }
 53. 
.                 } /*min adj, full adj*/
 54. 
. } /*variable levels*/
 55. } /*age levels*/
 56. } /*sense levels*/
 57. } /*datsets*/
 58. 
. end

. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. 
. cap file close tablecontents_sense

. file open tablecontents_sense using ./output/12_an_sense_HRtable_`outcome'_SE
> NSE_ANALYSES.txt, t w replace
(note: file ./output/12_an_sense_HRtable_covid_icu_SENSE_ANALYSES.txt not found
> )

. 
. tempfile HRestimates_sense

. cap postutil clear

. postfile HRestimates_sense str10 dataset str10 x str10 outcome str27 variable
>  str27 sense i hr lci uci N using `HRestimates_sense'

. 
. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(1) max(3) outcome(`outcome')

. file write tablecontents_sense _n

. 
. file close tablecontents_sense

. 
. postclose HRestimates_sense

. 
. *use `HRestimates_sense', clear
. *save HRestimates_sense, replace
. *stop
. 
. foreach dataset in MAIN W2 {
  2. forvalues x=0/1 {
  3. 
. use `HRestimates_sense', clear
  4. keep if x=="`x'"
  5.  
. keep if dataset=="`dataset'"
  6. drop outcome variable
  7. sort sense i
  8. gen varorder = 1
  9. 
. 
. sort varorder sense i
 10. drop varorder
 11. 
. gen obsorder=_n
 12. expand 2 if sense!=sense[_n-1], gen(expanded)
 13. gsort obsorder -expanded
 14. 
. for var hr lci uci: replace X = 1 if expanded==1
 15. 
. drop obsorder
 16. gen obsorder=_n
 17. 
. 
. expand 2 if expanded==1, gen(expanded2)
 18. drop obsorder
 19. gsort sense i -expanded -expanded2
 20. gen obsorder=_n
 21. 
. for var hr lci uci : replace X=. if expanded==1 & expanded2==1
 22. 
. gen varx = 0.03
 23. gen levelx = 0.033
 24. gen intx=0.08
 25. gen lowerlimit = 0.15
 26. gen disx=2.5
 27. 
. *Levels
. gen leveldesc = ""
 28. replace leveldesc = "Only children aged 0-11 years" if i==1 & hr!=1 & hr!=
> .
 29. replace leveldesc = "Only children aged ≥12 years" if i==2
 30. replace leveldesc = "Children aged 0-11 years and ≥12 years" if i==3
 31. 
. gen Name = sense if hr==1
 32. 
. foreach type in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timescale 
> time_int  {
 33. sum N if sense=="`type'"
 34. local number_`type'=r(mean)
 35. di `number_`type''
 36. }
 37. 
. replace Name = "Fully adjusted result  (N=`number_AAmain')" if Name=="AAmain"
 38. replace Name = "Participants with complete BMI and smoking data  (N=`numbe
> r_CCeth_bmi_smok')" if Name=="CCeth_bmi_smok"
 39. replace Name = "Underlying timescale in the cox model revised to age   (N=
> `number_age_underlying_timescale')" if Name=="age_underlying_timescale"
 40. replace Name = "Participants with at least 12 months registration at GP  (
> N=`number_plus_eth_12mo')" if Name=="plus_eth_12mo"
 41. replace Name = "Non-proportional hazards fitted (N=`number_time_int')" if 
> Name=="time_int"
 42. replace Name = "Censor study at 1st November (N=`number_SUS_censor')" if N
> ame=="SUS_censor"
 43. 
. for var hr lci uci: replace X = . if X==1
 44. 
. 
. gen displayhrci = string(hr, "%3.2f") + " (" + string(lci, "%3.2f") + "-" + s
> tring(uci, "%3.2f") + ")"
 45. replace displayhrci="" if hr==.
 46. list display
 47. 
. drop obsorder
 48. 
. gen obsorder=_n
 49. gsort -obsorder
 50. gen graphorder = _n
 51. sort graphorder
 52. list graphorder Name leveldesc hr  lci uci
 53. 
. gen hrtitle="Hazard Ratio (95% CI)" if graphorder == 28
 54. 
. gen bf_hrtitle = "{bf:" + hrtitle + "}"
 55. gen bf_Name = "{bf:" + Name + "}"
 56. 
. scatter graphorder hr, mcol(black)      msize(small)            ///          
>                                                                    ///
>         || rcap lci uci graphorder, hor mcol(black)     lcol(black)          
>            ///
>         || scatter graphorder varx , m(i) mlab(bf_Name) mlabsize(vsmall) mlab
> col(black)         ///
>         || scatter graphorder levelx, m(i) mlab(leveldesc) mlabsize(vsmall) m
> labcol(black)      ///
>         || scatter graphorder disx, m(i) mlab(displayhrci) mlabsize(vsmall) m
> labcol(black) ///
>         || scatter graphorder disx, m(i) mlab(bf_hrtitle) mlabsize(vsmall) ml
> abcol(black) ///
>                 xline(1,lp(solid))                                           
>                                                                            //
> /
>                 xscale(log range(0.1 6)) xlab(0.5 1 2, labsize(vsmall)) xtitl
> e("")  ///
>                 ylab(none) ytitle("")           yscale( lcolor(white))       
>                            ///
>                 graphregion(color(white))  legend(off)  ysize(4) ///
>                 text(-2 0.2 "Lower risk in those living with children", place
> (e) size(vsmall)) ///
>                 text(-2 1.5 "Higher risk in those living with children", plac
> e(e) size(vsmall))
 57. 
. graph export ./output/12_an_HRforest_SENSE_`outcome'_ageband_`x'_`dataset'.sv
> g, as(svg) replace
 58. }
 59. }
(27 observations deleted)
(12 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9334392           0    9334392    9334392
9334392

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     7665303           0    7665303    7665303
7665303

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     8585489           0    8585489    8585489
8585489

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9334392           0    9334392    9334392
9334392

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9334392           0    9334392    9334392
9334392
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 0.91 (0.76-1.07) |
  4. | 1.05 (0.88-1.24) |
  5. | 1.00 (0.81-1.23) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.85 (0.71-1.03) |
  9. | 1.01 (0.84-1.21) |
 10. | 1.02 (0.82-1.26) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 0.90 (0.75-1.06) |
 14. | 1.05 (0.88-1.25) |
 15. | 1.00 (0.81-1.24) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 0.95 (0.80-1.13) |
 19. | 1.08 (0.90-1.28) |
 20. | 1.03 (0.83-1.28) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 0.90 (0.76-1.07) |
 24. | 1.05 (0.88-1.24) |
 25. | 1.00 (0.81-1.23) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .9982641   |  .8095889   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.23091                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |   1.04823   |  .8828738   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.244556                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .9046561   |  .7634691   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.071952                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                          Non-proportional hazards fitted (N=9334392) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.030718   |  .8305284   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.279162                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.076639   |  .9036145   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.282795                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .9493526   |  .7974428   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.130201                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=8585489) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.001663   |  .8098112   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.238967                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.050723   |  .8835855   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.249477                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .8962027   |  .7544181   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.064634                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=9334392) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.015838   |  .8158028   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.264921                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.005768   |  .8371556   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.20834                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .8546314   |  .7116708   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.02631                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=7665303) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 21. |                               grapho~r                               |
     |                                     21                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .9985669   |  .8097942   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.231345                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 22. |                               grapho~r                               |
     |                                     22                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.047787   |  .8824851   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.244053                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 23. |                               grapho~r                               |
     |                                     23                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  .9051911   |  .7638949   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.072623                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 24. |                               grapho~r                               |
     |                                     24                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=9334392) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 25. |                               grapho~r                               |
     |                                     25                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_MAIN.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_MAIN.svg written in SVG
>  format)
(27 observations deleted)
(12 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2684524           0    2684524    2684524
2684524

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2531893           0    2531893    2531893
2531893

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2611987           0    2611987    2611987
2611987

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2684524           0    2684524    2684524
2684524

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2684524           0    2684524    2684524
2684524
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.09 (0.71-1.67) |
  4. | 1.26 (0.75-2.12) |
  5. | 0.87 (0.41-1.85) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.10 (0.72-1.71) |
  9. | 1.16 (0.67-2.02) |
 10. | 0.78 (0.35-1.78) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.08 (0.71-1.66) |
 14. | 1.26 (0.75-2.11) |
 15. | 0.87 (0.41-1.86) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.17 (0.76-1.78) |
 19. | 1.16 (0.67-2.01) |
 20. | 0.79 (0.35-1.79) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 1.08 (0.71-1.66) |
 24. | 1.26 (0.75-2.11) |
 25. | 0.86 (0.40-1.83) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .8560189   |  .4011263   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.826777                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |   1.25925   |  .7505965   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.112599                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |    1.0843   |  .7091151   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.657992                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                          Non-proportional hazards fitted (N=2684524) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .7879593   |  .3474619   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                 1.7869                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |   1.15996   |  .6677805   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.014894                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.166278   |  .7620897   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.784835                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=2611987) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .8709735   |  .4071044   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.863391                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |   1.25735   |  .7484356   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.112311                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.081561   |  .7062209   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.656387                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=2684524) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .7847102   |  .3455497   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.782001                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.163124   |   .668828   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.022729                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.104944   |  .7158473   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.705533                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=2531893) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 21. |                               grapho~r                               |
     |                                     21                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  .8650044   |  .4051625   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.846747                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 22. |                               grapho~r                               |
     |                                     22                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.264654   |  .7540041   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               2.121143                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 23. |                               grapho~r                               |
     |                                     23                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.091587   |  .7137356   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.669472                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 24. |                               grapho~r                               |
     |                                     24                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=2684524) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 25. |                               grapho~r                               |
     |                                     25                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_MAIN.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_MAIN.svg written in SVG
>  format)
(27 observations deleted)
(15 observations deleted)
(4 observations created)

->  replace hr = 1 if expanded==1
(4 real changes made)

->  replace lci = 1 if expanded==1
(4 real changes made)

->  replace uci = 1 if expanded==1
(4 real changes made)
(4 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)
(20 missing values generated)
variable leveldesc was str1 now str29
(4 real changes made)
variable leveldesc was str29 now str30
(4 real changes made)
variable leveldesc was str30 now str40
(4 real changes made)
(16 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9266918           0    9266918    9266918
9266918

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     7493196           0    7493196    7493196
7493196

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     8733512           0    8733512    8733512
8733512

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     9266918           0    9266918    9266918
9266918

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          0
.
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(0 real changes made)
(0 real changes made)

->  replace hr = . if hr==1
(4 real changes made, 4 to missing)

->  replace lci = . if lci==1
(4 real changes made, 4 to missing)

->  replace uci = . if uci==1
(4 real changes made, 4 to missing)
(8 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.19 (0.98-1.43) |
  4. | 1.13 (0.93-1.39) |
  5. | 1.22 (0.96-1.55) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.23 (1.01-1.50) |
  9. | 1.17 (0.94-1.45) |
 10. | 1.17 (0.90-1.52) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.19 (0.99-1.44) |
 14. | 1.13 (0.92-1.38) |
 15. | 1.23 (0.96-1.56) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.21 (1.00-1.46) |
 19. | 1.16 (0.94-1.42) |
 20. | 1.25 (0.98-1.59) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.249195   |  .9799504   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.592415                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.155452   |  .9425954   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.416375                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.207371   |  .9954909   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.464348                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=8733512) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.226663   |   .962912   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.562658                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.125079   |  .9181705   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.378613                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.194939   |  .9890862   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.443635                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=9266918) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.167504   |  .8976865   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.518421                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.167883   |  .9436993   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.445324                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.227554   |  1.005637   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.498441                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=7493196) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.218996   |  .9600962   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.54771                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.132868   |  .9262348   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.385598                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.186703   |  .9831091   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.432459                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=9266918) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(20 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_W2.svg not found)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_W2.svg written in SVG f
> ormat)
(27 observations deleted)
(15 observations deleted)
(4 observations created)

->  replace hr = 1 if expanded==1
(4 real changes made)

->  replace lci = 1 if expanded==1
(4 real changes made)

->  replace uci = 1 if expanded==1
(4 real changes made)
(4 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)
(20 missing values generated)
variable leveldesc was str1 now str29
(4 real changes made)
variable leveldesc was str29 now str30
(4 real changes made)
variable leveldesc was str30 now str40
(4 real changes made)
(16 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2706505           0    2706505    2706505
2706505

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2539976           0    2539976    2539976
2539976

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2651492           0    2651492    2651492
2651492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5     2706505           0    2706505    2706505
2706505

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          0
.
variable Name was str24 now str34
(1 real change made)
variable Name was str34 now str60
(1 real change made)
variable Name was str60 now str66
(1 real change made)
variable Name was str66 now str68
(1 real change made)
(0 real changes made)
(0 real changes made)

->  replace hr = . if hr==1
(4 real changes made, 4 to missing)

->  replace lci = . if lci==1
(4 real changes made, 4 to missing)

->  replace uci = . if uci==1
(4 real changes made, 4 to missing)
(8 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.30 (0.87-1.95) |
  4. | 1.04 (0.59-1.84) |
  5. | 1.86 (1.11-3.14) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.25 (0.82-1.90) |
  9. | 1.07 (0.60-1.90) |
 10. | 1.79 (1.04-3.06) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.32 (0.88-1.99) |
 14. | 1.05 (0.59-1.85) |
 15. | 1.85 (1.10-3.12) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.22 (0.79-1.86) |
 19. | 0.91 (0.49-1.70) |
 20. | 1.95 (1.16-3.28) |
     +------------------+

     +----------------------------------------------------------------------+
  1. |                               grapho~r                               |
     |                                      1                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.947536   |  1.155629   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               3.282107                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. |                               grapho~r                               |
     |                                      2                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  .9109616   |  .4889475   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.697219                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. |                               grapho~r                               |
     |                                      3                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.215541   |  .7941443   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.860542                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. |                               grapho~r                               |
     |                                      4                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     | Participants with at least 12 months registration at GP  (N=2651492) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. |                               grapho~r                               |
     |                                      5                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  6. |                               grapho~r                               |
     |                                      6                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.854879   |  1.101867   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               3.122497                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  7. |                               grapho~r                               |
     |                                      7                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |   1.04508   |  .5907524   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.848815                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  8. |                               grapho~r                               |
     |                                      8                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.324265   |  .8834264   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.985088                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  9. |                               grapho~r                               |
     |                                      9                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |   Underlying timescale in the cox model revised to age   (N=2706505) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 10. |                               grapho~r                               |
     |                                     10                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 11. |                               grapho~r                               |
     |                                     11                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.786497   |  1.041321   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               3.064926                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 12. |                               grapho~r                               |
     |                                     12                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |   1.06951   |  .6031241   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.896545                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 13. |                               grapho~r                               |
     |                                     13                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.250721   |  .8232134   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                1.90024                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 14. |                               grapho~r                               |
     |                                     14                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |         Participants with complete BMI and smoking data  (N=2539976) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 15. |                               grapho~r                               |
     |                                     15                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 16. |                               grapho~r                               |
     |                                     16                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |  Children aged 0-11 years and ≥12 years  |  1.864652   |  1.108265   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                3.13727                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 17. |                               grapho~r                               |
     |                                     17                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |            Only children aged ≥12 years  |  1.037945   |  .5864974   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.836889                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 18. |                               grapho~r                               |
     |                                     18                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |           Only children aged 0-11 years  |  1.303926   |  .8701345   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                               1.953978                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 19. |                               grapho~r                               |
     |                                     19                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                   Fully adjusted result  (N=2706505) |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
 20. |                               grapho~r                               |
     |                                     20                               |
     |----------------------------------------------------------------------|
     |                                                                 Name |
     |                                                                      |
     |----------------------------------------------------------------------|
     |                               leveldesc  |        hr   |       lci   |
     |                                          |         .   |         .   |
     |----------------------------------------------------------------------|
     |                                    uci                               |
     |                                      .                               |
     +----------------------------------------------------------------------+
(20 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_W2.svg not found)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_W2.svg written in SVG f
> ormat)

. log close
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_icu.log
  log type:  text
 closed on:   1 Feb 2021, 12:33:09
-------------------------------------------------------------------------------
