-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_tpp_prob.log
  log type:  text
 opened on:  20 Jul 2021, 14:39:19

. 
. *set trace on
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach dataset in MAIN W2 {
  3. forvalues x=0/1 {
  4. file write tablecontents_sense ("dataset") ("age") ("`x'") _n
  5. foreach sense in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timesc
> ale time_int SUS_censor {
  6. file write tablecontents_sense _n ("sense=") ("`sense'") _n
  7. forvalues i=1/3 {
  8. local endwith "_tab"
  9. 
.         foreach modeltype of any fulladj {
 10. 
.                 local noestimatesflag 0 /*reset*/
 11. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 12. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 13.             cap estimates use  ./output/an_sense_`outcome'_`sense'_ageband
> _`x'`dataset'
 14.                                 if _rc!=0 local noestimatesflag 1
 15.                                 }
 16. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "!="AAmain" {
 17.                         cap lincom `i'.`variable', eform
 18.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 19.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 20.                         }
 21. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 22.                         if "`modeltype'"=="fulladj" & "`sense'"!="AAmain" 
>  {
 23.                                 local hr = r(estimate)
 24.                                 local lb = r(lb)
 25.                                 local ub = r(ub)
 26.                                 local N=e(N_sub)
 27.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 28.                                 }
 29.                 }
 30.                 } /*min adj, full adj*/
 31. 
. } /*variable levels*/
 32. 
. forvalues i=1/3 {
 33. local endwith "_tab"
 34. 
.         foreach modeltype of any fulladj {
 35. 
.                 local noestimatesflag 0 /*reset*/
 36. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 37. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 /*if "`modeltype'"=="minadj" & "`variable'"!="agegroup" & "`v
> ariable'"!="male" {
>                         cap estimates use ./output/an_univariable_cox_models_
> `outcome'_AGESEX_`variable'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }
>                 if "`modeltype'"=="demogadj" {
>                         cap estimates use ./output/an_multivariate_cox_models
> _`outcome'_`variable'_DEMOGADJ_`sense'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }*/
.                 if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 38.                 cap estimates use  ./output/an_multivariate_cox_models_`ou
> tcome'_`variable'_MAINFULLYADJMODEL_ageband_`x'`dataset'
 39.                                 if _rc!=0 local noestimatesflag 1
 40.                                 }
 41. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "=="AAmain" {
 42.                         cap lincom `i'.`variable', eform
 43.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 44.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 45.                         }
 46. 
.                 *3) Save the estimates for plotting
.                         if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 47.                                 local hr = r(estimate)
 48.                                 local lb = r(lb)
 49.                                 local ub = r(ub)
 50.                                 local N=e(N_sub)
 51.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 52.                                 }
 53. 
.                 } /*min adj, full adj*/
 54. 
. } /*variable levels*/
 55. } /*age levels*/
 56. } /*sense levels*/
 57. } /*datsets*/
 58. 
. end

. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. 
. cap file close tablecontents_sense

. file open tablecontents_sense using ./output/12_an_sense_HRtable_`outcome'_SE
> NSE_ANALYSES.txt, t w replace
(note: file ./output/12_an_sense_HRtable_covid_tpp_prob_SENSE_ANALYSES.txt not 
> found)

. 
. tempfile HRestimates_sense

. cap postutil clear

. postfile HRestimates_sense str10 dataset str10 x str10 outcome str27 variable
>  str27 sense i hr lci uci N using `HRestimates_sense'

. 
. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(1) max(3) outcome(`outcome')

. file write tablecontents_sense _n

. 
. file close tablecontents_sense

. 
. postclose HRestimates_sense

. 
. *use `HRestimates_sense', clear
. *save HRestimates_sense, replace
. *stop
. 
. foreach dataset in MAIN W2 {
  2. forvalues x=0/1 {
  3. 
. use `HRestimates_sense', clear
  4. keep if x=="`x'"
  5.  
. keep if dataset=="`dataset'"
  6. drop outcome variable
  7. sort sense i
  8. gen varorder = 1
  9. 
. 
. sort varorder sense i
 10. drop varorder
 11. 
. gen obsorder=_n
 12. expand 2 if sense!=sense[_n-1], gen(expanded)
 13. gsort obsorder -expanded
 14. 
. for var hr lci uci: replace X = 1 if expanded==1
 15. 
. drop obsorder
 16. gen obsorder=_n
 17. 
. 
. expand 2 if expanded==1, gen(expanded2)
 18. drop obsorder
 19. gsort sense i -expanded -expanded2
 20. gen obsorder=_n
 21. 
. for var hr lci uci : replace X=. if expanded==1 & expanded2==1
 22. 
. gen varx = 0.03
 23. gen levelx = 0.033
 24. gen intx=0.08
 25. gen lowerlimit = 0.15
 26. gen disx=2.5
 27. 
. *Levels
. gen leveldesc = ""
 28. replace leveldesc = "Only children aged 0-11 years" if i==1 & hr!=1 & hr!=
> .
 29. replace leveldesc = "Only children aged ≥12 years" if i==2
 30. replace leveldesc = "Children aged 0-11 years and ≥12 years" if i==3
 31. 
. gen Name = sense if hr==1
 32. 
. foreach type in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timescale 
> time_int  {
 33. sum N if sense=="`type'"
 34. local number_`type'=r(mean)
 35. di `number_`type''
 36. }
 37. 
. replace Name = "Fully adjusted result  (N=`number_AAmain')" if Name=="AAmain"
 38. replace Name = "Participants with complete BMI and smoking data  (N=`numbe
> r_CCeth_bmi_smok')" if Name=="CCeth_bmi_smok"
 39. replace Name = "Underlying timescale in the cox model revised to age   (N=
> `number_age_underlying_timescale')" if Name=="age_underlying_timescale"
 40. replace Name = "Participants with at least 12 months registration at GP  (
> N=`number_plus_eth_12mo')" if Name=="plus_eth_12mo"
 41. replace Name = "Non-proportional hazards fitted (N=`number_time_int')" if 
> Name=="time_int"
 42. replace Name = "Censor study at 1st November (N=`number_SUS_censor')" if N
> ame=="SUS_censor"
 43. 
. for var hr lci uci: replace X = . if X==1
 44. 
. 
. gen displayhrci = string(hr, "%3.2f") + " (" + string(lci, "%3.2f") + "-" + s
> tring(uci, "%3.2f") + ")"
 45. replace displayhrci="" if hr==.
 46. list display
 47. 
. drop obsorder
 48. 
. gen obsorder=_n
 49. gsort -obsorder
 50. gen graphorder = _n
 51. sort graphorder
 52. list graphorder Name leveldesc hr  lci uci
 53. 
. gen hrtitle="Hazard Ratio (95% CI)" if graphorder == 28
 54. 
. gen bf_hrtitle = "{bf:" + hrtitle + "}"
 55. gen bf_Name = "{bf:" + Name + "}"
 56. 
. scatter graphorder hr, mcol(black)      msize(small)            ///          
>                                                                    ///
>         || rcap lci uci graphorder, hor mcol(black)     lcol(black)          
>            ///
>         || scatter graphorder varx , m(i) mlab(bf_Name) mlabsize(vsmall) mlab
> col(black)         ///
>         || scatter graphorder levelx, m(i) mlab(leveldesc) mlabsize(vsmall) m
> labcol(black)      ///
>         || scatter graphorder disx, m(i) mlab(displayhrci) mlabsize(vsmall) m
> labcol(black) ///
>         || scatter graphorder disx, m(i) mlab(bf_hrtitle) mlabsize(vsmall) ml
> abcol(black) ///
>                 xline(1,lp(solid))                                           
>                                                                            //
> /
>                 xscale(log range(0.1 6)) xlab(0.5 1 2, labsize(vsmall)) xtitl
> e("")  ///
>                 ylab(none) ytitle("")           yscale( lcolor(white))       
>                            ///
>                 graphregion(color(white))  legend(off)  ysize(4) ///
>                 text(-2 0.2 "Lower risk in those living with children", place
> (e) size(vsmall)) ///
>                 text(-2 1.5 "Higher risk in those living with children", plac
> e(e) size(vsmall))
 57. 
. graph export ./output/12_an_HRforest_SENSE_`outcome'_ageband_`x'_`dataset'.sv
> g, as(svg) replace
 58. }
 59. }
(24 observations deleted)
(15 observations deleted)
(4 observations created)

->  replace hr = 1 if expanded==1
(4 real changes made)

->  replace lci = 1 if expanded==1
(4 real changes made)

->  replace uci = 1 if expanded==1
(4 real changes made)
(4 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)
(20 missing values generated)
variable leveldesc was str1 now str29
(4 real changes made)
variable leveldesc was str29 now str30
(4 real changes made)
variable leveldesc was str30 now str40
(4 real changes made)
(16 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        2319           0       2319       2319
2319

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       15442           0      15442      15442
15442

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          0
.
variable Name was str24 now str32
(1 real change made)
variable Name was str32 now str57
(1 real change made)
variable Name was str57 now str64
(1 real change made)
variable Name was str64 now str66
(1 real change made)
(0 real changes made)
(0 real changes made)

->  replace hr = . if hr==1
(4 real changes made, 4 to missing)

->  replace lci = . if lci==1
(4 real changes made, 4 to missing)

->  replace uci = . if uci==1
(4 real changes made, 4 to missing)
(8 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.17 (0.99-1.38) |
  4. | 1.26 (1.00-1.59) |
  5. | 1.09 (0.94-1.27) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.18 (0.76-1.83) |
  9. | 1.17 (0.63-2.16) |
 10. | 1.00 (0.67-1.49) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.14 (0.97-1.34) |
 14. | 1.23 (0.99-1.53) |
 15. | 1.05 (0.90-1.22) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.18 (1.00-1.40) |
 19. | 1.17 (0.93-1.47) |
 20. | 1.09 (0.94-1.27) |
     +------------------+

     +--------------------------------------------------------------------+
  1. |                              grapho~r                              |
     |                                     1                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.092273  |  .9385775  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.271137                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |                              grapho~r                              |
     |                                     2                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.171485  |  .9320669  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.472402                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |                              grapho~r                              |
     |                                     3                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.184943  |   1.00464  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.397604                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |                              grapho~r                              |
     |                                     4                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     | Participants with at least 12 months registration at GP  (N=15442) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |                              grapho~r                              |
     |                                     5                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |                              grapho~r                              |
     |                                     6                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.049182  |  .9026634  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.219483                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |                              grapho~r                              |
     |                                     7                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |   1.23095  |  .9894078  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.531459                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |                              grapho~r                              |
     |                                     8                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |   1.14058  |  .9693627  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.342038                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |                              grapho~r                              |
     |                                     9                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |   Underlying timescale in the cox model revised to age   (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |                              grapho~r                              |
     |                                    10                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 11. |                              grapho~r                              |
     |                                    11                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .9982998  |  .6675003  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.493037                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 12. |                              grapho~r                              |
     |                                    12                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.171012  |  .6348849  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              2.159871                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 13. |                              grapho~r                              |
     |                                    13                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |   1.18031  |  .7600287  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.832997                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 14. |                              grapho~r                              |
     |                                    14                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |          Participants with complete BMI and smoking data  (N=2319) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 15. |                              grapho~r                              |
     |                                    15                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 16. |                              grapho~r                              |
     |                                    16                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.089364  |   .935258  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.268862                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 17. |                              grapho~r                              |
     |                                    17                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.263431  |  1.004855  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.588546                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 18. |                              grapho~r                              |
     |                                    18                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.171074  |  .9927136  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                               1.38148                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 19. |                              grapho~r                              |
     |                                    19                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                   Fully adjusted result  (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 20. |                              grapho~r                              |
     |                                    20                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+
(20 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_0_MAIN.svg not
>  found)
(file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_0_MAIN.svg written i
> n SVG format)
(27 observations deleted)
(12 observations deleted)
(4 observations created)

->  replace hr = 1 if expanded==1
(4 real changes made)

->  replace lci = 1 if expanded==1
(4 real changes made)

->  replace uci = 1 if expanded==1
(4 real changes made)
(4 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)
(20 missing values generated)
variable leveldesc was str1 now str29
(4 real changes made)
variable leveldesc was str29 now str30
(4 real changes made)
variable leveldesc was str30 now str40
(4 real changes made)
(16 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5         623           0        623        623
623

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4212           0       4212       4212
4212

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          0
.
variable Name was str24 now str31
(1 real change made)
variable Name was str31 now str56
(1 real change made)
variable Name was str56 now str63
(1 real change made)
variable Name was str63 now str65
(1 real change made)
(0 real changes made)
(0 real changes made)

->  replace hr = . if hr==1
(4 real changes made, 4 to missing)

->  replace lci = . if lci==1
(4 real changes made, 4 to missing)

->  replace uci = . if uci==1
(4 real changes made, 4 to missing)
(8 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.25 (0.93-1.66) |
  4. | 0.75 (0.48-1.18) |
  5. | 0.93 (0.71-1.20) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.74 (0.72-4.20) |
  9. | 0.00 (0.00-0.00) |
 10. | 1.49 (0.65-3.39) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.29 (0.96-1.72) |
 14. | 0.81 (0.52-1.27) |
 15. | 0.97 (0.75-1.26) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.26 (0.94-1.68) |
 19. | 0.68 (0.41-1.13) |
 20. | 0.94 (0.72-1.23) |
     +------------------+

     +-------------------------------------------------------------------+
  1. |                             grapho~r                              |
     |                                    1                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9410195  |  .7212721  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.227717                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  2. |                             grapho~r                              |
     |                                    2                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .6801273  |  .4087707  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              1.13162                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  3. |                             grapho~r                              |
     |                                    3                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.256504  |  .9372485  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.684508                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  4. |                             grapho~r                              |
     |                                    4                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     | Participants with at least 12 months registration at GP  (N=4212) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  5. |                             grapho~r                              |
     |                                    5                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  6. |                             grapho~r                              |
     |                                    6                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9707293  |  .7483196  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.259242                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  7. |                             grapho~r                              |
     |                                    7                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |   .812977  |  .5217402  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.266783                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  8. |                             grapho~r                              |
     |                                    8                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.286212  |  .9625802  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.718654                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  9. |                             grapho~r                              |
     |                                    9                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |   Underlying timescale in the cox model revised to age   (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 10. |                             grapho~r                              |
     |                                   10                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 11. |                             grapho~r                              |
     |                                   11                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.486037  |  .6518037  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             3.387994                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 12. |                             grapho~r                              |
     |                                   12                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.01e-19  |  2.37e-20  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             4.33e-19                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 13. |                             grapho~r                              |
     |                                   13                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.739621  |  .7200713  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             4.202753                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 14. |                             grapho~r                              |
     |                                   14                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |          Participants with complete BMI and smoking data  (N=623) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 15. |                             grapho~r                              |
     |                                   15                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 16. |                             grapho~r                              |
     |                                   16                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9266934  |  .7128156  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.204745                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 17. |                             grapho~r                              |
     |                                   17                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .7546769  |  .4838132  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.177184                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 18. |                             grapho~r                              |
     |                                   18                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |   1.24612  |  .9329732  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.664373                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 19. |                             grapho~r                              |
     |                                   19                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                   Fully adjusted result  (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 20. |                             grapho~r                              |
     |                                   20                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+
(20 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_1_MAIN.svg not
>  found)
(file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_1_MAIN.svg written i
> n SVG format)
(24 observations deleted)
(12 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        2227           0       2227       2227
2227

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       15261           0      15261      15261
15261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050
variable Name was str24 now str32
(1 real change made)
variable Name was str32 now str57
(1 real change made)
variable Name was str57 now str64
(1 real change made)
variable Name was str64 now str66
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.18 (0.95-1.48) |
  4. | 1.33 (0.99-1.78) |
  5. | 1.15 (0.93-1.42) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.05 (0.53-2.04) |
  9. | 1.03 (0.45-2.36) |
 10. | 1.00 (0.53-1.89) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.17 (0.94-1.47) |
 14. | 1.32 (0.99-1.76) |
 15. | 1.15 (0.93-1.43) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.17 (0.93-1.48) |
 19. | 1.34 (0.99-1.82) |
 20. | 1.14 (0.91-1.42) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 1.18 (0.95-1.48) |
 24. | 1.32 (0.99-1.77) |
 25. | 1.15 (0.93-1.42) |
     +------------------+

     +--------------------------------------------------------------------+
  1. |                              grapho~r                              |
     |                                     1                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |    1.1482  |  .9278669  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.420854                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |                              grapho~r                              |
     |                                     2                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.323504  |  .9903629  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.768708                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |                              grapho~r                              |
     |                                     3                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.181756  |  .9459442  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.476351                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |                              grapho~r                              |
     |                                     4                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                          Non-proportional hazards fitted (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |                              grapho~r                              |
     |                                     5                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |                              grapho~r                              |
     |                                     6                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.137754  |   .911947  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.419472                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |                              grapho~r                              |
     |                                     7                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.339731  |  .9862183  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.819961                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |                              grapho~r                              |
     |                                     8                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.174575  |  .9327198  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.479144                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |                              grapho~r                              |
     |                                     9                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     | Participants with at least 12 months registration at GP  (N=15261) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |                              grapho~r                              |
     |                                    10                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 11. |                              grapho~r                              |
     |                                    11                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.149346  |  .9255443  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.427264                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 12. |                              grapho~r                              |
     |                                    12                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.317557  |  .9881456  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.756781                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 13. |                              grapho~r                              |
     |                                    13                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.174533  |  .9370792  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.472158                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 14. |                              grapho~r                              |
     |                                    14                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |   Underlying timescale in the cox model revised to age   (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 15. |                              grapho~r                              |
     |                                    15                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 16. |                              grapho~r                              |
     |                                    16                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .9985663  |  .5283794  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.887156                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 17. |                              grapho~r                              |
     |                                    17                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.034899  |  .4544589  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              2.356683                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 18. |                              grapho~r                              |
     |                                    18                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.045329  |  .5347749  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              2.043314                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 19. |                              grapho~r                              |
     |                                    19                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |          Participants with complete BMI and smoking data  (N=2227) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 20. |                              grapho~r                              |
     |                                    20                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 21. |                              grapho~r                              |
     |                                    21                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |   1.15057  |  .9290372  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.424929                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 22. |                              grapho~r                              |
     |                                    22                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.327501  |  .9923572  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.775832                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 23. |                              grapho~r                              |
     |                                    23                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.184298  |  .9472827  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.480615                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 24. |                              grapho~r                              |
     |                                    24                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                   Fully adjusted result  (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 25. |                              grapho~r                              |
     |                                    25                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_0_W2.svg not f
> ound)
(file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_0_W2.svg written in 
> SVG format)
(27 observations deleted)
(12 observations deleted)
(4 observations created)

->  replace hr = 1 if expanded==1
(4 real changes made)

->  replace lci = 1 if expanded==1
(4 real changes made)

->  replace uci = 1 if expanded==1
(4 real changes made)
(4 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)
(20 missing values generated)
variable leveldesc was str1 now str29
(4 real changes made)
variable leveldesc was str29 now str30
(4 real changes made)
variable leveldesc was str30 now str40
(4 real changes made)
(16 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4519           0       4519       4519
4519

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5         647           0        647        647
647

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4280           0       4280       4280
4280

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4519           0       4519       4519
4519

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          0
.
variable Name was str24 now str31
(1 real change made)
variable Name was str31 now str56
(1 real change made)
variable Name was str56 now str63
(1 real change made)
variable Name was str63 now str65
(1 real change made)
(0 real changes made)
(0 real changes made)

->  replace hr = . if hr==1
(4 real changes made, 4 to missing)

->  replace lci = . if lci==1
(4 real changes made, 4 to missing)

->  replace uci = . if uci==1
(4 real changes made, 4 to missing)
(8 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.00 (0.66-1.51) |
  4. | 0.92 (0.50-1.70) |
  5. | 1.06 (0.71-1.57) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.74 (0.19-2.79) |
  9. | 1.25 (0.22-7.02) |
 10. | 0.83 (0.23-2.94) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 0.91 (0.61-1.37) |
 14. | 1.03 (0.56-1.89) |
 15. | 0.99 (0.67-1.47) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.01 (0.67-1.52) |
 19. | 0.89 (0.48-1.64) |
 20. | 1.07 (0.72-1.58) |
     +------------------+

     +-------------------------------------------------------------------+
  1. |                             grapho~r                              |
     |                                    1                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.067836  |  .7203471  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              1.58295                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  2. |                             grapho~r                              |
     |                                    2                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .8893889  |  .4831288  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.637271                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  3. |                             grapho~r                              |
     |                                    3                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.006221  |  .6658399  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.520608                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  4. |                             grapho~r                              |
     |                                    4                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     | Participants with at least 12 months registration at GP  (N=4280) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  5. |                             grapho~r                              |
     |                                    5                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  6. |                             grapho~r                              |
     |                                    6                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9915127  |  .6693513  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.468732                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  7. |                             grapho~r                              |
     |                                    7                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |   1.03427  |  .5645955  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.894655                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  8. |                             grapho~r                              |
     |                                    8                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .9130249  |  .6062987  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.374924                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  9. |                             grapho~r                              |
     |                                    9                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |   Underlying timescale in the cox model revised to age   (N=4519) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 10. |                             grapho~r                              |
     |                                   10                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 11. |                             grapho~r                              |
     |                                   11                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .8301436  |  .2340911  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              2.94389                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 12. |                             grapho~r                              |
     |                                   12                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.248683  |  .2220764  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             7.021055                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 13. |                             grapho~r                              |
     |                                   13                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7367257  |  .1946022  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.789099                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 14. |                             grapho~r                              |
     |                                   14                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |          Participants with complete BMI and smoking data  (N=647) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 15. |                             grapho~r                              |
     |                                   15                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 16. |                             grapho~r                              |
     |                                   16                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.060197  |  .7149518  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.572158                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 17. |                             grapho~r                              |
     |                                   17                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .9221205  |  .4994783  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.702389                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 18. |                             grapho~r                              |
     |                                   18                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.001444  |  .6631972  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.512204                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 19. |                             grapho~r                              |
     |                                   19                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                   Fully adjusted result  (N=4519) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 20. |                             grapho~r                              |
     |                                   20                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+
(20 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_1_W2.svg not f
> ound)
(file ./output/12_an_HRforest_SENSE_covid_tpp_prob_ageband_1_W2.svg written in 
> SVG format)

. log close
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_tpp_prob.log
  log type:  text
 closed on:  20 Jul 2021, 14:39:24
-------------------------------------------------------------------------------
