-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_death.log
  log type:  text
 opened on:  20 Jul 2021, 14:39:34

. 
. *set trace on
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach dataset in MAIN W2 {
  3. forvalues x=0/1 {
  4. file write tablecontents_sense ("dataset") ("age") ("`x'") _n
  5. foreach sense in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timesc
> ale time_int SUS_censor {
  6. file write tablecontents_sense _n ("sense=") ("`sense'") _n
  7. forvalues i=1/3 {
  8. local endwith "_tab"
  9. 
.         foreach modeltype of any fulladj {
 10. 
.                 local noestimatesflag 0 /*reset*/
 11. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 12. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 13.             cap estimates use  ./output/an_sense_`outcome'_`sense'_ageband
> _`x'`dataset'
 14.                                 if _rc!=0 local noestimatesflag 1
 15.                                 }
 16. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "!="AAmain" {
 17.                         cap lincom `i'.`variable', eform
 18.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 19.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 20.                         }
 21. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 22.                         if "`modeltype'"=="fulladj" & "`sense'"!="AAmain" 
>  {
 23.                                 local hr = r(estimate)
 24.                                 local lb = r(lb)
 25.                                 local ub = r(ub)
 26.                                 local N=e(N_sub)
 27.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 28.                                 }
 29.                 }
 30.                 } /*min adj, full adj*/
 31. 
. } /*variable levels*/
 32. 
. forvalues i=1/3 {
 33. local endwith "_tab"
 34. 
.         foreach modeltype of any fulladj {
 35. 
.                 local noestimatesflag 0 /*reset*/
 36. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 37. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 /*if "`modeltype'"=="minadj" & "`variable'"!="agegroup" & "`v
> ariable'"!="male" {
>                         cap estimates use ./output/an_univariable_cox_models_
> `outcome'_AGESEX_`variable'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }
>                 if "`modeltype'"=="demogadj" {
>                         cap estimates use ./output/an_multivariate_cox_models
> _`outcome'_`variable'_DEMOGADJ_`sense'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }*/
.                 if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 38.                 cap estimates use  ./output/an_multivariate_cox_models_`ou
> tcome'_`variable'_MAINFULLYADJMODEL_ageband_`x'`dataset'
 39.                                 if _rc!=0 local noestimatesflag 1
 40.                                 }
 41. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "=="AAmain" {
 42.                         cap lincom `i'.`variable', eform
 43.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 44.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 45.                         }
 46. 
.                 *3) Save the estimates for plotting
.                         if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 47.                                 local hr = r(estimate)
 48.                                 local lb = r(lb)
 49.                                 local ub = r(ub)
 50.                                 local N=e(N_sub)
 51.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 52.                                 }
 53. 
.                 } /*min adj, full adj*/
 54. 
. } /*variable levels*/
 55. } /*age levels*/
 56. } /*sense levels*/
 57. } /*datsets*/
 58. 
. end

. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. 
. cap file close tablecontents_sense

. file open tablecontents_sense using ./output/12_an_sense_HRtable_`outcome'_SE
> NSE_ANALYSES.txt, t w replace
(note: file ./output/12_an_sense_HRtable_covid_death_SENSE_ANALYSES.txt not fou
> nd)

. 
. tempfile HRestimates_sense

. cap postutil clear

. postfile HRestimates_sense str10 dataset str10 x str10 outcome str27 variable
>  str27 sense i hr lci uci N using `HRestimates_sense'

. 
. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(1) max(3) outcome(`outcome')

. file write tablecontents_sense _n

. 
. file close tablecontents_sense

. 
. postclose HRestimates_sense

. 
. *use `HRestimates_sense', clear
. *save HRestimates_sense, replace
. *stop
. 
. foreach dataset in MAIN W2 {
  2. forvalues x=0/1 {
  3. 
. use `HRestimates_sense', clear
  4. keep if x=="`x'"
  5.  
. keep if dataset=="`dataset'"
  6. drop outcome variable
  7. sort sense i
  8. gen varorder = 1
  9. 
. 
. sort varorder sense i
 10. drop varorder
 11. 
. gen obsorder=_n
 12. expand 2 if sense!=sense[_n-1], gen(expanded)
 13. gsort obsorder -expanded
 14. 
. for var hr lci uci: replace X = 1 if expanded==1
 15. 
. drop obsorder
 16. gen obsorder=_n
 17. 
. 
. expand 2 if expanded==1, gen(expanded2)
 18. drop obsorder
 19. gsort sense i -expanded -expanded2
 20. gen obsorder=_n
 21. 
. for var hr lci uci : replace X=. if expanded==1 & expanded2==1
 22. 
. gen varx = 0.03
 23. gen levelx = 0.033
 24. gen intx=0.08
 25. gen lowerlimit = 0.15
 26. gen disx=2.5
 27. 
. *Levels
. gen leveldesc = ""
 28. replace leveldesc = "Only children aged 0-11 years" if i==1 & hr!=1 & hr!=
> .
 29. replace leveldesc = "Only children aged ≥12 years" if i==2
 30. replace leveldesc = "Children aged 0-11 years and ≥12 years" if i==3
 31. 
. gen Name = sense if hr==1
 32. 
. foreach type in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timescale 
> time_int  {
 33. sum N if sense=="`type'"
 34. local number_`type'=r(mean)
 35. di `number_`type''
 36. }
 37. 
. replace Name = "Fully adjusted result  (N=`number_AAmain')" if Name=="AAmain"
 38. replace Name = "Participants with complete BMI and smoking data  (N=`numbe
> r_CCeth_bmi_smok')" if Name=="CCeth_bmi_smok"
 39. replace Name = "Underlying timescale in the cox model revised to age   (N=
> `number_age_underlying_timescale')" if Name=="age_underlying_timescale"
 40. replace Name = "Participants with at least 12 months registration at GP  (
> N=`number_plus_eth_12mo')" if Name=="plus_eth_12mo"
 41. replace Name = "Non-proportional hazards fitted (N=`number_time_int')" if 
> Name=="time_int"
 42. replace Name = "Censor study at 1st November (N=`number_SUS_censor')" if N
> ame=="SUS_censor"
 43. 
. for var hr lci uci: replace X = . if X==1
 44. 
. 
. gen displayhrci = string(hr, "%3.2f") + " (" + string(lci, "%3.2f") + "-" + s
> tring(uci, "%3.2f") + ")"
 45. replace displayhrci="" if hr==.
 46. list display
 47. 
. drop obsorder
 48. 
. gen obsorder=_n
 49. gsort -obsorder
 50. gen graphorder = _n
 51. sort graphorder
 52. list graphorder Name leveldesc hr  lci uci
 53. 
. gen hrtitle="Hazard Ratio (95% CI)" if graphorder == 28
 54. 
. gen bf_hrtitle = "{bf:" + hrtitle + "}"
 55. gen bf_Name = "{bf:" + Name + "}"
 56. 
. scatter graphorder hr, mcol(black)      msize(small)            ///          
>                                                                    ///
>         || rcap lci uci graphorder, hor mcol(black)     lcol(black)          
>            ///
>         || scatter graphorder varx , m(i) mlab(bf_Name) mlabsize(vsmall) mlab
> col(black)         ///
>         || scatter graphorder levelx, m(i) mlab(leveldesc) mlabsize(vsmall) m
> labcol(black)      ///
>         || scatter graphorder disx, m(i) mlab(displayhrci) mlabsize(vsmall) m
> labcol(black) ///
>         || scatter graphorder disx, m(i) mlab(bf_hrtitle) mlabsize(vsmall) ml
> abcol(black) ///
>                 xline(1,lp(solid))                                           
>                                                                            //
> /
>                 xscale(log range(0.1 6)) xlab(0.5 1 2, labsize(vsmall)) xtitl
> e("")  ///
>                 ylab(none) ytitle("")           yscale( lcolor(white))       
>                            ///
>                 graphregion(color(white))  legend(off)  ysize(4) ///
>                 text(-2 0.2 "Lower risk in those living with children", place
> (e) size(vsmall)) ///
>                 text(-2 1.5 "Higher risk in those living with children", plac
> e(e) size(vsmall))
 57. 
. graph export ./output/12_an_HRforest_SENSE_`outcome'_ageband_`x'_`dataset'.sv
> g, as(svg) replace
 58. }
 59. }
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        2319           0       2319       2319
2319

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       15442           0      15442      15442
15442

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252
variable Name was str24 now str32
(1 real change made)
variable Name was str32 now str57
(1 real change made)
variable Name was str57 now str64
(1 real change made)
variable Name was str64 now str66
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.02 (0.83-1.26) |
  4. | 0.91 (0.63-1.33) |
  5. | 1.05 (0.87-1.27) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.14 (0.57-2.29) |
  9. | 1.33 (0.57-3.08) |
 10. | 1.10 (0.58-2.07) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.04 (0.84-1.29) |
 14. | 0.93 (0.64-1.35) |
 15. | 1.05 (0.87-1.28) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.01 (0.81-1.26) |
 19. | 0.85 (0.59-1.23) |
 20. | 1.06 (0.87-1.29) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 1.02 (0.83-1.26) |
 24. | 0.91 (0.63-1.33) |
 25. | 1.05 (0.87-1.27) |
     +------------------+

     +--------------------------------------------------------------------+
  1. |                              grapho~r                              |
     |                                     1                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.050441  |  .8676167  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.271789                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |                              grapho~r                              |
     |                                     2                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  .9107661  |  .6259787  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.325117                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |                              grapho~r                              |
     |                                     3                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.020971  |  .8263471  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.261433                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |                              grapho~r                              |
     |                                     4                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                          Non-proportional hazards fitted (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |                              grapho~r                              |
     |                                     5                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |                              grapho~r                              |
     |                                     6                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.062941  |  .8748499  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.291472                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |                              grapho~r                              |
     |                                     7                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  .8534438  |  .5928426  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                1.2286                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |                              grapho~r                              |
     |                                     8                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.010364  |  .8133926  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.255035                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |                              grapho~r                              |
     |                                     9                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     | Participants with at least 12 months registration at GP  (N=15442) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |                              grapho~r                              |
     |                                    10                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 11. |                              grapho~r                              |
     |                                    11                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.053585  |  .8695678  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.276544                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 12. |                              grapho~r                              |
     |                                    12                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  .9281378  |  .6373591  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.351577                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 13. |                              grapho~r                              |
     |                                    13                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.039796  |  .8404503  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.286424                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 14. |                              grapho~r                              |
     |                                    14                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |   Underlying timescale in the cox model revised to age   (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 15. |                              grapho~r                              |
     |                                    15                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 16. |                              grapho~r                              |
     |                                    16                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.096561  |  .5799558  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                               2.07334                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 17. |                              grapho~r                              |
     |                                    17                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.329963  |  .5744819  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                               3.07895                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 18. |                              grapho~r                              |
     |                                    18                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.139802  |   .566623  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              2.292794                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 19. |                              grapho~r                              |
     |                                    19                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |          Participants with complete BMI and smoking data  (N=2319) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 20. |                              grapho~r                              |
     |                                    20                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 21. |                              grapho~r                              |
     |                                    21                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.051685  |  .8687814  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.273095                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 22. |                              grapho~r                              |
     |                                    22                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |    .91267  |  .6273222  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.327813                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 23. |                              grapho~r                              |
     |                                    23                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.022587  |  .8278024  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.263206                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 24. |                              grapho~r                              |
     |                                    24                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                   Fully adjusted result  (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 25. |                              grapho~r                              |
     |                                    25                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_MAIN.svg not fo
> und)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_MAIN.svg written in S
> VG format)
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5         623           0        623        623
623

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4212           0       4212       4212
4212

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436
variable Name was str24 now str31
(1 real change made)
variable Name was str31 now str56
(1 real change made)
variable Name was str56 now str63
(1 real change made)
variable Name was str63 now str65
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +--------------------+
     |        displayhrci |
     |--------------------|
  1. |                    |
  2. |                    |
  3. |   1.27 (0.82-1.97) |
  4. |   1.34 (0.69-2.62) |
  5. |   1.31 (0.88-1.96) |
     |--------------------|
  6. |                    |
  7. |                    |
  8. |  2.77 (0.56-13.68) |
  9. | 1.35 (0.01-140.55) |
 10. |  2.78 (0.60-12.79) |
     |--------------------|
 11. |                    |
 12. |                    |
 13. |   1.27 (0.80-2.01) |
 14. |   1.37 (0.71-2.63) |
 15. |   1.27 (0.84-1.93) |
     |--------------------|
 16. |                    |
 17. |                    |
 18. |   1.31 (0.83-2.09) |
 19. |   1.55 (0.79-3.05) |
 20. |   1.35 (0.88-2.06) |
     |--------------------|
 21. |                    |
 22. |                    |
 23. |   1.27 (0.81-1.97) |
 24. |   1.34 (0.69-2.61) |
 25. |   1.31 (0.88-1.96) |
     +--------------------+

     +-------------------------------------------------------------------+
  1. |                             grapho~r                              |
     |                                    1                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.309899  |  .8757104  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.959363                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  2. |                             grapho~r                              |
     |                                    2                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.342635  |  .6895183  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              2.61439                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  3. |                             grapho~r                              |
     |                                    3                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.265042  |  .8141761  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.965585                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  4. |                             grapho~r                              |
     |                                    4                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                          Non-proportional hazards fitted (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  5. |                             grapho~r                              |
     |                                    5                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  6. |                             grapho~r                              |
     |                                    6                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.347934  |  .8824756  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.058896                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  7. |                             grapho~r                              |
     |                                    7                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.550333  |  .7880021  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              3.05016                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  8. |                             grapho~r                              |
     |                                    8                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |   1.31478  |   .825622  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.093752                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  9. |                             grapho~r                              |
     |                                    9                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     | Participants with at least 12 months registration at GP  (N=4212) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 10. |                             grapho~r                              |
     |                                   10                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 11. |                             grapho~r                              |
     |                                   11                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.271447  |  .8379279  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.929257                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 12. |                             grapho~r                              |
     |                                   12                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.365797  |  .7086671  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.632269                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 13. |                             grapho~r                              |
     |                                   13                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.270404  |  .8042942  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.006637                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 14. |                             grapho~r                              |
     |                                   14                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |   Underlying timescale in the cox model revised to age   (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 15. |                             grapho~r                              |
     |                                   15                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 16. |                             grapho~r                              |
     |                                   16                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  2.779168  |  .6040481  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             12.78668                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 17. |                             grapho~r                              |
     |                                   17                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.346912  |  .0129075  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             140.5521                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 18. |                             grapho~r                              |
     |                                   18                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |   2.76935  |  .5605672  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             13.68131                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 19. |                             grapho~r                              |
     |                                   19                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |          Participants with complete BMI and smoking data  (N=623) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 20. |                             grapho~r                              |
     |                                   20                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 21. |                             grapho~r                              |
     |                                   21                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.311241  |  .8762751  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.962116                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 22. |                             grapho~r                              |
     |                                   22                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.343085  |  .6889082  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              2.61846                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 23. |                             grapho~r                              |
     |                                   23                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.268153  |  .8157528  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.971446                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 24. |                             grapho~r                              |
     |                                   24                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                   Fully adjusted result  (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 25. |                             grapho~r                              |
     |                                   25                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_MAIN.svg not fo
> und)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_MAIN.svg written in S
> VG format)
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        2227           0       2227       2227
2227

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       15261           0      15261      15261
15261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050
variable Name was str24 now str32
(1 real change made)
variable Name was str32 now str57
(1 real change made)
variable Name was str57 now str64
(1 real change made)
variable Name was str64 now str66
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.17 (0.89-1.54) |
  4. | 1.01 (0.71-1.43) |
  5. | 1.23 (0.96-1.58) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.40 (0.17-0.92) |
  9. | 0.32 (0.09-1.14) |
 10. | 0.41 (0.19-0.90) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.18 (0.88-1.56) |
 14. | 1.00 (0.69-1.44) |
 15. | 1.24 (0.95-1.61) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.14 (0.86-1.51) |
 19. | 1.00 (0.70-1.44) |
 20. | 1.21 (0.94-1.56) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 1.17 (0.89-1.54) |
 24. | 1.01 (0.71-1.43) |
 25. | 1.23 (0.96-1.58) |
     +------------------+

     +--------------------------------------------------------------------+
  1. |                              grapho~r                              |
     |                                     1                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.231154  |  .9589836  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.580568                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |                              grapho~r                              |
     |                                     2                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.005944  |  .7096339  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.425979                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |                              grapho~r                              |
     |                                     3                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.172621  |  .8932332  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.539396                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |                              grapho~r                              |
     |                                     4                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                          Non-proportional hazards fitted (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |                              grapho~r                              |
     |                                     5                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |                              grapho~r                              |
     |                                     6                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |   1.20976  |  .9359443  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.563683                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |                              grapho~r                              |
     |                                     7                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |   1.00166  |  .6951408  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.443338                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |                              grapho~r                              |
     |                                     8                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.143664  |  .8647076  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.512612                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |                              grapho~r                              |
     |                                     9                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     | Participants with at least 12 months registration at GP  (N=15261) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |                              grapho~r                              |
     |                                    10                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 11. |                              grapho~r                              |
     |                                    11                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.235497  |  .9471456  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.611636                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 12. |                              grapho~r                              |
     |                                    12                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  .9996002  |  .6923535  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.443194                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 13. |                              grapho~r                              |
     |                                    13                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.176157  |  .8841925  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                               1.56453                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 14. |                              grapho~r                              |
     |                                    14                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |   Underlying timescale in the cox model revised to age   (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 15. |                              grapho~r                              |
     |                                    15                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 16. |                              grapho~r                              |
     |                                    16                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .4140399  |  .1905386  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              .8997074                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 17. |                              grapho~r                              |
     |                                    17                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  .3205711  |  .0898117  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.144236                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 18. |                              grapho~r                              |
     |                                    18                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  .3993703  |  .1728808  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              .9225814                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 19. |                              grapho~r                              |
     |                                    19                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |          Participants with complete BMI and smoking data  (N=2227) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 20. |                              grapho~r                              |
     |                                    20                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 21. |                              grapho~r                              |
     |                                    21                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.231363  |  .9593011  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.580584                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 22. |                              grapho~r                              |
     |                                    22                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.005812  |  .7097119  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.425449                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 23. |                              grapho~r                              |
     |                                    23                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.172778  |  .8934789  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.539384                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 24. |                              grapho~r                              |
     |                                    24                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                   Fully adjusted result  (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 25. |                              grapho~r                              |
     |                                    25                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_W2.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_0_W2.svg written in SVG
>  format)
(30 observations deleted)
(15 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4519           0       4519       4519
4519

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5         647           0        647        647
647

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4280           0       4280       4280
4280

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4519           0       4519       4519
4519

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4519           0       4519       4519
4519
variable Name was str24 now str31
(1 real change made)
variable Name was str31 now str56
(1 real change made)
variable Name was str56 now str63
(1 real change made)
variable Name was str63 now str65
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +-------------------+
     |       displayhrci |
     |-------------------|
  1. |                   |
  2. |                   |
  3. |  0.79 (0.46-1.37) |
  4. |  0.95 (0.41-2.18) |
  5. |  1.01 (0.61-1.67) |
     |-------------------|
  6. |                   |
  7. |                   |
  8. |  1.06 (0.22-5.24) |
  9. | 0.79 (0.06-10.58) |
 10. |  1.12 (0.25-5.06) |
     |-------------------|
 11. |                   |
 12. |                   |
 13. |  0.75 (0.44-1.30) |
 14. |  0.98 (0.44-2.20) |
 15. |  0.99 (0.60-1.64) |
     |-------------------|
 16. |                   |
 17. |                   |
 18. |  0.75 (0.43-1.31) |
 19. |  0.83 (0.34-1.99) |
 20. |  0.99 (0.59-1.66) |
     |-------------------|
 21. |                   |
 22. |                   |
 23. |  0.79 (0.46-1.37) |
 24. |  0.95 (0.41-2.18) |
 25. |  1.01 (0.61-1.67) |
     +-------------------+

     +-------------------------------------------------------------------+
  1. |                             grapho~r                              |
     |                                    1                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.007103  |  .6063585  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.672701                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  2. |                             grapho~r                              |
     |                                    2                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .9454895  |  .4091973  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.184644                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  3. |                             grapho~r                              |
     |                                    3                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7907654  |  .4560124  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.371256                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  4. |                             grapho~r                              |
     |                                    4                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                          Non-proportional hazards fitted (N=4519) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  5. |                             grapho~r                              |
     |                                    5                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  6. |                             grapho~r                              |
     |                                    6                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9907874  |  .5908962  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.661307                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  7. |                             grapho~r                              |
     |                                    7                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .8271364  |  .3429627  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.994837                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  8. |                             grapho~r                              |
     |                                    8                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7482159  |  .4277215  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.308859                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  9. |                             grapho~r                              |
     |                                    9                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     | Participants with at least 12 months registration at GP  (N=4280) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 10. |                             grapho~r                              |
     |                                   10                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 11. |                             grapho~r                              |
     |                                   11                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9885139  |  .5958372  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.639978                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 12. |                             grapho~r                              |
     |                                   12                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .9785179  |  .4352436  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.199911                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 13. |                             grapho~r                              |
     |                                   13                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7526561  |  .4359987  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.299296                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 14. |                             grapho~r                              |
     |                                   14                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |   Underlying timescale in the cox model revised to age   (N=4519) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 15. |                             grapho~r                              |
     |                                   15                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 16. |                             grapho~r                              |
     |                                   16                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.120091  |  .2480632  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             5.057599                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 17. |                             grapho~r                              |
     |                                   17                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |   .787323  |  .0585673  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             10.58402                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 18. |                             grapho~r                              |
     |                                   18                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  1.064282  |  .2162164  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             5.238718                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 19. |                             grapho~r                              |
     |                                   19                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |          Participants with complete BMI and smoking data  (N=647) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 20. |                             grapho~r                              |
     |                                   20                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 21. |                             grapho~r                              |
     |                                   21                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.008479  |  .6074077  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.674379                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 22. |                             grapho~r                              |
     |                                   22                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .9453182  |  .4093153  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.183223                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 23. |                             grapho~r                              |
     |                                   23                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7918168  |  .4569818  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.371989                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 24. |                             grapho~r                              |
     |                                   24                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                   Fully adjusted result  (N=4519) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 25. |                             grapho~r                              |
     |                                   25                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_W2.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_death_ageband_1_W2.svg written in SVG
>  format)

. log close
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_death.log
  log type:  text
 closed on:  20 Jul 2021, 14:39:38
-------------------------------------------------------------------------------
