-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_icu.log
  log type:  text
 opened on:  20 Jul 2021, 14:39:47

. 
. *set trace on
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach dataset in MAIN W2 {
  3. forvalues x=0/1 {
  4. file write tablecontents_sense ("dataset") ("age") ("`x'") _n
  5. foreach sense in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timesc
> ale time_int SUS_censor {
  6. file write tablecontents_sense _n ("sense=") ("`sense'") _n
  7. forvalues i=1/3 {
  8. local endwith "_tab"
  9. 
.         foreach modeltype of any fulladj {
 10. 
.                 local noestimatesflag 0 /*reset*/
 11. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 12. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 13.             cap estimates use  ./output/an_sense_`outcome'_`sense'_ageband
> _`x'`dataset'
 14.                                 if _rc!=0 local noestimatesflag 1
 15.                                 }
 16. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "!="AAmain" {
 17.                         cap lincom `i'.`variable', eform
 18.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 19.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 20.                         }
 21. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 22.                         if "`modeltype'"=="fulladj" & "`sense'"!="AAmain" 
>  {
 23.                                 local hr = r(estimate)
 24.                                 local lb = r(lb)
 25.                                 local ub = r(ub)
 26.                                 local N=e(N_sub)
 27.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 28.                                 }
 29.                 }
 30.                 } /*min adj, full adj*/
 31. 
. } /*variable levels*/
 32. 
. forvalues i=1/3 {
 33. local endwith "_tab"
 34. 
.         foreach modeltype of any fulladj {
 35. 
.                 local noestimatesflag 0 /*reset*/
 36. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 37. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 /*if "`modeltype'"=="minadj" & "`variable'"!="agegroup" & "`v
> ariable'"!="male" {
>                         cap estimates use ./output/an_univariable_cox_models_
> `outcome'_AGESEX_`variable'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }
>                 if "`modeltype'"=="demogadj" {
>                         cap estimates use ./output/an_multivariate_cox_models
> _`outcome'_`variable'_DEMOGADJ_`sense'_ageband_`x'
>                         if _rc!=0 local noestimatesflag 1
>                         }*/
.                 if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 38.                 cap estimates use  ./output/an_multivariate_cox_models_`ou
> tcome'_`variable'_MAINFULLYADJMODEL_ageband_`x'`dataset'
 39.                                 if _rc!=0 local noestimatesflag 1
 40.                                 }
 41. 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
. 
.                 if `noestimatesflag'==0 & "`modeltype'"=="fulladj" & "`sense'
> "=="AAmain" {
 42.                         cap lincom `i'.`variable', eform
 43.                         if _rc==0 file write tablecontents_sense ("`variab
> le'") _tab ("`i'") _tab %4.2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(
> ub)) _tab (e(N_sub))  `endwith'
 44.                                 else file write tablecontents_sense %4.2f 
> ("ERR IN MODEL") `endwith'
 45.                         }
 46. 
.                 *3) Save the estimates for plotting
.                         if "`modeltype'"=="fulladj" & "`sense'"=="AAmain"  {
 47.                                 local hr = r(estimate)
 48.                                 local lb = r(lb)
 49.                                 local ub = r(ub)
 50.                                 local N=e(N_sub)
 51.                                 post HRestimates_sense ("`dataset'") ("`x'
> ") ("`outcome'") ("`variable'") ("`sense'") (`i') (`hr') (`lb') (`ub') (`N')
 52.                                 }
 53. 
.                 } /*min adj, full adj*/
 54. 
. } /*variable levels*/
 55. } /*age levels*/
 56. } /*sense levels*/
 57. } /*datsets*/
 58. 
. end

. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. 
. cap file close tablecontents_sense

. file open tablecontents_sense using ./output/12_an_sense_HRtable_`outcome'_SE
> NSE_ANALYSES.txt, t w replace
(note: file ./output/12_an_sense_HRtable_covid_icu_SENSE_ANALYSES.txt not found
> )

. 
. tempfile HRestimates_sense

. cap postutil clear

. postfile HRestimates_sense str10 dataset str10 x str10 outcome str27 variable
>  str27 sense i hr lci uci N using `HRestimates_sense'

. 
. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(1) max(3) outcome(`outcome')

. file write tablecontents_sense _n

. 
. file close tablecontents_sense

. 
. postclose HRestimates_sense

. 
. *use `HRestimates_sense', clear
. *save HRestimates_sense, replace
. *stop
. 
. foreach dataset in MAIN W2 {
  2. forvalues x=0/1 {
  3. 
. use `HRestimates_sense', clear
  4. keep if x=="`x'"
  5.  
. keep if dataset=="`dataset'"
  6. drop outcome variable
  7. sort sense i
  8. gen varorder = 1
  9. 
. 
. sort varorder sense i
 10. drop varorder
 11. 
. gen obsorder=_n
 12. expand 2 if sense!=sense[_n-1], gen(expanded)
 13. gsort obsorder -expanded
 14. 
. for var hr lci uci: replace X = 1 if expanded==1
 15. 
. drop obsorder
 16. gen obsorder=_n
 17. 
. 
. expand 2 if expanded==1, gen(expanded2)
 18. drop obsorder
 19. gsort sense i -expanded -expanded2
 20. gen obsorder=_n
 21. 
. for var hr lci uci : replace X=. if expanded==1 & expanded2==1
 22. 
. gen varx = 0.03
 23. gen levelx = 0.033
 24. gen intx=0.08
 25. gen lowerlimit = 0.15
 26. gen disx=2.5
 27. 
. *Levels
. gen leveldesc = ""
 28. replace leveldesc = "Only children aged 0-11 years" if i==1 & hr!=1 & hr!=
> .
 29. replace leveldesc = "Only children aged ≥12 years" if i==2
 30. replace leveldesc = "Children aged 0-11 years and ≥12 years" if i==3
 31. 
. gen Name = sense if hr==1
 32. 
. foreach type in AAmain CCeth_bmi_smok plus_eth_12mo age_underlying_timescale 
> time_int  {
 33. sum N if sense=="`type'"
 34. local number_`type'=r(mean)
 35. di `number_`type''
 36. }
 37. 
. replace Name = "Fully adjusted result  (N=`number_AAmain')" if Name=="AAmain"
 38. replace Name = "Participants with complete BMI and smoking data  (N=`numbe
> r_CCeth_bmi_smok')" if Name=="CCeth_bmi_smok"
 39. replace Name = "Underlying timescale in the cox model revised to age   (N=
> `number_age_underlying_timescale')" if Name=="age_underlying_timescale"
 40. replace Name = "Participants with at least 12 months registration at GP  (
> N=`number_plus_eth_12mo')" if Name=="plus_eth_12mo"
 41. replace Name = "Non-proportional hazards fitted (N=`number_time_int')" if 
> Name=="time_int"
 42. replace Name = "Censor study at 1st November (N=`number_SUS_censor')" if N
> ame=="SUS_censor"
 43. 
. for var hr lci uci: replace X = . if X==1
 44. 
. 
. gen displayhrci = string(hr, "%3.2f") + " (" + string(lci, "%3.2f") + "-" + s
> tring(uci, "%3.2f") + ")"
 45. replace displayhrci="" if hr==.
 46. list display
 47. 
. drop obsorder
 48. 
. gen obsorder=_n
 49. gsort -obsorder
 50. gen graphorder = _n
 51. sort graphorder
 52. list graphorder Name leveldesc hr  lci uci
 53. 
. gen hrtitle="Hazard Ratio (95% CI)" if graphorder == 28
 54. 
. gen bf_hrtitle = "{bf:" + hrtitle + "}"
 55. gen bf_Name = "{bf:" + Name + "}"
 56. 
. scatter graphorder hr, mcol(black)      msize(small)            ///          
>                                                                    ///
>         || rcap lci uci graphorder, hor mcol(black)     lcol(black)          
>            ///
>         || scatter graphorder varx , m(i) mlab(bf_Name) mlabsize(vsmall) mlab
> col(black)         ///
>         || scatter graphorder levelx, m(i) mlab(leveldesc) mlabsize(vsmall) m
> labcol(black)      ///
>         || scatter graphorder disx, m(i) mlab(displayhrci) mlabsize(vsmall) m
> labcol(black) ///
>         || scatter graphorder disx, m(i) mlab(bf_hrtitle) mlabsize(vsmall) ml
> abcol(black) ///
>                 xline(1,lp(solid))                                           
>                                                                            //
> /
>                 xscale(log range(0.1 6)) xlab(0.5 1 2, labsize(vsmall)) xtitl
> e("")  ///
>                 ylab(none) ytitle("")           yscale( lcolor(white))       
>                            ///
>                 graphregion(color(white))  legend(off)  ysize(4) ///
>                 text(-2 0.2 "Lower risk in those living with children", place
> (e) size(vsmall)) ///
>                 text(-2 1.5 "Higher risk in those living with children", plac
> e(e) size(vsmall))
 57. 
. graph export ./output/12_an_HRforest_SENSE_`outcome'_ageband_`x'_`dataset'.sv
> g, as(svg) replace
 58. }
 59. }
(27 observations deleted)
(12 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        2319           0       2319       2319
2319

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       15442           0      15442      15442
15442

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16252           0      16252      16252
16252
variable Name was str24 now str32
(1 real change made)
variable Name was str32 now str57
(1 real change made)
variable Name was str57 now str64
(1 real change made)
variable Name was str64 now str66
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.01 (0.83-1.23) |
  4. | 1.06 (0.81-1.39) |
  5. | 0.97 (0.81-1.16) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 1.02 (0.61-1.72) |
  9. | 1.46 (0.79-2.69) |
 10. | 1.04 (0.66-1.65) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.02 (0.84-1.24) |
 14. | 1.10 (0.85-1.44) |
 15. | 0.98 (0.82-1.17) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.00 (0.82-1.22) |
 19. | 1.06 (0.80-1.40) |
 20. | 0.99 (0.83-1.18) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 1.01 (0.83-1.23) |
 24. | 1.06 (0.81-1.39) |
 25. | 0.97 (0.81-1.16) |
     +------------------+

     +--------------------------------------------------------------------+
  1. |                              grapho~r                              |
     |                                     1                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .9699547  |  .8091221  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.162757                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |                              grapho~r                              |
     |                                     2                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |   1.06371  |  .8144792  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.389207                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |                              grapho~r                              |
     |                                     3                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.006565  |  .8267499  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                               1.22549                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |                              grapho~r                              |
     |                                     4                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                          Non-proportional hazards fitted (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |                              grapho~r                              |
     |                                     5                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |                              grapho~r                              |
     |                                     6                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .9864684  |   .825147  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.179329                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |                              grapho~r                              |
     |                                     7                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.057009  |  .7971087  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                               1.40165                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |                              grapho~r                              |
     |                                     8                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.001449  |  .8236067  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.217692                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |                              grapho~r                              |
     |                                     9                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     | Participants with at least 12 months registration at GP  (N=15442) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |                              grapho~r                              |
     |                                    10                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 11. |                              grapho~r                              |
     |                                    11                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |   .981178  |  .8197957  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                               1.17433                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 12. |                              grapho~r                              |
     |                                    12                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |   1.10339  |  .8484039  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.435012                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 13. |                              grapho~r                              |
     |                                    13                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.018637  |  .8370327  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.239642                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 14. |                              grapho~r                              |
     |                                    14                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |   Underlying timescale in the cox model revised to age   (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 15. |                              grapho~r                              |
     |                                    15                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 16. |                              grapho~r                              |
     |                                    16                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.044719  |  .6602088  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.653171                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 17. |                              grapho~r                              |
     |                                    17                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.462446  |  .7947077  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              2.691238                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 18. |                              grapho~r                              |
     |                                    18                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.021523  |  .6052254  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.724167                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 19. |                              grapho~r                              |
     |                                    19                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |          Participants with complete BMI and smoking data  (N=2319) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 20. |                              grapho~r                              |
     |                                    20                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 21. |                              grapho~r                              |
     |                                    21                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .9703245  |  .8094981  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.163103                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 22. |                              grapho~r                              |
     |                                    22                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.062427  |  .8136343  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.387295                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 23. |                              grapho~r                              |
     |                                    23                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.007555  |  .8276051  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.226631                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 24. |                              grapho~r                              |
     |                                    24                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                   Fully adjusted result  (N=16252) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 25. |                              grapho~r                              |
     |                                    25                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_MAIN.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_MAIN.svg written in SVG
>  format)
(27 observations deleted)
(12 observations deleted)
(5 observations created)

->  replace hr = 1 if expanded==1
(5 real changes made)

->  replace lci = 1 if expanded==1
(5 real changes made)

->  replace uci = 1 if expanded==1
(5 real changes made)
(5 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(5 real changes made, 5 to missing)
(25 missing values generated)
variable leveldesc was str1 now str29
(5 real changes made)
variable leveldesc was str29 now str30
(5 real changes made)
variable leveldesc was str30 now str40
(5 real changes made)
(20 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5         623           0        623        623
623

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4212           0       4212       4212
4212

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4436           0       4436       4436
4436
variable Name was str24 now str31
(1 real change made)
variable Name was str31 now str56
(1 real change made)
variable Name was str56 now str63
(1 real change made)
variable Name was str63 now str65
(1 real change made)
(1 real change made)
(0 real changes made)

->  replace hr = . if hr==1
(5 real changes made, 5 to missing)

->  replace lci = . if lci==1
(5 real changes made, 5 to missing)

->  replace uci = . if uci==1
(5 real changes made, 5 to missing)
(10 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 0.79 (0.56-1.12) |
  4. | 0.87 (0.53-1.43) |
  5. | 0.86 (0.63-1.16) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.71 (0.19-2.66) |
  9. | 0.00 (0.00-0.00) |
 10. | 1.31 (0.40-4.29) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 0.79 (0.56-1.13) |
 14. | 0.79 (0.48-1.31) |
 15. | 0.84 (0.62-1.15) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 0.82 (0.57-1.19) |
 19. | 0.91 (0.54-1.53) |
 20. | 0.90 (0.65-1.24) |
     |------------------|
 21. |                  |
 22. |                  |
 23. | 0.79 (0.56-1.12) |
 24. | 0.88 (0.54-1.43) |
 25. | 0.86 (0.63-1.16) |
     +------------------+

     +-------------------------------------------------------------------+
  1. |                             grapho~r                              |
     |                                    1                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .8573929  |  .6316107  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.163886                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  2. |                             grapho~r                              |
     |                                    2                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .8770683  |  .5361988  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.434634                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  3. |                             grapho~r                              |
     |                                    3                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7888036  |  .5564847  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              1.11811                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  4. |                             grapho~r                              |
     |                                    4                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                          Non-proportional hazards fitted (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  5. |                             grapho~r                              |
     |                                    5                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  6. |                             grapho~r                              |
     |                                    6                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9000556  |  .6540835  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.238527                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  7. |                             grapho~r                              |
     |                                    7                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .9093919  |  .5408512  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              1.52906                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  8. |                             grapho~r                              |
     |                                    8                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .8242071  |  .5706002  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.190531                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  9. |                             grapho~r                              |
     |                                    9                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     | Participants with at least 12 months registration at GP  (N=4212) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 10. |                             grapho~r                              |
     |                                   10                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 11. |                             grapho~r                              |
     |                                   11                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .8439301  |  .6203794  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.148036                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 12. |                             grapho~r                              |
     |                                   12                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .7922422  |  .4773851  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.314762                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 13. |                             grapho~r                              |
     |                                   13                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7944368  |  .5580767  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.130902                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 14. |                             grapho~r                              |
     |                                   14                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |   Underlying timescale in the cox model revised to age   (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 15. |                             grapho~r                              |
     |                                   15                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 16. |                             grapho~r                              |
     |                                   16                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.305011  |  .3973692  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              4.28582                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 17. |                             grapho~r                              |
     |                                   17                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.46e-15  |  2.09e-16  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.02e-14                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 18. |                             grapho~r                              |
     |                                   18                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7086325  |  .1886513  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.661843                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 19. |                             grapho~r                              |
     |                                   19                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |          Participants with complete BMI and smoking data  (N=623) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 20. |                             grapho~r                              |
     |                                   20                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 21. |                             grapho~r                              |
     |                                   21                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .8562189  |  .6309417  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.161931                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 22. |                             grapho~r                              |
     |                                   22                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  .8741143  |  .5348552  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.428566                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 23. |                             grapho~r                              |
     |                                   23                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .7885416  |  .5560936  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.118153                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 24. |                             grapho~r                              |
     |                                   24                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                   Fully adjusted result  (N=4436) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 25. |                             grapho~r                              |
     |                                   25                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+
(25 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_MAIN.svg not foun
> d)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_MAIN.svg written in SVG
>  format)
(27 observations deleted)
(15 observations deleted)
(4 observations created)

->  replace hr = 1 if expanded==1
(4 real changes made)

->  replace lci = 1 if expanded==1
(4 real changes made)

->  replace uci = 1 if expanded==1
(4 real changes made)
(4 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)
(20 missing values generated)
variable leveldesc was str1 now str29
(4 real changes made)
variable leveldesc was str29 now str30
(4 real changes made)
variable leveldesc was str30 now str40
(4 real changes made)
(16 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        2227           0       2227       2227
2227

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       15261           0      15261      15261
15261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5       16050           0      16050      16050
16050

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          0
.
variable Name was str24 now str32
(1 real change made)
variable Name was str32 now str57
(1 real change made)
variable Name was str57 now str64
(1 real change made)
variable Name was str64 now str66
(1 real change made)
(0 real changes made)
(0 real changes made)

->  replace hr = . if hr==1
(4 real changes made, 4 to missing)

->  replace lci = . if lci==1
(4 real changes made, 4 to missing)

->  replace uci = . if uci==1
(4 real changes made, 4 to missing)
(8 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 1.05 (0.85-1.29) |
  4. | 1.04 (0.77-1.40) |
  5. | 1.00 (0.82-1.22) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.50 (0.24-1.03) |
  9. | 0.93 (0.40-2.15) |
 10. | 0.54 (0.27-1.08) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 1.06 (0.86-1.30) |
 14. | 1.02 (0.75-1.38) |
 15. | 1.00 (0.82-1.22) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.00 (0.81-1.25) |
 19. | 1.02 (0.75-1.40) |
 20. | 0.96 (0.78-1.18) |
     +------------------+

     +--------------------------------------------------------------------+
  1. |                              grapho~r                              |
     |                                     1                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .9559587  |   .777596  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.175234                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |                              grapho~r                              |
     |                                     2                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.022025  |  .7476705  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.397052                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |                              grapho~r                              |
     |                                     3                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.003566  |  .8063014  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.249092                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |                              grapho~r                              |
     |                                     4                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     | Participants with at least 12 months registration at GP  (N=15261) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |                              grapho~r                              |
     |                                     5                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |                              grapho~r                              |
     |                                     6                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  1.002188  |  .8232066  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.220083                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |                              grapho~r                              |
     |                                     7                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.020383  |  .7544376  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.380077                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |                              grapho~r                              |
     |                                     8                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.057624  |  .8589724  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.302217                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |                              grapho~r                              |
     |                                     9                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |   Underlying timescale in the cox model revised to age   (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |                              grapho~r                              |
     |                                    10                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 11. |                              grapho~r                              |
     |                                    11                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .5427483  |  .2723856  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.081465                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 12. |                              grapho~r                              |
     |                                    12                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |   .931852  |  .4031377  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              2.153974                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 13. |                              grapho~r                              |
     |                                    13                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  .4980111  |  .2411122  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.028629                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 14. |                              grapho~r                              |
     |                                    14                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |          Participants with complete BMI and smoking data  (N=2227) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 15. |                              grapho~r                              |
     |                                    15                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 16. |                              grapho~r                              |
     |                                    16                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |  Children aged 0-11 years and ≥12 years  |  .9978643  |  .8192148  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.215473                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 17. |                              grapho~r                              |
     |                                    17                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |            Only children aged ≥12 years  |  1.040057  |  .7746184  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.396454                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 18. |                              grapho~r                              |
     |                                    18                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |           Only children aged 0-11 years  |  1.048266  |  .8497664  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                              1.293133                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 19. |                              grapho~r                              |
     |                                    19                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                   Fully adjusted result  (N=16050) |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 20. |                              grapho~r                              |
     |                                    20                              |
     |--------------------------------------------------------------------|
     |                                                               Name |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                               leveldesc  |        hr  |       lci  |
     |                                          |         .  |         .  |
     |--------------------------------------------------------------------|
     |                                   uci                              |
     |                                     .                              |
     +--------------------------------------------------------------------+
(20 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_W2.svg not found)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_0_W2.svg written in SVG f
> ormat)
(27 observations deleted)
(15 observations deleted)
(4 observations created)

->  replace hr = 1 if expanded==1
(4 real changes made)

->  replace lci = 1 if expanded==1
(4 real changes made)

->  replace uci = 1 if expanded==1
(4 real changes made)
(4 observations created)

->  replace hr=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1 & expanded2==1
(4 real changes made, 4 to missing)
(20 missing values generated)
variable leveldesc was str1 now str29
(4 real changes made)
variable leveldesc was str29 now str30
(4 real changes made)
variable leveldesc was str30 now str40
(4 real changes made)
(16 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4519           0       4519       4519
4519

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5         647           0        647        647
647

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4280           0       4280       4280
4280

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          5        4519           0       4519       4519
4519

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           N |          0
.
variable Name was str24 now str31
(1 real change made)
variable Name was str31 now str56
(1 real change made)
variable Name was str56 now str63
(1 real change made)
variable Name was str63 now str65
(1 real change made)
(0 real changes made)
(0 real changes made)

->  replace hr = . if hr==1
(4 real changes made, 4 to missing)

->  replace lci = . if lci==1
(4 real changes made, 4 to missing)

->  replace uci = . if uci==1
(4 real changes made, 4 to missing)
(8 real changes made)

     +------------------+
     |      displayhrci |
     |------------------|
  1. |                  |
  2. |                  |
  3. | 0.96 (0.64-1.46) |
  4. | 1.25 (0.68-2.29) |
  5. | 0.97 (0.66-1.44) |
     |------------------|
  6. |                  |
  7. |                  |
  8. | 0.97 (0.37-2.56) |
  9. | 0.40 (0.10-1.63) |
 10. | 0.67 (0.27-1.64) |
     |------------------|
 11. |                  |
 12. |                  |
 13. | 0.88 (0.58-1.34) |
 14. | 1.14 (0.61-2.11) |
 15. | 0.88 (0.60-1.31) |
     |------------------|
 16. |                  |
 17. |                  |
 18. | 1.02 (0.66-1.57) |
 19. | 1.33 (0.71-2.48) |
 20. | 1.02 (0.67-1.54) |
     +------------------+

     +-------------------------------------------------------------------+
  1. |                             grapho~r                              |
     |                                    1                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  1.017668  |  .6725754  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.539825                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  2. |                             grapho~r                              |
     |                                    2                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.328971  |  .7112832  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.483067                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  3. |                             grapho~r                              |
     |                                    3                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |   1.01715  |  .6575824  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.573331                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  4. |                             grapho~r                              |
     |                                    4                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     | Participants with at least 12 months registration at GP  (N=4280) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  5. |                             grapho~r                              |
     |                                    5                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  6. |                             grapho~r                              |
     |                                    6                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .8836076  |  .5956706  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.310728                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  7. |                             grapho~r                              |
     |                                    7                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.139094  |  .6139445  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.113441                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  8. |                             grapho~r                              |
     |                                    8                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .8819789  |  .5810516  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.338757                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  9. |                             grapho~r                              |
     |                                    9                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |   Underlying timescale in the cox model revised to age   (N=4519) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 10. |                             grapho~r                              |
     |                                   10                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 11. |                             grapho~r                              |
     |                                   11                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .6689468  |  .2726349  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.641352                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 12. |                             grapho~r                              |
     |                                   12                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |   .400636  |   .098472  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.629998                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 13. |                             grapho~r                              |
     |                                   13                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .9703999  |   .368525  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.555257                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 14. |                             grapho~r                              |
     |                                   14                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |          Participants with complete BMI and smoking data  (N=647) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 15. |                             grapho~r                              |
     |                                   15                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 16. |                             grapho~r                              |
     |                                   16                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     | Children aged 0-11 years and ≥12 years  |  .9742428  |  .6589209  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                              1.44046                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 17. |                             grapho~r                              |
     |                                   17                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |           Only children aged ≥12 years  |  1.246135  |  .6780952  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             2.290021                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 18. |                             grapho~r                              |
     |                                   18                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |          Only children aged 0-11 years  |  .9638263  |  .6361525  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                             1.460281                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 19. |                             grapho~r                              |
     |                                   19                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                   Fully adjusted result  (N=4519) |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 20. |                             grapho~r                              |
     |                                   20                              |
     |-------------------------------------------------------------------|
     |                                                              Name |
     |                                                                   |
     |-------------------------------------------------------------------|
     |                              leveldesc  |        hr  |       lci  |
     |                                         |         .  |         .  |
     |-------------------------------------------------------------------|
     |                                  uci                              |
     |                                    .                              |
     +-------------------------------------------------------------------+
(20 missing values generated)
(note: file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_W2.svg not found)
(file ./output/12_an_HRforest_SENSE_covid_icu_ageband_1_W2.svg written in SVG f
> ormat)

. log close
      name:  <unnamed>
       log:  /workspace/12_an_tablecontent_HRtable_SENSE_covid_icu.log
  log type:  text
 closed on:  20 Jul 2021, 14:39:50
-------------------------------------------------------------------------------
