-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/02_an_data_checks.log
  log type:  text
 opened on:  28 Jan 2021, 14:21:59

. 
. * Open Stata dataset
. use $tempdir/`inputfile', clear

. 
. *run ssc install if not on local machine - server needs datacheck.ado file
. *ssc install datacheck 
. 
. *Duplicate patient check
. datacheck _n==1, by(patient_id) nol

. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

. 
. 
. * EXCLUDE 1:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUDE 2:  HH with more than 10 people
. datacheck inlist(household_size, 1, 2, 3, 4, 5,6, 7, 8, 9, 10), nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. *HH
. datacheck kids_cat4<., nol

. datacheck inlist(kids_cat4, 0,1, 2), nol

 (699575 contradictions)

. 
. datacheck number_kids<., nol

 (10055798 contradictions)

. datacheck inlist(number_kids, 0,1,2,3,4,5,6,7,8,9), nol

 (10055798 contradictions)

. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6,7), nol

. datacheck inlist(age66, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. 
. * Check date ranges for all comorbidities 
. 
. foreach var of varlist  chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         perm_immunodef  ///
>                                         temp_immunodef  ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         hypertension                         
>    ///
>                                         {
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_r~te |    531,382   08jun2009    6478.911  15dec1899  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_c~te |    846,196   05apr2007    6687.954  15jan1840  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_l~te |     80,799   05feb2010    6456.328  15dec1840  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_neur~e |    120,204   01sep2002    8059.988  15jan1860  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dem~e |    280,817   24dec2010    5474.375  15dec1899  15jul2096

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_sle_pso~e |    630,120   13aug2002    7453.294  15jan1840  15mar3000

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
perm_immun~e |     35,208   07feb2009    6220.633  15jan1900  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
temp_immun~e |      3,439   29aug2019    101.7622  15feb2019  15jan2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_tran~e |      3,082   07mar2008    4925.341  15jan1900  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
asplenia_d~e |     18,096   25mar1993    9160.447  15dec1899  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |  2,579,321   24dec2004    7398.345  15jan1800  15nov2056

. 
. foreach comorb in $varlist { 
  2.         local comorb: subinstr local comorb "i." ""
  3.         safetab `comorb', m
  4. }

. 
. *summarise end dates for each outcome
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. sum `outcome', format
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~b |     70,453   16may2020     42.9461  02feb2020  31aug2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_non_c~h |     56,520   14may2020    61.14218  02feb2020  31aug2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~h |      7,726   26apr2020    27.59764  05mar2020  31aug2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |      2,333   16apr2020    28.81287  01mar2020  31aug2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~n |     14,934   18apr2020     29.9932  04feb2020  31aug2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~1 |      7,027   25apr2020    26.30235  05mar2020  31aug2020

. 
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. gen `outcome'_month=mofd(`outcome') 
  3.  lab define `outcome'_month 721 feb 722 mar 723 apr 724 may 725 june 726 j
> ul 727 aug 728 sept 729 oct
  4. lab val `outcome'_month `outcome'_month
  5. tab `outcome'_month
  6. drop `outcome'_month
  7. }
(11,948,463 missing values generated)

date_covid_ |
tpp_prob_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
        feb |         57        0.08        0.08
        mar |      6,065        8.61        8.69
        apr |     26,681       37.87       46.56
        may |     17,540       24.90       71.46
       june |      8,101       11.50       82.95
        jul |      5,470        7.76       90.72
        aug |      6,539        9.28      100.00
------------+-----------------------------------
      Total |     70,453      100.00
(11,962,396 missing values generated)

date_non_co |
vid_death_m |
       onth |      Freq.     Percent        Cum.
------------+-----------------------------------
        feb |      7,596       13.44       13.44
        mar |      9,236       16.34       29.78
        apr |      8,889       15.73       45.51
        may |      7,779       13.76       59.27
       june |      7,366       13.03       72.30
        jul |      7,745       13.70       86.01
        aug |      7,909       13.99      100.00
------------+-----------------------------------
      Total |     56,520      100.00
(12,011,190 missing values generated)

date_covid_ |
death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
        mar |        747        9.67        9.67
        apr |      4,463       57.77       67.43
        may |      1,668       21.59       89.02
       june |        565        7.31       96.34
        jul |        201        2.60       98.94
        aug |         82        1.06      100.00
------------+-----------------------------------
      Total |      7,726      100.00
(12,016,583 missing values generated)

date_covid_ |
  icu_month |      Freq.     Percent        Cum.
------------+-----------------------------------
        mar |        690       29.58       29.58
        apr |      1,186       50.84       80.41
        may |        267       11.44       91.86
       june |        118        5.06       96.91
        jul |         39        1.67       98.59
        aug |         33        1.41      100.00
------------+-----------------------------------
      Total |      2,333      100.00
(12,003,982 missing values generated)

date_covida |
dmission_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
        feb |         42        0.28        0.28
        mar |      3,736       25.02       25.30
        apr |      7,695       51.53       76.82
        may |      2,092       14.01       90.83
       june |        806        5.40       96.23
        jul |        326        2.18       98.41
        aug |        237        1.59      100.00
------------+-----------------------------------
      Total |     14,934      100.00
(12,011,889 missing values generated)

died_date_o |
nscovid_par |
   t1_month |      Freq.     Percent        Cum.
------------+-----------------------------------
        mar |        701        9.98        9.98
        apr |      4,201       59.78       69.76
        may |      1,464       20.83       90.59
       june |        445        6.33       96.93
        jul |        156        2.22       99.15
        aug |         60        0.85      100.00
------------+-----------------------------------
      Total |      7,027      100.00

. 
. *Outcome dates
. di d(1feb2020)
21946

. * 21946
. di d(01apr2020)
22006

. * 22006
. di d(01june2020)
22067

. * 22067
. di d(01aug2020)
22128

. * 22128
. di d(01oct2020)
22189

. * 22189
. di d(01dec2020)
22250

. * 22250
. di d(18dec2020)
22267

. * 22267
. 
. foreach outcome of any covid_primary_care_codes positive_SGSS non_covid_death
>   covid_tpp_prob covidadmission covid_icu covid_death    {
  2. summ  `outcome', format d 
  3. summ patient_id if `outcome'==1 & date_`outcome'<=22267
  4. local total_`outcome'=`r(N)'
  5. hist date_`outcome' if date_`outcome'<=22267, saving(`outcome', replace) /
> //
> xlabel(21946 22006 22067 22128 22189 22250 ,labsize(tiny))  xtitle(, size(vsm
> all)) ///
> graphregion(color(white))  legend(off) freq  ///
> yscale(range(0 3000)) ylab(0 (10000) 30000, labsize(vsmall)) ytitle("Number",
>  size(vsmall))  ///
> title("N=`total_`outcome''", size(vsmall)) 
  6. }

         Indicator positive primary care code COVID
                          infection
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          12,018,916
25%            0              0       Sum of Wgt.    12018916

50%            0                      Mean           .0040235
                        Largest       Std. Dev.      .0633033
75%            0              1
90%            0              1       Variance       .0040073
95%            0              1       Skewness       15.66986
99%            0              1       Kurtosis       246.5444

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     48,358    2.02e+07    1.39e+07      11280   5.45e+07
(bin=46, start=21947, width=4.5869565)
(note: file covid_primary_care_codes.gph not found)
(file covid_primary_care_codes.gph saved)

                Indicator positive covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          12,018,916
25%            0              0       Sum of Wgt.    12018916

50%            0                      Mean            .004686
                        Largest       Std. Dev.       .068294
75%            0              1
90%            0              1       Variance       .0046641
95%            0              1       Skewness       14.50534
99%            0              1       Kurtosis        211.405

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     56,321    2.07e+07    1.40e+07      10548   5.39e+07
(bin=47, start=21950, width=4.4255319)
(note: file positive_SGSS.gph not found)
(file positive_SGSS.gph saved)

     Failure/censoring indicator for outcome: non-covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          12,018,916
25%            0              0       Sum of Wgt.    12018916

50%            0                      Mean           .0047026
                        Largest       Std. Dev.       .068414
75%            0              1
90%            0              1       Variance       .0046805
95%            0              1       Skewness       14.47942
99%            0              1       Kurtosis       210.6536

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     56,520    2.00e+07    1.28e+07      11658   5.39e+07
(bin=47, start=21947, width=4.4893617)
(note: file non_covid_death.gph not found)
(file non_covid_death.gph saved)

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          12,018,916
25%            0              0       Sum of Wgt.    12018916

50%            0                      Mean           .0058618
                        Largest       Std. Dev.      .0763379
75%            0              1
90%            0              1       Variance       .0058275
95%            0              1       Skewness       12.94607
99%            0              1       Kurtosis       168.6007

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     70,453    2.05e+07    1.40e+07      10548   5.45e+07
(bin=48, start=21947, width=4.3958333)
(note: file covid_tpp_prob.gph not found)
(file covid_tpp_prob.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          12,018,916
25%            0              0       Sum of Wgt.    12018916

50%            0                      Mean           .0012425
                        Largest       Std. Dev.      .0352278
75%            0              1
90%            0              1       Variance        .001241
95%            0              1       Skewness       28.31613
99%            0              1       Kurtosis       802.8034

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     14,934    2.07e+07    1.32e+07      11807   5.35e+07
(bin=41, start=21949, width=5.097561)
(note: file covidadmission.gph not found)
(file covidadmission.gph saved)

     Failure/censoring indicator for outcome: covid icu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          12,018,916
25%            0              0       Sum of Wgt.    12018916

50%            0                      Mean           .0001941
                        Largest       Std. Dev.       .013931
75%            0              1
90%            0              1       Variance       .0001941
95%            0              1       Skewness       71.75444
99%            0              1       Kurtosis         5149.7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      2,333    2.22e+07    1.39e+07      18211   5.35e+07
(bin=33, start=21975, width=5.5454545)
(note: file covid_icu.gph not found)
(file covid_icu.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          12,018,916
25%            0              0       Sum of Wgt.    12018916

50%            0                      Mean           .0006428
                        Largest       Std. Dev.      .0253457
75%            0              1
90%            0              1       Variance       .0006424
95%            0              1       Skewness       39.40363
99%            0              1       Kurtosis       1553.646

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      7,726    1.95e+07    1.28e+07      12098   5.39e+07
(bin=38, start=21979, width=4.7105263)
(note: file covid_death.gph not found)
(file covid_death.gph saved)

. 
. * Combine histograms
. graph combine covid_tpp_prob.gph covidadmission.gph covid_icu.gph covid_death
> .gph non_covid_death.gph  , graphregion(color(white))

. graph export "output/01_histogram_outcomes_`dataset'.svg", as(svg) replace 
(note: file output/01_histogram_outcomes_MAIN.svg not found)
(file output/01_histogram_outcomes_MAIN.svg written in SVG format)

. 
. * Combine infection histograms
. graph combine covid_primary_care_codes.gph positive_SGSS.gph, graphregion(col
> or(white))

. graph export "output/01_histogram_infection_outcomes_`dataset'.svg", as(svg) 
> replace 
(note: file output/01_histogram_infection_outcomes_MAIN.svg not found)
(file output/01_histogram_infection_outcomes_MAIN.svg written in SVG format)

. 
. *censor dates
. summ dereg_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dereg_date | 12,018,916   08apr9749    508390.5  15feb2020  15dec9999

. summ has_12_m

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_12_m_f~p | 12,018,916    .9316544     .252338          0          1

. 
. 
. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. *HH variables
. safetab kids_cat4 tot_adults_hh
0

 Exposure (v2) |    Total number adults in hh
   with 4-cats |         1          2          3 |     Total
---------------+---------------------------------+----------
          none | 2,688,003  3,426,929  2,343,482 | 8,458,414 
only <12 years |   304,683  1,095,407    563,028 | 1,963,118 
    only 12-18 |   102,618    359,191    436,000 |   897,809 
         mixed |    78,785    353,824    266,966 |   699,575 
---------------+---------------------------------+----------
         Total | 3,174,089  5,235,351  3,609,476 |12,018,916 

. safetab number_kids tot_adults_hh
0

**TABLE OF number_kids tot_adults_hh REDACTED DUE TO SMALL N**


. safetab household_size tot_adults_hh
0

    Number |
 people in |    Total number adults in hh
 household |         1          2          3 |     Total
-----------+---------------------------------+----------
         1 | 2,642,944          0          0 | 2,642,944 
         2 |   278,254  3,375,142          0 | 3,653,396 
         3 |   176,524    744,778  1,309,748 | 2,231,050 
         4 |    54,846    796,341    989,237 | 1,840,424 
         5 |    15,546    234,044    590,736 |   840,326 
         6 |     4,142     61,981    341,865 |   407,988 
         7 |     1,279     16,503    193,908 |   211,690 
         8 |       396      4,932    114,477 |   119,805 
         9 |       158      1,630     69,505 |    71,293 
-----------+---------------------------------+----------
     Total | 3,174,089  5,235,351  3,609,476 |12,018,916 

. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    228,913    17.43594    .8244755         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |  3,687,174    22.36963    1.709148       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |  3,538,949    27.26507    1.413011         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |  1,766,095    32.07906    1.416595         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    678,572    37.04958    1.406481         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    342,949     43.3963    2.642791         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |   228,913          0          0          0 |   228,913 
  Normal (18.5-24.9) | 3,687,174          0          0          0 | 3,687,174 
Overweight (25-29.9) | 3,538,949          0          0          0 | 3,538,949 
   Obese I (30-34.9) |         0  1,766,095          0          0 | 1,766,095 
  Obese II (35-39.9) |         0          0    678,572          0 |   678,572 
     Obese III (40+) |         0          0          0    342,949 |   342,949 
        Unknown (.u) | 1,776,264          0          0          0 | 1,776,264 
---------------------+--------------------------------------------+----------
               Total | 9,231,300  1,766,095    678,572    342,949 |12,018,916 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  1,981,860    24.17065    3.380669         18         29

-------------------------------------------------------------------------------
-> agegroup = 30-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  2,230,655    34.47481    2.858273         30         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  2,022,059    44.52262    2.921292         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  2,062,371    54.42549    2.849708         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  1,671,360     64.3371    2.884776         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  1,357,522     73.9138    2.749333         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    693,089    84.92947    4.205442         80        110


. safetab agegroup age66, m
15

   Grouped |  66 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,981,860          0 | 1,981,860 
    30-<40 | 2,230,655          0 | 2,230,655 
    40-<50 | 2,022,059          0 | 2,022,059 
    50-<60 | 2,062,371          0 | 2,062,371 
    60-<70 | 1,200,796    470,564 | 1,671,360 
    70-<80 |         0  1,357,522 | 1,357,522 
       80+ |         0    693,089 |   693,089 
-----------+----------------------+----------
     Total | 9,497,741  2,521,175 |12,018,916 

. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never | 5,552,046          0          0 | 5,552,046 
      Former |         0  4,080,069          0 | 4,080,069 
     Current |         0          0  2,123,173 | 2,123,173 
Unknown (.u) |   263,628          0          0 |   263,628 
-------------+---------------------------------+----------
       Total | 5,815,674  4,080,069  2,123,173 |12,018,916 

. 
. * Diabetes
. *safetab diabcat diabetes, m
. 
. * CKD
. safetab reduced egfr_cat, m
17

       Reduced kidney |               Calculated eGFR
             function |         0         15         30         45 |     Total
----------------------+--------------------------------------------+----------
                 None |         0          0          0          0 |11,309,248 
Stage 3a/3b egfr 30-6 |         0          0    162,675    496,503 |   659,178 
    Stage 4/5 egfr<30 |     9,996     40,494          0          0 |    50,490 
----------------------+--------------------------------------------+----------
                Total |     9,996     40,494    162,675    496,503 |12,018,916 


       Reduced kidney |    Calculated eGFR
             function |        60          . |     Total
----------------------+----------------------+----------
                 None | 8,440,012  2,869,236 |11,309,248 
Stage 3a/3b egfr 30-6 |         0          0 |   659,178 
    Stage 4/5 egfr<30 |         0          0 |    50,490 
----------------------+----------------------+----------
                Total | 8,440,012  2,869,236 |12,018,916 

. * CKD
. safetab reduced esrd, m
13

                      |    End-stage renal
       Reduced kidney |        disease
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,304,272      4,976 |11,309,248 
Stage 3a/3b egfr 30-6 |   654,553      4,625 |   659,178 
    Stage 4/5 egfr<30 |    41,696      8,794 |    50,490 
----------------------+----------------------+----------
                Total |12,000,521     18,395 |12,018,916 

. 
. /* EXPECTED RELATIONSHIPS====================================================
> =*/ 
. 
. /*  Relationships between demographic/lifestyle variables  */
. safetab agegroup bmicat,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                      Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II  |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |    82,105    726,089    329,130    145,277     65,500 | 1,387,012 
           |      5.92      52.35      23.73      10.47       4.72 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |    45,256    780,722    554,409    248,912    103,774 | 1,793,361 
           |      2.52      43.53      30.91      13.88       5.79 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |    23,221    590,007    613,832    305,266    121,120 | 1,719,220 
           |      1.35      34.32      35.70      17.76       7.05 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |    18,822    523,496    690,973    385,145    153,452 | 1,851,629 
           |      1.02      28.27      37.32      20.80       8.29 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |    18,759    436,606    592,692    325,742    123,082 | 1,554,321 
           |      1.21      28.09      38.13      20.96       7.92 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |    19,885    385,666    511,602    254,746     84,492 | 1,289,381 
           |      1.54      29.91      39.68      19.76       6.55 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |    20,865    244,588    246,311    101,007     27,152 |   647,728 
           |      3.22      37.76      38.03      15.59       4.19 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |   228,913  3,687,174  3,538,949  1,766,095    678,572 |10,242,652 
           |      2.23      36.00      34.55      17.24       6.62 |    100.00 


           |  Grouped
   Grouped |    BMI
       age | Obese III |     Total
-----------+-----------+----------
    18-<30 |    38,911 | 1,387,012 
           |      2.81 |    100.00 
-----------+-----------+----------
    30-<40 |    60,288 | 1,793,361 
           |      3.36 |    100.00 
-----------+-----------+----------
    40-<50 |    65,774 | 1,719,220 
           |      3.83 |    100.00 
-----------+-----------+----------
    50-<60 |    79,741 | 1,851,629 
           |      4.31 |    100.00 
-----------+-----------+----------
    60-<70 |    57,440 | 1,554,321 
           |      3.70 |    100.00 
-----------+-----------+----------
    70-<80 |    32,990 | 1,289,381 
           |      2.56 |    100.00 
-----------+-----------+----------
       80+ |     7,805 |   647,728 
           |      1.20 |    100.00 
-----------+-----------+----------
     Total |   342,949 |10,242,652 
           |      3.35 |    100.00 

. safetab agegroup smoke,         row  
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Smoking status
       age |     Never     Former    Current |     Total
-----------+---------------------------------+----------
    18-<30 | 1,121,470    281,208    407,308 | 1,809,986 
           |     61.96      15.54      22.50 |    100.00 
-----------+---------------------------------+----------
    30-<40 | 1,074,586    593,214    517,988 | 2,185,788 
           |     49.16      27.14      23.70 |    100.00 
-----------+---------------------------------+----------
    40-<50 |   906,908    663,783    428,350 | 1,999,041 
           |     45.37      33.21      21.43 |    100.00 
-----------+---------------------------------+----------
    50-<60 |   932,452    724,221    392,765 | 2,049,438 
           |     45.50      35.34      19.16 |    100.00 
-----------+---------------------------------+----------
    60-<70 |   713,579    720,772    230,491 | 1,664,842 
           |     42.86      43.29      13.84 |    100.00 
-----------+---------------------------------+----------
    70-<80 |   515,676    722,258    116,623 | 1,354,557 
           |     38.07      53.32       8.61 |    100.00 
-----------+---------------------------------+----------
       80+ |   287,375    374,613     29,648 |   691,636 
           |     41.55      54.16       4.29 |    100.00 
-----------+---------------------------------+----------
     Total | 5,552,046  4,080,069  2,123,173 |11,755,288 
           |     47.23      34.71      18.06 |    100.00 

. safetab agegroup ethnicity, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                       Ethnicity
       age |     White      Mixed  Asian or       Black      Other |     Total
-----------+-------------------------------------------------------+----------
    18-<30 | 1,574,273     51,654    190,361     72,375     93,197 | 1,981,860 
           |     79.43       2.61       9.61       3.65       4.70 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 | 1,761,149     45,533    263,106     75,678     85,189 | 2,230,655 
           |     78.95       2.04      11.80       3.39       3.82 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 | 1,633,692     33,217    211,869     78,639     64,642 | 2,022,059 
           |     80.79       1.64      10.48       3.89       3.20 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 | 1,821,186     22,519    118,157     63,129     37,380 | 2,062,371 
           |     88.31       1.09       5.73       3.06       1.81 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 | 1,531,368     10,148     82,293     26,491     21,060 | 1,671,360 
           |     91.62       0.61       4.92       1.58       1.26 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 | 1,290,540      4,670     40,228     11,899     10,185 | 1,357,522 
           |     95.07       0.34       2.96       0.88       0.75 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |   655,964      2,294     21,652      8,686      4,493 |   693,089 
           |     94.64       0.33       3.12       1.25       0.65 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |10,268,172    170,035    927,666    336,897    316,146 |12,018,916 
           |     85.43       1.41       7.72       2.80       2.63 |    100.00 

. safetab agegroup imd,           row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Index of Multiple Deprivation (IMD)
       age | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |   299,686    351,542    416,684    471,026    442,922 | 1,981,860 
           |     15.12      17.74      21.02      23.77      22.35 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |   359,540    420,010    463,835    512,489    474,781 | 2,230,655 
           |     16.12      18.83      20.79      22.97      21.28 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |   406,403    410,039    411,849    417,512    376,256 | 2,022,059 
           |     20.10      20.28      20.37      20.65      18.61 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |   432,335    439,734    429,391    410,104    350,807 | 2,062,371 
           |     20.96      21.32      20.82      19.89      17.01 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |   373,002    373,182    358,129    316,374    250,673 | 1,671,360 
           |     22.32      22.33      21.43      18.93      15.00 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |   335,677    321,675    293,919    237,820    168,431 | 1,357,522 
           |     24.73      23.70      21.65      17.52      12.41 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |   168,907    162,879    149,518    122,743     89,042 |   693,089 
           |     24.37      23.50      21.57      17.71      12.85 |    100.00 
-----------+-------------------------------------------------------+----------
     Total | 2,375,550  2,479,061  2,523,325  2,488,068  2,152,912 |12,018,916 
           |     19.77      20.63      20.99      20.70      17.91 |    100.00 

. safetab agegroup shield,    row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Probable shielding
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,569,438    412,422 | 1,981,860 
           |     79.19      20.81 |    100.00 
-----------+----------------------+----------
    30-<40 | 1,800,235    430,420 | 2,230,655 
           |     80.70      19.30 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,625,601    396,458 | 2,022,059 
           |     80.39      19.61 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,599,352    463,019 | 2,062,371 
           |     77.55      22.45 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,204,089    467,271 | 1,671,360 
           |     72.04      27.96 |    100.00 
-----------+----------------------+----------
    70-<80 |   872,153    485,369 | 1,357,522 
           |     64.25      35.75 |    100.00 
-----------+----------------------+----------
       80+ |   414,718    278,371 |   693,089 
           |     59.84      40.16 |    100.00 
-----------+----------------------+----------
     Total | 9,085,586  2,933,330 |12,018,916 
           |     75.59      24.41 |    100.00 

. 
. safetab bmicat smoke,            row   
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |          Smoking status
         Grouped BMI |     Never     Former    Current |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |   109,174     51,137     65,040 |   225,351 
                     |     48.45      22.69      28.86 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) | 1,814,129  1,140,375    710,278 | 3,664,782 
                     |     49.50      31.12      19.38 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,595,381  1,375,560    556,478 | 3,527,419 
                     |     45.23      39.00      15.78 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   752,882    736,205    272,123 | 1,761,210 
                     |     42.75      41.80      15.45 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   286,617    283,731    106,209 |   676,557 
                     |     42.36      41.94      15.70 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |   145,079    142,614     54,184 |   341,877 
                     |     42.44      41.72      15.85 |    100.00 
---------------------+---------------------------------+----------
               Total | 4,703,262  3,729,622  1,764,312 |10,197,196 
                     |     46.12      36.57      17.30 |    100.00 

. safetab bmicat ethnicity,        row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |                  Ethnicity
         Grouped BMI |     White      Mixed  Asian or       Black |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |   183,085      4,014     24,369      5,068 |   228,913 
                     |     79.98       1.75      10.65       2.21 |    100.00 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) | 3,134,018     55,168    292,933     82,574 | 3,687,174 
                     |     85.00       1.50       7.94       2.24 |    100.00 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) | 3,044,438     43,430    281,488     97,434 | 3,538,949 
                     |     86.03       1.23       7.95       2.75 |    100.00 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) | 1,546,266     20,924    116,122     55,197 | 1,766,095 
                     |     87.55       1.18       6.58       3.13 |    100.00 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |   604,899      7,976     35,533     21,687 |   678,572 
                     |     89.14       1.18       5.24       3.20 |    100.00 
---------------------+--------------------------------------------+----------
     Obese III (40+) |   311,013      4,197     13,652     10,496 |   342,949 
                     |     90.69       1.22       3.98       3.06 |    100.00 
---------------------+--------------------------------------------+----------
               Total | 8,823,719    135,709    764,097    272,456 |10,242,652 
                     |     86.15       1.32       7.46       2.66 |    100.00 


                     | Ethnicity
         Grouped BMI |     Other |     Total
---------------------+-----------+----------
 Underweight (<18.5) |    12,377 |   228,913 
                     |      5.41 |    100.00 
---------------------+-----------+----------
  Normal (18.5-24.9) |   122,481 | 3,687,174 
                     |      3.32 |    100.00 
---------------------+-----------+----------
Overweight (25-29.9) |    72,159 | 3,538,949 
                     |      2.04 |    100.00 
---------------------+-----------+----------
   Obese I (30-34.9) |    27,586 | 1,766,095 
                     |      1.56 |    100.00 
---------------------+-----------+----------
  Obese II (35-39.9) |     8,477 |   678,572 
                     |      1.25 |    100.00 
---------------------+-----------+----------
     Obese III (40+) |     3,591 |   342,949 
                     |      1.05 |    100.00 
---------------------+-----------+----------
               Total |   246,671 |10,242,652 
                     |      2.41 |    100.00 

. safetab bmicat imd,              row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |     Index of Multiple Deprivation (IMD)
         Grouped BMI | 1 least d          2          3          4 |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |    37,978     43,240     47,707     51,176 |   228,913 
                     |     16.59      18.89      20.84      22.36 |    100.00 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |   803,243    803,239    782,757    726,310 | 3,687,174 
                     |     21.78      21.78      21.23      19.70 |    100.00 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |   749,287    757,577    747,600    707,654 | 3,538,949 
                     |     21.17      21.41      21.12      20.00 |    100.00 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |   320,321    349,506    369,197    380,788 | 1,766,095 
                     |     18.14      19.79      20.90      21.56 |    100.00 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |   104,443    124,145    139,299    155,099 |   678,572 
                     |     15.39      18.30      20.53      22.86 |    100.00 
---------------------+--------------------------------------------+----------
     Obese III (40+) |    45,271     57,326     68,307     81,796 |   342,949 
                     |     13.20      16.72      19.92      23.85 |    100.00 
---------------------+--------------------------------------------+----------
               Total | 2,060,543  2,135,033  2,154,867  2,102,823 |10,242,652 
                     |     20.12      20.84      21.04      20.53 |    100.00 


                     |  Index of
                     |  Multiple
                     | Deprivatio
                     |  n (IMD)
         Grouped BMI | 5 most de |     Total
---------------------+-----------+----------
 Underweight (<18.5) |    48,812 |   228,913 
                     |     21.32 |    100.00 
---------------------+-----------+----------
  Normal (18.5-24.9) |   571,625 | 3,687,174 
                     |     15.50 |    100.00 
---------------------+-----------+----------
Overweight (25-29.9) |   576,831 | 3,538,949 
                     |     16.30 |    100.00 
---------------------+-----------+----------
   Obese I (30-34.9) |   346,283 | 1,766,095 
                     |     19.61 |    100.00 
---------------------+-----------+----------
  Obese II (35-39.9) |   155,586 |   678,572 
                     |     22.93 |    100.00 
---------------------+-----------+----------
     Obese III (40+) |    90,249 |   342,949 
                     |     26.32 |    100.00 
---------------------+-----------+----------
               Total | 1,789,386 |10,242,652 
                     |     17.47 |    100.00 

. safetab bmicat hypertension, row 
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |       Diagnosed
                     |     hypertension
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   201,118     27,795 |   228,913 
                     |     87.86      12.14 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,147,506    539,668 | 3,687,174 
                     |     85.36      14.64 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,640,104    898,845 | 3,538,949 
                     |     74.60      25.40 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,170,402    595,693 | 1,766,095 
                     |     66.27      33.73 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |   422,641    255,931 |   678,572 
                     |     62.28      37.72 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |   208,040    134,909 |   342,949 
                     |     60.66      39.34 |    100.00 
---------------------+----------------------+----------
               Total | 7,789,811  2,452,841 |10,242,652 
                     |     76.05      23.95 |    100.00 

. safetab bmicat shield,    row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Probable shielding
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   167,475     61,438 |   228,913 
                     |     73.16      26.84 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 2,821,092    866,082 | 3,687,174 
                     |     76.51      23.49 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,635,845    903,104 | 3,538,949 
                     |     74.48      25.52 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,268,324    497,771 | 1,766,095 
                     |     71.82      28.18 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |   466,606    211,966 |   678,572 
                     |     68.76      31.24 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |   225,472    117,477 |   342,949 
                     |     65.75      34.25 |    100.00 
---------------------+----------------------+----------
               Total | 7,584,814  2,657,838 |10,242,652 
                     |     74.05      25.95 |    100.00 

. 
.                             
. safetab smoke ethnicity,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |                  Ethnicity
      status |     White      Mixed  Asian or       Black |     Total
-------------+--------------------------------------------+----------
       Never | 4,409,080     89,006    647,083    218,126 | 5,552,046 
             |     79.41       1.60      11.65       3.93 |    100.00 
-------------+--------------------------------------------+----------
      Former | 3,777,983     39,504    143,529     61,725 | 4,080,069 
             |     92.60       0.97       3.52       1.51 |    100.00 
-------------+--------------------------------------------+----------
     Current | 1,888,214     34,606    102,854     44,401 | 2,123,173 
             |     88.93       1.63       4.84       2.09 |    100.00 
-------------+--------------------------------------------+----------
       Total |10,075,277    163,116    893,466    324,252 |11,755,288 
             |     85.71       1.39       7.60       2.76 |    100.00 


     Smoking | Ethnicity
      status |     Other |     Total
-------------+-----------+----------
       Never |   188,751 | 5,552,046 
             |      3.40 |    100.00 
-------------+-----------+----------
      Former |    57,328 | 4,080,069 
             |      1.41 |    100.00 
-------------+-----------+----------
     Current |    53,098 | 2,123,173 
             |      2.50 |    100.00 
-------------+-----------+----------
       Total |   299,177 |11,755,288 
             |      2.55 |    100.00 

. safetab smoke imd,                      row 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |     Index of Multiple Deprivation (IMD)
      status | 1 least d          2          3          4 |     Total
-------------+--------------------------------------------+----------
       Never | 1,238,173  1,211,651  1,173,410  1,093,959 | 5,552,046 
             |     22.30      21.82      21.13      19.70 |    100.00 
-------------+--------------------------------------------+----------
      Former |   868,866    898,319    881,073    798,381 | 4,080,069 
             |     21.30      22.02      21.59      19.57 |    100.00 
-------------+--------------------------------------------+----------
     Current |   230,575    322,986    414,759    533,306 | 2,123,173 
             |     10.86      15.21      19.53      25.12 |    100.00 
-------------+--------------------------------------------+----------
       Total | 2,337,614  2,432,956  2,469,242  2,425,646 |11,755,288 
             |     19.89      20.70      21.01      20.63 |    100.00 


             |  Index of
             |  Multiple
             | Deprivatio
     Smoking |  n (IMD)
      status | 5 most de |     Total
-------------+-----------+----------
       Never |   834,853 | 5,552,046 
             |     15.04 |    100.00 
-------------+-----------+----------
      Former |   633,430 | 4,080,069 
             |     15.52 |    100.00 
-------------+-----------+----------
     Current |   621,547 | 2,123,173 
             |     29.27 |    100.00 
-------------+-----------+----------
       Total | 2,089,830 |11,755,288 
             |     17.78 |    100.00 

. safetab smoke hypertension, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,517,974  1,034,072 | 5,552,046 
             |     81.37      18.63 |    100.00 
-------------+----------------------+----------
      Former | 2,836,732  1,243,337 | 4,080,069 
             |     69.53      30.47 |    100.00 
-------------+----------------------+----------
     Current | 1,823,937    299,236 | 2,123,173 
             |     85.91      14.09 |    100.00 
-------------+----------------------+----------
       Total | 9,178,643  2,576,645 |11,755,288 
             |     78.08      21.92 |    100.00 

. safetab smoke shield,    row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Probable shielding
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,380,188  1,171,858 | 5,552,046 
             |     78.89      21.11 |    100.00 
-------------+----------------------+----------
      Former | 2,865,219  1,214,850 | 4,080,069 
             |     70.22      29.78 |    100.00 
-------------+----------------------+----------
     Current | 1,592,087    531,086 | 2,123,173 
             |     74.99      25.01 |    100.00 
-------------+----------------------+----------
       Total | 8,837,494  2,917,794 |11,755,288 
             |     75.18      24.82 |    100.00 

.                       
. safetab ethnicity imd,          row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |     Index of Multiple Deprivation (IMD)
            Ethnicity | 1 least d          2          3          4 |     Total
----------------------+--------------------------------------------+----------
                White | 2,202,124  2,241,599  2,176,596  2,000,997 |10,268,172 
                      |     21.45      21.83      21.20      19.49 |    100.00 
----------------------+--------------------------------------------+----------
                Mixed |    22,485     28,419     34,428     41,256 |   170,035 
                      |     13.22      16.71      20.25      24.26 |    100.00 
----------------------+--------------------------------------------+----------
Asian or Asian Britis |    86,015    117,441    187,205    272,090 |   927,666 
                      |      9.27      12.66      20.18      29.33 |    100.00 
----------------------+--------------------------------------------+----------
                Black |    23,192     36,648     59,384     93,007 |   336,897 
                      |      6.88      10.88      17.63      27.61 |    100.00 
----------------------+--------------------------------------------+----------
                Other |    41,734     54,954     65,712     80,718 |   316,146 
                      |     13.20      17.38      20.79      25.53 |    100.00 
----------------------+--------------------------------------------+----------
                Total | 2,375,550  2,479,061  2,523,325  2,488,068 |12,018,916 
                      |     19.77      20.63      20.99      20.70 |    100.00 


                      |  Index of
                      |  Multiple
                      | Deprivatio
                      |  n (IMD)
            Ethnicity | 5 most de |     Total
----------------------+-----------+----------
                White | 1,646,856 |10,268,172 
                      |     16.04 |    100.00 
----------------------+-----------+----------
                Mixed |    43,447 |   170,035 
                      |     25.55 |    100.00 
----------------------+-----------+----------
Asian or Asian Britis |   264,915 |   927,666 
                      |     28.56 |    100.00 
----------------------+-----------+----------
                Black |   124,666 |   336,897 
                      |     37.00 |    100.00 
----------------------+-----------+----------
                Other |    73,028 |   316,146 
                      |     23.10 |    100.00 
----------------------+-----------+----------
                Total | 2,152,912 |12,018,916 
                      |     17.91 |    100.00 

. safetab shield imd,             row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |          Index of Multiple Deprivation (IMD)
 shielding | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
         0 | 1,784,215  1,869,525  1,913,019  1,897,871  1,620,956 | 9,085,586 
           |     19.64      20.58      21.06      20.89      17.84 |    100.00 
-----------+-------------------------------------------------------+----------
         1 |   591,335    609,536    610,306    590,197    531,956 | 2,933,330 
           |     20.16      20.78      20.81      20.12      18.13 |    100.00 
-----------+-------------------------------------------------------+----------
     Total | 2,375,550  2,479,061  2,523,325  2,488,068  2,152,912 |12,018,916 
           |     19.77      20.63      20.99      20.70      17.91 |    100.00 

. 
. safetab shield ethnicity,               row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |                       Ethnicity
 shielding |     White      Mixed  Asian or       Black      Other |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,601,426    136,584    784,980    279,054    283,542 | 9,085,586 
           |     83.66       1.50       8.64       3.07       3.12 |    100.00 
-----------+-------------------------------------------------------+----------
         1 | 2,666,746     33,451    142,686     57,843     32,604 | 2,933,330 
           |     90.91       1.14       4.86       1.97       1.11 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |10,268,172    170,035    927,666    336,897    316,146 |12,018,916 
           |     85.43       1.41       7.72       2.80       2.63 |    100.00 

. 
. 
. 
. * Relationships with age
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>                    ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension            ///          
>    
>                                                                              
>    {
  2. 
.                 
.         safetab agegroup `var', row 
  3.  }
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Asthma category
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,583,894    397,966 | 1,981,860 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
    30-<40 | 1,830,494    400,161 | 2,230,655 
           |     82.06      17.94 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,686,916    335,143 | 2,022,059 
           |     83.43      16.57 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,739,743    322,628 | 2,062,371 
           |     84.36      15.64 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,431,485    239,875 | 1,671,360 
           |     85.65      14.35 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,174,958    182,564 | 1,357,522 
           |     86.55      13.45 |    100.00 
-----------+----------------------+----------
       80+ |   601,994     91,095 |   693,089 
           |     86.86      13.14 |    100.00 
-----------+----------------------+----------
     Total |10,049,484  1,969,432 |12,018,916 
           |     83.61      16.39 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,975,169      6,691 | 1,981,860 
           |     99.66       0.34 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,219,849     10,806 | 2,230,655 
           |     99.52       0.48 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,993,998     28,061 | 2,022,059 
           |     98.61       1.39 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,984,529     77,842 | 2,062,371 
           |     96.23       3.77 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,537,418    133,942 | 1,671,360 
           |     91.99       8.01 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,185,001    172,521 | 1,357,522 
           |     87.29      12.71 |    100.00 
-----------+----------------------+----------
       80+ |   591,570    101,519 |   693,089 
           |     85.35      14.65 |    100.00 
-----------+----------------------+----------
     Total |11,487,534    531,382 |12,018,916 
           |     95.58       4.42 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,968,360     13,500 | 1,981,860 
           |     99.32       0.68 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,213,327     17,328 | 2,230,655 
           |     99.22       0.78 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,984,301     37,758 | 2,022,059 
           |     98.13       1.87 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,956,300    106,071 | 2,062,371 
           |     94.86       5.14 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,488,948    182,412 | 1,671,360 
           |     89.09      10.91 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,097,000    260,522 | 1,357,522 
           |     80.81      19.19 |    100.00 
-----------+----------------------+----------
       80+ |   464,484    228,605 |   693,089 
           |     67.02      32.98 |    100.00 
-----------+----------------------+----------
     Total |11,172,720    846,196 |12,018,916 
           |     92.96       7.04 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                        Diabetes
       age | No diabet  T1DM, con  T1DM, unc  T2DM, con  T2DM, unc |     Total
-----------+-------------------------------------------------------+----------
    18-<30 | 1,965,718      2,418      8,596      2,469      1,960 | 1,981,860 
           |     99.19       0.12       0.43       0.12       0.10 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 | 2,193,588      3,185      8,575     13,243     11,219 | 2,230,655 
           |     98.34       0.14       0.38       0.59       0.50 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 | 1,933,309      2,894      8,623     40,871     35,469 | 2,022,059 
           |     95.61       0.14       0.43       2.02       1.75 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 | 1,882,844      2,958      9,300     91,392     74,687 | 2,062,371 
           |     91.30       0.14       0.45       4.43       3.62 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 | 1,438,910      2,524      6,005    136,576     86,197 | 1,671,360 
           |     86.09       0.15       0.36       8.17       5.16 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 | 1,119,055      1,839      3,697    159,614     72,337 | 1,357,522 
           |     82.43       0.14       0.27      11.76       5.33 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |   544,838        781      1,666    104,615     40,646 |   693,089 
           |     78.61       0.11       0.24      15.09       5.86 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |11,078,262     16,599     46,462    548,780    322,515 |12,018,916 
           |     92.17       0.14       0.39       4.57       2.68 |    100.00 


   Grouped |  Diabetes
       age | Diabetes, |     Total
-----------+-----------+----------
    18-<30 |       699 | 1,981,860 
           |      0.04 |    100.00 
-----------+-----------+----------
    30-<40 |       845 | 2,230,655 
           |      0.04 |    100.00 
-----------+-----------+----------
    40-<50 |       893 | 2,022,059 
           |      0.04 |    100.00 
-----------+-----------+----------
    50-<60 |     1,190 | 2,062,371 
           |      0.06 |    100.00 
-----------+-----------+----------
    60-<70 |     1,148 | 1,671,360 
           |      0.07 |    100.00 
-----------+-----------+----------
    70-<80 |       980 | 1,357,522 
           |      0.07 |    100.00 
-----------+-----------+----------
       80+ |       543 |   693,089 
           |      0.08 |    100.00 
-----------+-----------+----------
     Total |     6,298 |12,018,916 
           |      0.05 |    100.00 
31

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Chronic liver disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,979,654      2,206 | 1,981,860 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,223,080      7,575 | 2,230,655 
           |     99.66       0.34 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,008,806     13,253 | 2,022,059 
           |     99.34       0.66 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,042,844     19,527 | 2,062,371 
           |     99.05       0.95 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,651,797     19,563 | 1,671,360 
           |     98.83       1.17 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,343,629     13,893 | 1,357,522 
           |     98.98       1.02 |    100.00 
-----------+----------------------+----------
       80+ |   688,307      4,782 |   693,089 
           |     99.31       0.69 |    100.00 
-----------+----------------------+----------
     Total |11,938,117     80,799 |12,018,916 
           |     99.33       0.67 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Neurological disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,974,097      7,763 | 1,981,860 
           |     99.61       0.39 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,219,791     10,864 | 2,230,655 
           |     99.51       0.49 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,008,522     13,537 | 2,022,059 
           |     99.33       0.67 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,041,877     20,494 | 2,062,371 
           |     99.01       0.99 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,648,006     23,354 | 1,671,360 
           |     98.60       1.40 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,330,136     27,386 | 1,357,522 
           |     97.98       2.02 |    100.00 
-----------+----------------------+----------
       80+ |   676,283     16,806 |   693,089 
           |     97.58       2.42 |    100.00 
-----------+----------------------+----------
     Total |11,898,712    120,204 |12,018,916 
           |     99.00       1.00 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Stroke or dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,979,514      2,346 | 1,981,860 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,225,868      4,787 | 2,230,655 
           |     99.79       0.21 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,010,699     11,360 | 2,022,059 
           |     99.44       0.56 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,032,428     29,943 | 2,062,371 
           |     98.55       1.45 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,618,923     52,437 | 1,671,360 
           |     96.86       3.14 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,271,422     86,100 | 1,357,522 
           |     93.66       6.34 |    100.00 
-----------+----------------------+----------
       80+ |   599,245     93,844 |   693,089 
           |     86.46      13.54 |    100.00 
-----------+----------------------+----------
     Total |11,738,099    280,817 |12,018,916 
           |     97.66       2.34 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Autoimmune disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,935,569     46,291 | 1,981,860 
           |     97.66       2.34 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,148,381     82,274 | 2,230,655 
           |     96.31       3.69 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,925,584     96,475 | 2,022,059 
           |     95.23       4.77 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,937,935    124,436 | 2,062,371 
           |     93.97       6.03 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,551,630    119,730 | 1,671,360 
           |     92.84       7.16 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,249,330    108,192 | 1,357,522 
           |     92.03       7.97 |    100.00 
-----------+----------------------+----------
       80+ |   640,367     52,722 |   693,089 
           |     92.39       7.61 |    100.00 
-----------+----------------------+----------
     Total |11,388,796    630,120 |12,018,916 
           |     94.76       5.24 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
   Grouped |      algorithm)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,977,430      4,430 | 1,981,860 
           |     99.78       0.22 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,224,021      6,634 | 2,230,655 
           |     99.70       0.30 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,012,462      9,597 | 2,022,059 
           |     99.53       0.47 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,053,119      9,252 | 2,062,371 
           |     99.55       0.45 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,666,510      4,850 | 1,671,360 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,354,811      2,711 | 1,357,522 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
       80+ |   692,001      1,088 |   693,089 
           |     99.84       0.16 |    100.00 
-----------+----------------------+----------
     Total |11,980,354     38,562 |12,018,916 
           |     99.68       0.32 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
   Grouped |      transplant
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,981,631        229 | 1,981,860 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,230,322        333 | 2,230,655 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,021,561        498 | 2,022,059 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,061,669        702 | 2,062,371 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,670,597        763 | 1,671,360 
           |     99.95       0.05 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,357,100        422 | 1,357,522 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
       80+ |   692,954        135 |   693,089 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
     Total |12,015,834      3,082 |12,018,916 
           |     99.97       0.03 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Asplenia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,981,070        790 | 1,981,860 
           |     99.96       0.04 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,228,996      1,659 | 2,230,655 
           |     99.93       0.07 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,019,599      2,460 | 2,022,059 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,058,286      4,085 | 2,062,371 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,667,443      3,917 | 1,671,360 
           |     99.77       0.23 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,353,966      3,556 | 1,357,522 
           |     99.74       0.26 |    100.00 
-----------+----------------------+----------
       80+ |   691,460      1,629 |   693,089 
           |     99.76       0.24 |    100.00 
-----------+----------------------+----------
     Total |12,000,820     18,096 |12,018,916 
           |     99.85       0.15 |    100.00 
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Non-haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 | 1,977,538        535      1,466      2,321 | 1,981,860 
           |     99.78       0.03       0.07       0.12 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 | 2,215,932      1,770      5,211      7,742 | 2,230,655 
           |     99.34       0.08       0.23       0.35 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 | 1,989,175      3,812     10,950     18,122 | 2,022,059 
           |     98.37       0.19       0.54       0.90 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 | 1,981,514      8,941     26,319     45,597 | 2,062,371 
           |     96.08       0.43       1.28       2.21 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 | 1,535,806     14,485     40,873     80,196 | 1,671,360 
           |     91.89       0.87       2.45       4.80 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 | 1,164,355     16,686     50,559    125,922 | 1,357,522 
           |     85.77       1.23       3.72       9.28 |    100.00 
-----------+--------------------------------------------+----------
       80+ |   566,845      8,956     26,390     90,898 |   693,089 
           |     81.79       1.29       3.81      13.11 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,431,165     55,185    161,768    370,798 |12,018,916 
           |     95.11       0.46       1.35       3.09 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 | 1,979,245        177        605      1,833 | 1,981,860 
           |     99.87       0.01       0.03       0.09 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 | 2,226,653        278        854      2,870 | 2,230,655 
           |     99.82       0.01       0.04       0.13 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 | 2,016,512        368      1,162      4,017 | 2,022,059 
           |     99.73       0.02       0.06       0.20 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 | 2,052,551        856      2,614      6,350 | 2,062,371 
           |     99.52       0.04       0.13       0.31 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 | 1,656,979      1,415      4,289      8,677 | 1,671,360 
           |     99.14       0.08       0.26       0.52 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 | 1,337,585      2,025      6,009     11,903 | 1,357,522 
           |     98.53       0.15       0.44       0.88 |    100.00 
-----------+--------------------------------------------+----------
       80+ |   680,344      1,147      3,688      7,910 |   693,089 
           |     98.16       0.17       0.53       1.14 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,949,869      6,266     19,221     43,560 |12,018,916 
           |     99.43       0.05       0.16       0.36 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |     Reduced kidney function
       age |      None  Stage 3a/  Stage 4/5 |     Total
-----------+---------------------------------+----------
    18-<30 | 1,980,624        862        374 | 1,981,860 
           |     99.94       0.04       0.02 |    100.00 
-----------+---------------------------------+----------
    30-<40 | 2,226,575      3,134        946 | 2,230,655 
           |     99.82       0.14       0.04 |    100.00 
-----------+---------------------------------+----------
    40-<50 | 2,010,510      9,900      1,649 | 2,022,059 
           |     99.43       0.49       0.08 |    100.00 
-----------+---------------------------------+----------
    50-<60 | 2,022,071     36,881      3,419 | 2,062,371 
           |     98.05       1.79       0.17 |    100.00 
-----------+---------------------------------+----------
    60-<70 | 1,569,690     96,047      5,623 | 1,671,360 
           |     93.92       5.75       0.34 |    100.00 
-----------+---------------------------------+----------
    70-<80 | 1,112,026    233,359     12,137 | 1,357,522 
           |     81.92      17.19       0.89 |    100.00 
-----------+---------------------------------+----------
       80+ |   387,752    278,995     26,342 |   693,089 
           |     55.95      40.25       3.80 |    100.00 
-----------+---------------------------------+----------
     Total |11,309,248    659,178     50,490 |12,018,916 
           |     94.10       5.48       0.42 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
   Grouped |        disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,981,062        798 | 1,981,860 
           |     99.96       0.04 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,228,956      1,699 | 2,230,655 
           |     99.92       0.08 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,019,504      2,555 | 2,022,059 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,058,342      4,029 | 2,062,371 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,667,324      4,036 | 1,671,360 
           |     99.76       0.24 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,354,022      3,500 | 1,357,522 
           |     99.74       0.26 |    100.00 
-----------+----------------------+----------
       80+ |   691,311      1,778 |   693,089 
           |     99.74       0.26 |    100.00 
-----------+----------------------+----------
     Total |12,000,521     18,395 |12,018,916 
           |     99.85       0.15 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
   Grouped |     hypertension
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,967,152     14,708 | 1,981,860 
           |     99.26       0.74 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,168,090     62,565 | 2,230,655 
           |     97.20       2.80 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,824,378    197,681 | 2,022,059 
           |     90.22       9.78 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,605,698    456,673 | 2,062,371 
           |     77.86      22.14 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,043,812    627,548 | 1,671,360 
           |     62.45      37.55 |    100.00 
-----------+----------------------+----------
    70-<80 |   626,643    730,879 | 1,357,522 
           |     46.16      53.84 |    100.00 
-----------+----------------------+----------
       80+ |   203,822    489,267 |   693,089 
           |     29.41      70.59 |    100.00 
-----------+----------------------+----------
     Total | 9,439,595  2,579,321 |12,018,916 
           |     78.54      21.46 |    100.00 

. 
. 
. *Relationships with sex
. foreach var of varlist asthma                                           ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                     /// 
>    
>                                                                              
>    {
  2.                                                 
.         safetab male `var', row 
  3. }
12

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Asthma category
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,164,255  1,083,228 | 6,247,483 
           |     82.66      17.34 |    100.00 
-----------+----------------------+----------
         1 | 4,885,229    886,204 | 5,771,433 
           |     84.64      15.36 |    100.00 
-----------+----------------------+----------
     Total |10,049,484  1,969,432 |12,018,916 
           |     83.61      16.39 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,983,994    263,489 | 6,247,483 
           |     95.78       4.22 |    100.00 
-----------+----------------------+----------
         1 | 5,503,540    267,893 | 5,771,433 
           |     95.36       4.64 |    100.00 
-----------+----------------------+----------
     Total |11,487,534    531,382 |12,018,916 
           |     95.58       4.42 |    100.00 
29

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,912,360    335,123 | 6,247,483 
           |     94.64       5.36 |    100.00 
-----------+----------------------+----------
         1 | 5,260,360    511,073 | 5,771,433 
           |     91.14       8.86 |    100.00 
-----------+----------------------+----------
     Total |11,172,720    846,196 |12,018,916 
           |     92.96       7.04 |    100.00 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |                        Diabetes
      Male | No diabet  T1DM, con  T1DM, unc  T2DM, con  T2DM, unc |     Total
-----------+-------------------------------------------------------+----------
         0 | 5,832,019      7,016     20,494    251,437    133,755 | 6,247,483 
           |     93.35       0.11       0.33       4.02       2.14 |    100.00 
-----------+-------------------------------------------------------+----------
         1 | 5,246,243      9,583     25,968    297,343    188,760 | 5,771,433 
           |     90.90       0.17       0.45       5.15       3.27 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |11,078,262     16,599     46,462    548,780    322,515 |12,018,916 
           |     92.17       0.14       0.39       4.57       2.68 |    100.00 


           |  Diabetes
      Male | Diabetes, |     Total
-----------+-----------+----------
         0 |     2,762 | 6,247,483 
           |      0.04 |    100.00 
-----------+-----------+----------
         1 |     3,536 | 5,771,433 
           |      0.06 |    100.00 
-----------+-----------+----------
     Total |     6,298 |12,018,916 
           |      0.05 |    100.00 
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Chronic liver disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,212,801     34,682 | 6,247,483 
           |     99.44       0.56 |    100.00 
-----------+----------------------+----------
         1 | 5,725,316     46,117 | 5,771,433 
           |     99.20       0.80 |    100.00 
-----------+----------------------+----------
     Total |11,938,117     80,799 |12,018,916 
           |     99.33       0.67 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neurological disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,184,936     62,547 | 6,247,483 
           |     99.00       1.00 |    100.00 
-----------+----------------------+----------
         1 | 5,713,776     57,657 | 5,771,433 
           |     99.00       1.00 |    100.00 
-----------+----------------------+----------
     Total |11,898,712    120,204 |12,018,916 
           |     99.00       1.00 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Stroke or dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,117,007    130,476 | 6,247,483 
           |     97.91       2.09 |    100.00 
-----------+----------------------+----------
         1 | 5,621,092    150,341 | 5,771,433 
           |     97.40       2.60 |    100.00 
-----------+----------------------+----------
     Total |11,738,099    280,817 |12,018,916 
           |     97.66       2.34 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Autoimmune disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,890,067    357,416 | 6,247,483 
           |     94.28       5.72 |    100.00 
-----------+----------------------+----------
         1 | 5,498,729    272,704 | 5,771,433 
           |     95.27       4.73 |    100.00 
-----------+----------------------+----------
     Total |11,388,796    630,120 |12,018,916 
           |     94.76       5.24 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
           |      algorithm)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,229,917     17,566 | 6,247,483 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
         1 | 5,750,437     20,996 | 5,771,433 
           |     99.64       0.36 |    100.00 
-----------+----------------------+----------
     Total |11,980,354     38,562 |12,018,916 
           |     99.68       0.32 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
           |      transplant
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,246,219      1,264 | 6,247,483 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
         1 | 5,769,615      1,818 | 5,771,433 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
     Total |12,015,834      3,082 |12,018,916 
           |     99.97       0.03 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Asplenia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,239,495      7,988 | 6,247,483 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
         1 | 5,761,325     10,108 | 5,771,433 
           |     99.82       0.18 |    100.00 
-----------+----------------------+----------
     Total |12,000,820     18,096 |12,018,916 
           |     99.85       0.15 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          Non-haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 | 5,912,142     26,927     82,790    225,624 | 6,247,483 
           |     94.63       0.43       1.33       3.61 |    100.00 
-----------+--------------------------------------------+----------
         1 | 5,519,023     28,258     78,978    145,174 | 5,771,433 
           |     95.63       0.49       1.37       2.52 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,431,165     55,185    161,768    370,798 |12,018,916 
           |     95.11       0.46       1.35       3.09 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |            Haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 | 6,216,410      2,712      8,332     20,029 | 6,247,483 
           |     99.50       0.04       0.13       0.32 |    100.00 
-----------+--------------------------------------------+----------
         1 | 5,733,459      3,554     10,889     23,531 | 5,771,433 
           |     99.34       0.06       0.19       0.41 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,949,869      6,266     19,221     43,560 |12,018,916 
           |     99.43       0.05       0.16       0.36 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     Reduced kidney function
      Male |      None  Stage 3a/  Stage 4/5 |     Total
-----------+---------------------------------+----------
         0 | 5,852,734    370,300     24,449 | 6,247,483 
           |     93.68       5.93       0.39 |    100.00 
-----------+---------------------------------+----------
         1 | 5,456,514    288,878     26,041 | 5,771,433 
           |     94.54       5.01       0.45 |    100.00 
-----------+---------------------------------+----------
     Total |11,309,248    659,178     50,490 |12,018,916 
           |     94.10       5.48       0.42 |    100.00 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
           |        disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,240,102      7,381 | 6,247,483 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
         1 | 5,760,419     11,014 | 5,771,433 
           |     99.81       0.19 |    100.00 
-----------+----------------------+----------
     Total |12,000,521     18,395 |12,018,916 
           |     99.85       0.15 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
           |     hypertension
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 4,953,668  1,293,815 | 6,247,483 
           |     79.29      20.71 |    100.00 
-----------+----------------------+----------
         1 | 4,485,927  1,285,506 | 5,771,433 
           |     77.73      22.27 |    100.00 
-----------+----------------------+----------
     Total | 9,439,595  2,579,321 |12,018,916 
           |     78.54      21.46 |    100.00 

. 
. *Relationships with smoking
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                         
>    ///
>                                         {
  2.         
.         safetab smoke `var', row 
  3. }
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |    Asthma category
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,687,139    864,907 | 5,552,046 
             |     84.42      15.58 |    100.00 
-------------+----------------------+----------
      Former | 3,353,889    726,180 | 4,080,069 
             |     82.20      17.80 |    100.00 
-------------+----------------------+----------
     Current | 1,757,971    365,202 | 2,123,173 
             |     82.80      17.20 |    100.00 
-------------+----------------------+----------
       Total | 9,798,999  1,956,289 |11,755,288 
             |     83.36      16.64 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Chronic Respiratory
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,468,127     83,919 | 5,552,046 
             |     98.49       1.51 |    100.00 
-------------+----------------------+----------
      Former | 3,780,016    300,053 | 4,080,069 
             |     92.65       7.35 |    100.00 
-------------+----------------------+----------
     Current | 1,976,259    146,914 | 2,123,173 
             |     93.08       6.92 |    100.00 
-------------+----------------------+----------
       Total |11,224,402    530,886 |11,755,288 
             |     95.48       4.52 |    100.00 
30

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Chronic Cardiac
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,280,696    271,350 | 5,552,046 
             |     95.11       4.89 |    100.00 
-------------+----------------------+----------
      Former | 3,618,947    461,122 | 4,080,069 
             |     88.70      11.30 |    100.00 
-------------+----------------------+----------
     Current | 2,011,042    112,131 | 2,123,173 
             |     94.72       5.28 |    100.00 
-------------+----------------------+----------
       Total |10,910,685    844,603 |11,755,288 
             |     92.82       7.18 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |                  Diabetes
      status | No diabet  T1DM, con  T1DM, unc  T2DM, con |     Total
-------------+--------------------------------------------+----------
       Never | 5,203,331      7,942     18,372    201,013 | 5,552,046 
             |     93.72       0.14       0.33       3.62 |    100.00 
-------------+--------------------------------------------+----------
      Former | 3,619,337      6,620     17,674    277,810 | 4,080,069 
             |     88.71       0.16       0.43       6.81 |    100.00 
-------------+--------------------------------------------+----------
     Current | 1,992,487      2,001     10,323     69,837 | 2,123,173 
             |     93.84       0.09       0.49       3.29 |    100.00 
-------------+--------------------------------------------+----------
       Total |10,815,155     16,563     46,369    548,660 |11,755,288 
             |     92.00       0.14       0.39       4.67 |    100.00 


     Smoking |       Diabetes
      status | T2DM, unc  Diabetes, |     Total
-------------+----------------------+----------
       Never |   118,685      2,703 | 5,552,046 
             |      2.14       0.05 |    100.00 
-------------+----------------------+----------
      Former |   156,338      2,290 | 4,080,069 
             |      3.83       0.06 |    100.00 
-------------+----------------------+----------
     Current |    47,369      1,156 | 2,123,173 
             |      2.23       0.05 |    100.00 
-------------+----------------------+----------
       Total |   322,392      6,149 |11,755,288 
             |      2.74       0.05 |    100.00 
28

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Chronic liver disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,528,550     23,496 | 5,552,046 
             |     99.58       0.42 |    100.00 
-------------+----------------------+----------
      Former | 4,047,138     32,931 | 4,080,069 
             |     99.19       0.81 |    100.00 
-------------+----------------------+----------
     Current | 2,099,113     24,060 | 2,123,173 
             |     98.87       1.13 |    100.00 
-------------+----------------------+----------
       Total |11,674,801     80,487 |11,755,288 
             |     99.32       0.68 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Neurological disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,499,638     52,408 | 5,552,046 
             |     99.06       0.94 |    100.00 
-------------+----------------------+----------
      Former | 4,028,593     51,476 | 4,080,069 
             |     98.74       1.26 |    100.00 
-------------+----------------------+----------
     Current | 2,107,540     15,633 | 2,123,173 
             |     99.26       0.74 |    100.00 
-------------+----------------------+----------
       Total |11,635,771    119,517 |11,755,288 
             |     98.98       1.02 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Stroke or dementia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,459,857     92,189 | 5,552,046 
             |     98.34       1.66 |    100.00 
-------------+----------------------+----------
      Former | 3,932,067    148,002 | 4,080,069 
             |     96.37       3.63 |    100.00 
-------------+----------------------+----------
     Current | 2,082,894     40,279 | 2,123,173 
             |     98.10       1.90 |    100.00 
-------------+----------------------+----------
       Total |11,474,818    280,470 |11,755,288 
             |     97.61       2.39 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Autoimmune disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,327,058    224,988 | 5,552,046 
             |     95.95       4.05 |    100.00 
-------------+----------------------+----------
      Former | 3,799,725    280,344 | 4,080,069 
             |     93.13       6.87 |    100.00 
-------------+----------------------+----------
     Current | 2,001,668    121,505 | 2,123,173 
             |     94.28       5.72 |    100.00 
-------------+----------------------+----------
       Total |11,128,451    626,837 |11,755,288 
             |     94.67       5.33 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Immunosuppressed
             |     (combination
     Smoking |      algorithm)
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,533,126     18,920 | 5,552,046 
             |     99.66       0.34 |    100.00 
-------------+----------------------+----------
      Former | 4,067,985     12,084 | 4,080,069 
             |     99.70       0.30 |    100.00 
-------------+----------------------+----------
     Current | 2,116,089      7,084 | 2,123,173 
             |     99.67       0.33 |    100.00 
-------------+----------------------+----------
       Total |11,717,200     38,088 |11,755,288 
             |     99.68       0.32 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Other solid organ
     Smoking |      transplant
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,550,689      1,357 | 5,552,046 
             |     99.98       0.02 |    100.00 
-------------+----------------------+----------
      Former | 4,078,709      1,360 | 4,080,069 
             |     99.97       0.03 |    100.00 
-------------+----------------------+----------
     Current | 2,122,822        351 | 2,123,173 
             |     99.98       0.02 |    100.00 
-------------+----------------------+----------
       Total |11,752,220      3,068 |11,755,288 
             |     99.97       0.03 |    100.00 
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Asplenia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,545,399      6,647 | 5,552,046 
             |     99.88       0.12 |    100.00 
-------------+----------------------+----------
      Former | 4,072,178      7,891 | 4,080,069 
             |     99.81       0.19 |    100.00 
-------------+----------------------+----------
     Current | 2,119,698      3,475 | 2,123,173 
             |     99.84       0.16 |    100.00 
-------------+----------------------+----------
       Total |11,737,275     18,013 |11,755,288 
             |     99.85       0.15 |    100.00 
24

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |          Non-haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never | 5,320,884     19,989     61,631    149,542 | 5,552,046 
             |     95.84       0.36       1.11       2.69 |    100.00 
-------------+--------------------------------------------+----------
      Former | 3,782,742     27,511     82,433    187,383 | 4,080,069 
             |     92.71       0.67       2.02       4.59 |    100.00 
-------------+--------------------------------------------+----------
     Current | 2,064,913      7,548     17,341     33,371 | 2,123,173 
             |     97.26       0.36       0.82       1.57 |    100.00 
-------------+--------------------------------------------+----------
       Total |11,168,539     55,048    161,405    370,296 |11,755,288 
             |     95.01       0.47       1.37       3.15 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never | 5,523,147      2,449      7,617     18,833 | 5,552,046 
             |     99.48       0.04       0.14       0.34 |    100.00 
-------------+--------------------------------------------+----------
      Former | 4,047,413      3,051      9,548     20,057 | 4,080,069 
             |     99.20       0.07       0.23       0.49 |    100.00 
-------------+--------------------------------------------+----------
     Current | 2,115,965        739      1,974      4,495 | 2,123,173 
             |     99.66       0.03       0.09       0.21 |    100.00 
-------------+--------------------------------------------+----------
       Total |11,686,525      6,239     19,139     43,385 |11,755,288 
             |     99.42       0.05       0.16       0.37 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |     Reduced kidney function
      status |      None  Stage 3a/  Stage 4/5 |     Total
-------------+---------------------------------+----------
       Never | 5,277,616    256,807     17,623 | 5,552,046 
             |     95.06       4.63       0.32 |    100.00 
-------------+---------------------------------+----------
      Former | 3,698,049    353,296     28,724 | 4,080,069 
             |     90.64       8.66       0.70 |    100.00 
-------------+---------------------------------+----------
     Current | 2,070,576     48,508      4,089 | 2,123,173 
             |     97.52       2.28       0.19 |    100.00 
-------------+---------------------------------+----------
       Total |11,046,241    658,611     50,436 |11,755,288 
             |     93.97       5.60       0.43 |    100.00 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    End-stage renal
     Smoking |        disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,544,368      7,678 | 5,552,046 
             |     99.86       0.14 |    100.00 
-------------+----------------------+----------
      Former | 4,071,664      8,405 | 4,080,069 
             |     99.79       0.21 |    100.00 
-------------+----------------------+----------
     Current | 2,120,916      2,257 | 2,123,173 
             |     99.89       0.11 |    100.00 
-------------+----------------------+----------
       Total |11,736,948     18,340 |11,755,288 
             |     99.84       0.16 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,517,974  1,034,072 | 5,552,046 
             |     81.37      18.63 |    100.00 
-------------+----------------------+----------
      Former | 2,836,732  1,243,337 | 4,080,069 
             |     69.53      30.47 |    100.00 
-------------+----------------------+----------
     Current | 1,823,937    299,236 | 2,123,173 
             |     85.91      14.09 |    100.00 
-------------+----------------------+----------
       Total | 9,178,643  2,576,645 |11,755,288 
             |     78.08      21.92 |    100.00 

. 
. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab covid_death covid_icu  , row col
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |   Failure/censoring
  outcome: |     indicator for
     covid |  outcome: covid icu
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |12,009,751      1,439 |12,011,190 
           |     99.99       0.01 |    100.00 
           |     99.94      61.68 |     99.94 
-----------+----------------------+----------
         1 |     6,832        894 |     7,726 
           |     88.43      11.57 |    100.00 
           |      0.06      38.32 |      0.06 
-----------+----------------------+----------
     Total |12,016,583      2,333 |12,018,916 
           |     99.98       0.02 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. safecount if covid_icu==1 & covid_death==1
  894

. safecount if covidadmission==1 & covid_death==1
  4,348

. 
. sum positive_SGSS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S | 12,018,916     .004686     .068294          0          1

. sum positive_SGSS if date_positive_SGSS<=22267

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |     56,321           1           0          1          1

. 
. safetab positive_SGSS covid_primary_care_codes, row col miss
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |  Indicator positive
 Indicator |   primary care code
  positive |    COVID infection
covid test |         0          1 |     Total
-----------+----------------------+----------
         0 |11,947,995     14,600 |11,962,595 
           |     99.88       0.12 |    100.00 
           |     99.81      30.19 |     99.53 
-----------+----------------------+----------
         1 |    22,563     33,758 |    56,321 
           |     40.06      59.94 |    100.00 
           |      0.19      69.81 |      0.47 
-----------+----------------------+----------
     Total |11,970,558     48,358 |12,018,916 
           |     99.60       0.40 |    100.00 
           |    100.00     100.00 |    100.00 

. safetab positive_SGSS covid_primary_care_codes if date_positive_SGSS<=22267 &
>  date_covid_primary_care_codes<=22267, row col miss
107

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           | Indicator
           |  positive
           |  primary
           | care code
 Indicator |   COVID
  positive | infection
covid test |         1 |     Total
-----------+-----------+----------
         1 |    33,758 |    33,758 
           |    100.00 |    100.00 
           |    100.00 |    100.00 
-----------+-----------+----------
     Total |    33,758 |    33,758 
           |    100.00 |    100.00 
           |    100.00 |    100.00 

. gen diff=date_positive_SGSS-date_covid_primary_care_codes 
(11,985,158 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -48           -150
 5%          -18           -150
10%          -11           -144       Obs              33,758
25%           -3           -140       Sum of Wgt.      33,758

50%           -1                      Mean          -3.447864
                        Largest       Std. Dev.      10.89729
75%            0            105
90%            0            110       Variance        118.751
95%            1            121       Skewness      -4.052746
99%           17            126       Kurtosis       44.24906

. 
. 
. /* DEATHS by STP=======================================================*/
. tab  stp covid_death, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     3,776          4 |     3,780 
           |      0.03       0.05 |      0.03 
-----------+----------------------+----------
         2 | 1,157,179        836 | 1,158,015 
           |      9.63      10.82 |      9.63 
-----------+----------------------+----------
         3 |   498,412        287 |   498,699 
           |      4.15       3.71 |      4.15 
-----------+----------------------+----------
         4 |   107,098        107 |   107,205 
           |      0.89       1.38 |      0.89 
-----------+----------------------+----------
         5 |    78,184         64 |    78,248 
           |      0.65       0.83 |      0.65 
-----------+----------------------+----------
         6 |   572,309        474 |   572,783 
           |      4.76       6.14 |      4.77 
-----------+----------------------+----------
         7 |    31,703         14 |    31,717 
           |      0.26       0.18 |      0.26 
-----------+----------------------+----------
         8 |   437,650        381 |   438,031 
           |      3.64       4.93 |      3.64 
-----------+----------------------+----------
         9 |   365,553        121 |   365,674 
           |      3.04       1.57 |      3.04 
-----------+----------------------+----------
        10 |   489,390        302 |   489,692 
           |      4.07       3.91 |      4.07 
-----------+----------------------+----------
        11 |   570,839        438 |   571,277 
           |      4.75       5.67 |      4.75 
-----------+----------------------+----------
        12 |   179,852        217 |   180,069 
           |      1.50       2.81 |      1.50 
-----------+----------------------+----------
        13 |   275,207        259 |   275,466 
           |      2.29       3.35 |      2.29 
-----------+----------------------+----------
        14 |   332,454        268 |   332,722 
           |      2.77       3.47 |      2.77 
-----------+----------------------+----------
        15 |   465,940        209 |   466,149 
           |      3.88       2.71 |      3.88 
-----------+----------------------+----------
        16 |   454,486        198 |   454,684 
           |      3.78       2.56 |      3.78 
-----------+----------------------+----------
        17 |   434,697        211 |   434,908 
           |      3.62       2.73 |      3.62 
-----------+----------------------+----------
        18 |   501,516        383 |   501,899 
           |      4.18       4.96 |      4.18 
-----------+----------------------+----------
        19 |   377,970        269 |   378,239 
           |      3.15       3.48 |      3.15 
-----------+----------------------+----------
        20 |   553,355        492 |   553,847 
           |      4.61       6.37 |      4.61 
-----------+----------------------+----------
        21 |   936,610        709 |   937,319 
           |      7.80       9.18 |      7.80 
-----------+----------------------+----------
        22 |    58,118         38 |    58,156 
           |      0.48       0.49 |      0.48 
-----------+----------------------+----------
        23 |   406,733        148 |   406,881 
           |      3.39       1.92 |      3.39 
-----------+----------------------+----------
        24 |    21,391         13 |    21,404 
           |      0.18       0.17 |      0.18 
-----------+----------------------+----------
        25 |    97,720         25 |    97,745 
           |      0.81       0.32 |      0.81 
-----------+----------------------+----------
        26 |   357,695         63 |   357,758 
           |      2.98       0.82 |      2.98 
-----------+----------------------+----------
        27 |   415,222        166 |   415,388 
           |      3.46       2.15 |      3.46 
-----------+----------------------+----------
        28 |   399,264        108 |   399,372 
           |      3.32       1.40 |      3.32 
-----------+----------------------+----------
        29 |   300,347         94 |   300,441 
           |      2.50       1.22 |      2.50 
-----------+----------------------+----------
        30 |   253,103        155 |   253,258 
           |      2.11       2.01 |      2.11 
-----------+----------------------+----------
        31 |    14,869          9 |    14,878 
           |      0.12       0.12 |      0.12 
-----------+----------------------+----------
        32 |   862,548        664 |   863,212 
           |      7.18       8.59 |      7.18 
-----------+----------------------+----------
     Total |12,011,190      7,726 |12,018,916 
           |    100.00     100.00 |    100.00 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/log/02_an_data_checks.log
  log type:  text
 closed on:  28 Jan 2021, 14:40:33
-------------------------------------------------------------------------------
