-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/02_an_data_checksW2.log
  log type:  text
 opened on:  29 Jan 2021, 16:01:08

. 
. * Open Stata dataset
. use $tempdir/`inputfile', clear

. 
. *run ssc install if not on local machine - server needs datacheck.ado file
. *ssc install datacheck 
. 
. *Duplicate patient check
. datacheck _n==1, by(patient_id) nol

. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

. 
. 
. * EXCLUDE 1:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUDE 2:  HH with more than 10 people
. datacheck inlist(household_size, 1, 2, 3, 4, 5,6, 7, 8, 9, 10), nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. *HH
. datacheck kids_cat4<., nol

. datacheck inlist(kids_cat4, 0,1, 2), nol

 (711932 contradictions)

. 
. datacheck number_kids<., nol

 (10079986 contradictions)

. datacheck inlist(number_kids, 0,1,2,3,4,5,6,7,8,9), nol

 (10079986 contradictions)

. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6,7), nol

. datacheck inlist(age66, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. 
. * Check date ranges for all comorbidities 
. 
. foreach var of varlist  chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         perm_immunodef  ///
>                                         temp_immunodef  ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         hypertension                         
>    ///
>                                         {
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_r~te |    510,047   27jun2009    6457.076  15dec1899  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_c~te |    812,226   05may2007     6649.73  15jan1840  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_l~te |     77,668   27jan2010    6455.485  15dec1840  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_neur~e |    115,427   16jul2002    8051.634  15jan1860  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dem~e |    263,231   16dec2010    5434.959  15dec1899  15jul2096

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_sle_pso~e |    621,482   03sep2002    7436.679  15jan1840  15mar3000

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
perm_immun~e |     35,326   28may2009    6204.311  15jan1900  15aug2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
temp_immun~e |      3,657   28feb2020    109.4406  15sep2019  15aug2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_tran~e |      2,974   07apr2008    4806.945  15jan1900  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
asplenia_d~e |     17,522   20feb1993    9136.251  15dec1899  15jan2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |  2,518,654   10feb2005    7370.254  15jan1800  15nov2056

. 
. foreach comorb in $varlist { 
  2.         local comorb: subinstr local comorb "i." ""
  3.         safetab `comorb', m
  4. }

. 
. *summarise end dates for each outcome
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. sum `outcome', format
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~b |    276,212   06nov2020    24.85763  02sep2020  18dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_non_c~h |     26,205   26oct2020    31.15599  02sep2020  18dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~h |      4,699   17nov2020    20.30119  02sep2020  18dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |      1,886   09nov2020    23.71643  01sep2020  18dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~n |      7,896   26oct2020    18.96623  01sep2020  30nov2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~1 |      4,058   16nov2020    20.33611  02sep2020  18dec2020

. 
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. gen `outcome'_month=mofd(`outcome') 
  3.  lab define `outcome'_month 721 feb 722 mar 723 apr 724 may 725 june 726 j
> ul 727 aug 728 sept 729 oct
  4. lab val `outcome'_month `outcome'_month
  5. tab `outcome'_month
  6. drop `outcome'_month
  7. }
(11,697,212 missing values generated)

date_covid_ |
tpp_prob_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
       sept |     21,041        7.62        7.62
        oct |     89,939       32.56       40.18
        730 |    107,751       39.01       79.19
        731 |     57,481       20.81      100.00
------------+-----------------------------------
      Total |    276,212      100.00
(11,947,219 missing values generated)

date_non_co |
vid_death_m |
       onth |      Freq.     Percent        Cum.
------------+-----------------------------------
       sept |      6,842       26.11       26.11
        oct |      7,612       29.05       55.16
        730 |      7,162       27.33       82.49
        731 |      4,589       17.51      100.00
------------+-----------------------------------
      Total |     26,205      100.00
(11,968,725 missing values generated)

date_covid_ |
death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
       sept |         95        2.02        2.02
        oct |        885       18.83       20.86
        730 |      2,328       49.54       70.40
        731 |      1,391       29.60      100.00
------------+-----------------------------------
      Total |      4,699      100.00
(11,971,538 missing values generated)

date_covid_ |
  icu_month |      Freq.     Percent        Cum.
------------+-----------------------------------
       sept |        122        6.47        6.47
        oct |        523       27.73       34.20
        730 |        831       44.06       78.26
        731 |        410       21.74      100.00
------------+-----------------------------------
      Total |      1,886      100.00
(11,965,528 missing values generated)

date_covida |
dmission_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
       sept |        903       11.44       11.44
        oct |      3,428       43.41       54.85
        730 |      3,565       45.15      100.00
------------+-----------------------------------
      Total |      7,896      100.00
(11,969,366 missing values generated)

died_date_o |
nscovid_par |
   t1_month |      Freq.     Percent        Cum.
------------+-----------------------------------
       sept |         85        2.09        2.09
        oct |        787       19.39       21.49
        730 |      2,029       50.00       71.49
        731 |      1,157       28.51      100.00
------------+-----------------------------------
      Total |      4,058      100.00

. 
. *Outcome dates
. di d(1feb2020)
21946

. * 21946
. di d(01apr2020)
22006

. * 22006
. di d(01june2020)
22067

. * 22067
. di d(01aug2020)
22128

. * 22128
. di d(01oct2020)
22189

. * 22189
. di d(01dec2020)
22250

. * 22250
. di d(18dec2020)
22267

. * 22267
. 
. foreach outcome of any covid_primary_care_codes positive_SGSS non_covid_death
>   covid_tpp_prob covidadmission covid_icu covid_death    {
  2. summ  `outcome', format d 
  3. summ patient_id if `outcome'==1 & date_`outcome'<=22267
  4. local total_`outcome'=`r(N)'
  5. hist date_`outcome' if date_`outcome'<=22267, saving(`outcome', replace) /
> //
> xlabel(21946 22006 22067 22128 22189 22250 ,labsize(tiny))  xtitle(, size(vsm
> all)) ///
> graphregion(color(white))  legend(off) freq  ///
> yscale(range(0 3000)) ylab(0 (10000) 30000, labsize(vsmall)) ytitle("Number",
>  size(vsmall))  ///
> title("N=`total_`outcome''", size(vsmall)) 
  6. }

         Indicator positive primary care code COVID
                          infection
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,973,424
25%            0              0       Sum of Wgt.    11973424

50%            0                      Mean           .0171087
                        Largest       Std. Dev.      .1296766
75%            0              1
90%            0              1       Variance        .016816
95%            0              1       Skewness       7.447625
99%            1              1       Kurtosis       56.46712

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |    204,850    1.90e+07    1.40e+07      10043   5.45e+07
(bin=53, start=22160, width=2.0188679)
(note: file covid_primary_care_codes.gph not found)
(file covid_primary_care_codes.gph saved)

                Indicator positive covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,973,424
25%            0              0       Sum of Wgt.    11973424

50%            0                      Mean           .0218226
                        Largest       Std. Dev.      .1461039
75%            0              1
90%            0              1       Variance       .0213464
95%            0              1       Skewness       6.545717
99%            1              1       Kurtosis       43.84641

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |    261,291    1.95e+07    1.42e+07      10043   5.39e+07
(bin=54, start=22159, width=2)
(note: file positive_SGSS.gph not found)
(file positive_SGSS.gph saved)

     Failure/censoring indicator for outcome: non-covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,973,424
25%            0              0       Sum of Wgt.    11973424

50%            0                      Mean           .0021886
                        Largest       Std. Dev.      .0467312
75%            0              1
90%            0              1       Variance       .0021838
95%            0              1       Skewness        21.3053
99%            0              1       Kurtosis       454.9159

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     26,205    2.03e+07    1.30e+07      13126   5.38e+07
(bin=44, start=22160, width=2.4318182)
(note: file non_covid_death.gph not found)
(file non_covid_death.gph saved)

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,973,424
25%            0              0       Sum of Wgt.    11973424

50%            0                      Mean           .0230688
                        Largest       Std. Dev.      .1501219
75%            0              1
90%            0              1       Variance       .0225366
95%            0              1       Skewness       6.353919
99%            1              1       Kurtosis       41.37229

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |    276,212    1.94e+07    1.42e+07      10043   5.45e+07
(bin=54, start=22160, width=1.9814815)
(note: file covid_tpp_prob.gph not found)
(file covid_tpp_prob.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,973,424
25%            0              0       Sum of Wgt.    11973424

50%            0                      Mean           .0006595
                        Largest       Std. Dev.      .0256715
75%            0              1
90%            0              1       Variance        .000659
95%            0              1       Skewness       38.90234
99%            0              1       Kurtosis       1514.392

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      7,896    1.81e+07    1.30e+07      10297   5.37e+07
(bin=38, start=22159, width=2.3684211)
(note: file covidadmission.gph not found)
(file covidadmission.gph saved)

     Failure/censoring indicator for outcome: covid icu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,973,424
25%            0              0       Sum of Wgt.    11973424

50%            0                      Mean           .0001575
                        Largest       Std. Dev.      .0125495
75%            0              1
90%            0              1       Variance       .0001575
95%            0              1       Skewness       79.65916
99%            0              1       Kurtosis       6346.581

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      1,886    1.97e+07    1.35e+07      31932   5.26e+07
(bin=32, start=22159, width=3.375)
(note: file covid_icu.gph not found)
(file covid_icu.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,973,424
25%            0              0       Sum of Wgt.    11973424

50%            0                      Mean           .0003925
                        Largest       Std. Dev.      .0198065
75%            0              1
90%            0              1       Variance       .0003923
95%            0              1       Skewness       50.44878
99%            0              1       Kurtosis        2546.08

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      4,699    1.74e+07    1.23e+07      13326   5.38e+07
(bin=36, start=22160, width=2.9722222)
(note: file covid_death.gph not found)
(file covid_death.gph saved)

. 
. * Combine histograms
. graph combine covid_tpp_prob.gph covidadmission.gph covid_icu.gph covid_death
> .gph non_covid_death.gph  , graphregion(color(white))

. graph export "output/01_histogram_outcomes_`dataset'.svg", as(svg) replace 
(note: file output/01_histogram_outcomes_W2.svg not found)
(file output/01_histogram_outcomes_W2.svg written in SVG format)

. 
. * Combine infection histograms
. graph combine covid_primary_care_codes.gph positive_SGSS.gph, graphregion(col
> or(white))

. graph export "output/01_histogram_infection_outcomes_`dataset'.svg", as(svg) 
> replace 
(note: file output/01_histogram_infection_outcomes_W2.svg not found)
(file output/01_histogram_infection_outcomes_W2.svg written in SVG format)

. 
. *censor dates
. summ dereg_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dereg_date | 11,973,424   08may9882    351191.3  15sep2020  15dec9999

. summ has_12_m

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_12_m_f~p | 11,973,424    .9508562    .2161681          0          1

. 
. 
. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. *HH variables
. safetab kids_cat4 tot_adults_hh
0

 Exposure (v2) |    Total number adults in hh
   with 4-cats |         1          2          3 |     Total
---------------+---------------------------------+----------
          none | 2,672,047  3,395,658  2,375,327 | 8,443,032 
only <12 years |   291,769  1,049,627    552,042 | 1,893,438 
    only 12-18 |   102,740    361,671    460,611 |   925,022 
         mixed |    78,852    356,640    276,440 |   711,932 
---------------+---------------------------------+----------
         Total | 3,145,408  5,163,596  3,664,420 |11,973,424 

. safetab number_kids tot_adults_hh
0

**TABLE OF number_kids tot_adults_hh REDACTED DUE TO SMALL N**


. safetab household_size tot_adults_hh
0

    Number |
 people in |    Total number adults in hh
 household |         1          2          3 |     Total
-----------+---------------------------------+----------
         1 | 2,604,486          0          0 | 2,604,486 
         2 |   299,105  3,333,581          0 | 3,632,686 
         3 |   170,274    751,242  1,308,319 | 2,229,835 
         4 |    51,821    775,182  1,020,255 | 1,847,258 
         5 |    14,393    224,246    606,349 |   844,988 
         6 |     3,751     58,210    348,109 |   410,070 
         7 |     1,117     15,216    196,304 |   212,637 
         8 |       330      4,462    115,097 |   119,889 
         9 |       131      1,457     69,987 |    71,575 
-----------+---------------------------------+----------
     Total | 3,145,408  5,163,596  3,664,420 |11,973,424 

. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    221,934    17.44152    .8212175         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |  3,616,636    22.37257      1.7081       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |  3,483,878    27.26611    1.413072         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |  1,742,202    32.07928    1.416587         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    669,832    37.04931    1.406506         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    338,229    43.39568    2.643309         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |   221,934          0          0          0 |   221,934 
  Normal (18.5-24.9) | 3,616,636          0          0          0 | 3,616,636 
Overweight (25-29.9) | 3,483,878          0          0          0 | 3,483,878 
   Obese I (30-34.9) |         0  1,742,202          0          0 | 1,742,202 
  Obese II (35-39.9) |         0          0    669,832          0 |   669,832 
     Obese III (40+) |         0          0          0    338,229 |   338,229 
        Unknown (.u) | 1,900,713          0          0          0 | 1,900,713 
---------------------+--------------------------------------------+----------
               Total | 9,223,161  1,742,202    669,832    338,229 |11,973,424 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  1,912,652    24.17282    3.390559         18         29

-------------------------------------------------------------------------------
-> agegroup = 30-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  2,222,046    34.48748    2.852634         30         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  2,021,030    44.48414    2.929154         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  2,064,172    54.44299    2.851611         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  1,679,046    64.31712    2.883926         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  1,375,657    73.97829    2.735384         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    698,821    84.95224    4.200353         80        109


. safetab agegroup age66, m
15

   Grouped |  66 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,912,652          0 | 1,912,652 
    30-<40 | 2,222,046          0 | 2,222,046 
    40-<50 | 2,021,030          0 | 2,021,030 
    50-<60 | 2,064,172          0 | 2,064,172 
    60-<70 | 1,208,227    470,819 | 1,679,046 
    70-<80 |         0  1,375,657 | 1,375,657 
       80+ |         0    698,821 |   698,821 
-----------+----------------------+----------
     Total | 9,428,127  2,545,297 |11,973,424 

. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never | 5,524,958          0          0 | 5,524,958 
      Former |         0  4,081,724          0 | 4,081,724 
     Current |         0          0  2,089,221 | 2,089,221 
Unknown (.u) |   277,521          0          0 |   277,521 
-------------+---------------------------------+----------
       Total | 5,802,479  4,081,724  2,089,221 |11,973,424 

. 
. * Diabetes
. *safetab diabcat diabetes, m
. 
. * CKD
. safetab reduced egfr_cat, m
17

       Reduced kidney |               Calculated eGFR
             function |         0         15         30         45 |     Total
----------------------+--------------------------------------------+----------
                 None |         0          0          0          0 |11,267,897 
Stage 3a/3b egfr 30-6 |         0          0    159,873    496,338 |   656,211 
    Stage 4/5 egfr<30 |     9,781     39,535          0          0 |    49,316 
----------------------+--------------------------------------------+----------
                Total |     9,781     39,535    159,873    496,338 |11,973,424 


       Reduced kidney |    Calculated eGFR
             function |        60          . |     Total
----------------------+----------------------+----------
                 None | 8,447,498  2,820,399 |11,267,897 
Stage 3a/3b egfr 30-6 |         0          0 |   656,211 
    Stage 4/5 egfr<30 |         0          0 |    49,316 
----------------------+----------------------+----------
                Total | 8,447,498  2,820,399 |11,973,424 

. * CKD
. safetab reduced esrd, m
13

                      |    End-stage renal
       Reduced kidney |        disease
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,263,114      4,783 |11,267,897 
Stage 3a/3b egfr 30-6 |   651,643      4,568 |   656,211 
    Stage 4/5 egfr<30 |    41,595      7,721 |    49,316 
----------------------+----------------------+----------
                Total |11,956,352     17,072 |11,973,424 

. 
. /* EXPECTED RELATIONSHIPS====================================================
> =*/ 
. 
. /*  Relationships between demographic/lifestyle variables  */
. safetab agegroup bmicat,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                      Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II  |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |    79,621    681,762    303,990    133,592     60,376 | 1,294,971 
           |      6.15      52.65      23.47      10.32       4.66 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |    45,265    769,975    539,916    243,261    101,831 | 1,759,739 
           |      2.57      43.76      30.68      13.82       5.79 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |    23,359    585,329    598,163    296,270    117,558 | 1,684,459 
           |      1.39      34.75      35.51      17.59       6.98 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |    18,364    519,738    683,698    380,493    151,995 | 1,833,474 
           |      1.00      28.35      37.29      20.75       8.29 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |    18,153    433,809    590,371    325,505    123,582 | 1,549,467 
           |      1.17      28.00      38.10      21.01       7.98 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |    18,791    385,817    516,612    258,799     86,405 | 1,300,458 
           |      1.44      29.67      39.73      19.90       6.64 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |    18,381    240,206    251,128    104,282     28,085 |   650,143 
           |      2.83      36.95      38.63      16.04       4.32 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |   221,934  3,616,636  3,483,878  1,742,202    669,832 |10,072,711 
           |      2.20      35.91      34.59      17.30       6.65 |    100.00 


           |  Grouped
   Grouped |    BMI
       age | Obese III |     Total
-----------+-----------+----------
    18-<30 |    35,630 | 1,294,971 
           |      2.75 |    100.00 
-----------+-----------+----------
    30-<40 |    59,491 | 1,759,739 
           |      3.38 |    100.00 
-----------+-----------+----------
    40-<50 |    63,780 | 1,684,459 
           |      3.79 |    100.00 
-----------+-----------+----------
    50-<60 |    79,186 | 1,833,474 
           |      4.32 |    100.00 
-----------+-----------+----------
    60-<70 |    58,047 | 1,549,467 
           |      3.75 |    100.00 
-----------+-----------+----------
    70-<80 |    34,034 | 1,300,458 
           |      2.62 |    100.00 
-----------+-----------+----------
       80+ |     8,061 |   650,143 
           |      1.24 |    100.00 
-----------+-----------+----------
     Total |   338,229 |10,072,711 
           |      3.36 |    100.00 

. safetab agegroup smoke,         row  
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Smoking status
       age |     Never     Former    Current |     Total
-----------+---------------------------------+----------
    18-<30 | 1,080,209    266,134    379,862 | 1,726,205 
           |     62.58      15.42      22.01 |    100.00 
-----------+---------------------------------+----------
    30-<40 | 1,072,708    590,883    514,405 | 2,177,996 
           |     49.25      27.13      23.62 |    100.00 
-----------+---------------------------------+----------
    40-<50 |   905,879    667,431    424,425 | 1,997,735 
           |     45.35      33.41      21.25 |    100.00 
-----------+---------------------------------+----------
    50-<60 |   929,892    730,082    391,340 | 2,051,314 
           |     45.33      35.59      19.08 |    100.00 
-----------+---------------------------------+----------
    60-<70 |   721,802    718,554    232,192 | 1,672,548 
           |     43.16      42.96      13.88 |    100.00 
-----------+---------------------------------+----------
    70-<80 |   525,064    730,362    117,292 | 1,372,718 
           |     38.25      53.21       8.54 |    100.00 
-----------+---------------------------------+----------
       80+ |   289,404    378,278     29,705 |   697,387 
           |     41.50      54.24       4.26 |    100.00 
-----------+---------------------------------+----------
     Total | 5,524,958  4,081,724  2,089,221 |11,695,903 
           |     47.24      34.90      17.86 |    100.00 

. safetab agegroup ethnicity, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                       Ethnicity
       age |     White      Mixed  Asian or       Black      Other |     Total
-----------+-------------------------------------------------------+----------
    18-<30 | 1,512,433     50,890    187,377     71,890     90,062 | 1,912,652 
           |     79.08       2.66       9.80       3.76       4.71 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 | 1,758,549     45,631    258,568     74,434     84,864 | 2,222,046 
           |     79.14       2.05      11.64       3.35       3.82 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 | 1,626,504     33,807    215,995     78,707     66,017 | 2,021,030 
           |     80.48       1.67      10.69       3.89       3.27 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 | 1,817,705     23,118    120,648     64,227     38,474 | 2,064,172 
           |     88.06       1.12       5.84       3.11       1.86 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 | 1,535,985     10,631     82,838     28,014     21,578 | 1,679,046 
           |     91.48       0.63       4.93       1.67       1.29 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 | 1,307,235      4,730     41,191     11,864     10,637 | 1,375,657 
           |     95.03       0.34       2.99       0.86       0.77 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |   661,260      2,374     21,850      8,803      4,534 |   698,821 
           |     94.63       0.34       3.13       1.26       0.65 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |10,219,671    171,181    928,467    337,939    316,166 |11,973,424 
           |     85.35       1.43       7.75       2.82       2.64 |    100.00 

. safetab agegroup imd,           row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Index of Multiple Deprivation (IMD)
       age | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |   297,123    339,597    394,637    452,565    428,730 | 1,912,652 
           |     15.53      17.76      20.63      23.66      22.42 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |   363,490    416,500    456,587    511,302    474,167 | 2,222,046 
           |     16.36      18.74      20.55      23.01      21.34 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |   411,064    408,878    405,601    418,232    377,255 | 2,021,030 
           |     20.34      20.23      20.07      20.69      18.67 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |   439,157    440,928    422,212    410,472    351,403 | 2,064,172 
           |     21.28      21.36      20.45      19.89      17.02 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |   378,781    375,301    353,334    318,945    252,685 | 1,679,046 
           |     22.56      22.35      21.04      19.00      15.05 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |   346,145    327,082    292,668    240,375    169,387 | 1,375,657 
           |     25.16      23.78      21.27      17.47      12.31 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |   174,784    165,237    147,992    122,709     88,099 |   698,821 
           |     25.01      23.65      21.18      17.56      12.61 |    100.00 
-----------+-------------------------------------------------------+----------
     Total | 2,410,544  2,473,523  2,473,031  2,474,600  2,141,726 |11,973,424 
           |     20.13      20.66      20.65      20.67      17.89 |    100.00 

. safetab agegroup shield,    row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Probable shielding
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,517,432    395,220 | 1,912,652 
           |     79.34      20.66 |    100.00 
-----------+----------------------+----------
    30-<40 | 1,791,934    430,112 | 2,222,046 
           |     80.64      19.36 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,628,173    392,857 | 2,021,030 
           |     80.56      19.44 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,607,948    456,224 | 2,064,172 
           |     77.90      22.10 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,221,259    457,787 | 1,679,046 
           |     72.74      27.26 |    100.00 
-----------+----------------------+----------
    70-<80 |   896,634    479,023 | 1,375,657 
           |     65.18      34.82 |    100.00 
-----------+----------------------+----------
       80+ |   423,680    275,141 |   698,821 
           |     60.63      39.37 |    100.00 
-----------+----------------------+----------
     Total | 9,087,060  2,886,364 |11,973,424 
           |     75.89      24.11 |    100.00 

. 
. safetab bmicat smoke,            row   
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |          Smoking status
         Grouped BMI |     Never     Former    Current |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |   106,692     49,244     62,665 |   218,601 
                     |     48.81      22.53      28.67 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) | 1,780,850  1,128,515    687,873 | 3,597,238 
                     |     49.51      31.37      19.12 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,568,435  1,366,260    539,293 | 3,473,988 
                     |     45.15      39.33      15.52 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   740,684    732,643    264,653 | 1,737,980 
                     |     42.62      42.15      15.23 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   281,834    282,835    103,412 |   668,081 
                     |     42.19      42.34      15.48 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |   142,340    142,136     52,809 |   337,285 
                     |     42.20      42.14      15.66 |    100.00 
---------------------+---------------------------------+----------
               Total | 4,620,835  3,701,633  1,710,705 |10,033,173 
                     |     46.06      36.89      17.05 |    100.00 

. safetab bmicat ethnicity,        row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |                  Ethnicity
         Grouped BMI |     White      Mixed  Asian or       Black |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |   177,028      3,969     23,854      4,963 |   221,934 
                     |     79.77       1.79      10.75       2.24 |    100.00 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) | 3,073,530     54,562    286,991     81,137 | 3,616,636 
                     |     84.98       1.51       7.94       2.24 |    100.00 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) | 2,996,754     42,914    276,895     96,006 | 3,483,878 
                     |     86.02       1.23       7.95       2.76 |    100.00 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) | 1,525,373     20,699    114,289     54,530 | 1,742,202 
                     |     87.55       1.19       6.56       3.13 |    100.00 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |   597,306      7,875     34,952     21,316 |   669,832 
                     |     89.17       1.18       5.22       3.18 |    100.00 
---------------------+--------------------------------------------+----------
     Obese III (40+) |   306,817      4,152     13,377     10,321 |   338,229 
                     |     90.71       1.23       3.96       3.05 |    100.00 
---------------------+--------------------------------------------+----------
               Total | 8,676,808    134,171    750,358    268,273 |10,072,711 
                     |     86.14       1.33       7.45       2.66 |    100.00 


                     | Ethnicity
         Grouped BMI |     Other |     Total
---------------------+-----------+----------
 Underweight (<18.5) |    12,120 |   221,934 
                     |      5.46 |    100.00 
---------------------+-----------+----------
  Normal (18.5-24.9) |   120,416 | 3,616,636 
                     |      3.33 |    100.00 
---------------------+-----------+----------
Overweight (25-29.9) |    71,309 | 3,483,878 
                     |      2.05 |    100.00 
---------------------+-----------+----------
   Obese I (30-34.9) |    27,311 | 1,742,202 
                     |      1.57 |    100.00 
---------------------+-----------+----------
  Obese II (35-39.9) |     8,383 |   669,832 
                     |      1.25 |    100.00 
---------------------+-----------+----------
     Obese III (40+) |     3,562 |   338,229 
                     |      1.05 |    100.00 
---------------------+-----------+----------
               Total |   243,101 |10,072,711 
                     |      2.41 |    100.00 

. safetab bmicat imd,              row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |     Index of Multiple Deprivation (IMD)
         Grouped BMI | 1 least d          2          3          4 |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |    37,746     41,913     45,431     49,521 |   221,934 
                     |     17.01      18.89      20.47      22.31 |    100.00 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |   804,238    789,924    755,156    710,181 | 3,616,636 
                     |     22.24      21.84      20.88      19.64 |    100.00 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |   751,472    748,252    723,857    694,792 | 3,483,878 
                     |     21.57      21.48      20.78      19.94 |    100.00 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |   321,962    346,137    358,796    374,929 | 1,742,202 
                     |     18.48      19.87      20.59      21.52 |    100.00 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |   104,990    123,173    135,522    152,991 |   669,832 
                     |     15.67      18.39      20.23      22.84 |    100.00 
---------------------+--------------------------------------------+----------
     Obese III (40+) |    45,659     56,767     66,431     80,649 |   338,229 
                     |     13.50      16.78      19.64      23.84 |    100.00 
---------------------+--------------------------------------------+----------
               Total | 2,066,067  2,106,166  2,085,193  2,063,063 |10,072,711 
                     |     20.51      20.91      20.70      20.48 |    100.00 


                     |  Index of
                     |  Multiple
                     | Deprivatio
                     |  n (IMD)
         Grouped BMI | 5 most de |     Total
---------------------+-----------+----------
 Underweight (<18.5) |    47,323 |   221,934 
                     |     21.32 |    100.00 
---------------------+-----------+----------
  Normal (18.5-24.9) |   557,137 | 3,616,636 
                     |     15.40 |    100.00 
---------------------+-----------+----------
Overweight (25-29.9) |   565,505 | 3,483,878 
                     |     16.23 |    100.00 
---------------------+-----------+----------
   Obese I (30-34.9) |   340,378 | 1,742,202 
                     |     19.54 |    100.00 
---------------------+-----------+----------
  Obese II (35-39.9) |   153,156 |   669,832 
                     |     22.86 |    100.00 
---------------------+-----------+----------
     Obese III (40+) |    88,723 |   338,229 
                     |     26.23 |    100.00 
---------------------+-----------+----------
               Total | 1,752,222 |10,072,711 
                     |     17.40 |    100.00 

. safetab bmicat hypertension, row 
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |       Diagnosed
                     |     hypertension
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   197,285     24,649 |   221,934 
                     |     88.89      11.11 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,099,346    517,290 | 3,616,636 
                     |     85.70      14.30 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,607,048    876,830 | 3,483,878 
                     |     74.83      25.17 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,158,467    583,735 | 1,742,202 
                     |     66.49      33.51 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |   418,688    251,144 |   669,832 
                     |     62.51      37.49 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |   205,834    132,395 |   338,229 
                     |     60.86      39.14 |    100.00 
---------------------+----------------------+----------
               Total | 7,686,668  2,386,043 |10,072,711 
                     |     76.31      23.69 |    100.00 

. safetab bmicat shield,    row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Probable shielding
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   164,024     57,910 |   221,934 
                     |     73.91      26.09 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 2,775,247    841,389 | 3,616,636 
                     |     76.74      23.26 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,601,309    882,569 | 3,483,878 
                     |     74.67      25.33 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,254,319    487,883 | 1,742,202 
                     |     72.00      28.00 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |   461,894    207,938 |   669,832 
                     |     68.96      31.04 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |   222,943    115,286 |   338,229 
                     |     65.91      34.09 |    100.00 
---------------------+----------------------+----------
               Total | 7,479,736  2,592,975 |10,072,711 
                     |     74.26      25.74 |    100.00 

. 
.                             
. safetab smoke ethnicity,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |                  Ethnicity
      status |     White      Mixed  Asian or       Black |     Total
-------------+--------------------------------------------+----------
       Never | 4,382,649     89,383    645,698    218,225 | 5,524,958 
             |     79.32       1.62      11.69       3.95 |    100.00 
-------------+--------------------------------------------+----------
      Former | 3,776,537     40,027    144,786     62,337 | 4,081,724 
             |     92.52       0.98       3.55       1.53 |    100.00 
-------------+--------------------------------------------+----------
     Current | 1,857,157     34,418    101,259     43,712 | 2,089,221 
             |     88.89       1.65       4.85       2.09 |    100.00 
-------------+--------------------------------------------+----------
       Total |10,016,343    163,828    891,743    324,274 |11,695,903 
             |     85.64       1.40       7.62       2.77 |    100.00 


     Smoking | Ethnicity
      status |     Other |     Total
-------------+-----------+----------
       Never |   189,003 | 5,524,958 
             |      3.42 |    100.00 
-------------+-----------+----------
      Former |    58,037 | 4,081,724 
             |      1.42 |    100.00 
-------------+-----------+----------
     Current |    52,675 | 2,089,221 
             |      2.52 |    100.00 
-------------+-----------+----------
       Total |   299,715 |11,695,903 
             |      2.56 |    100.00 

. safetab smoke imd,                      row 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |     Index of Multiple Deprivation (IMD)
      status | 1 least d          2          3          4 |     Total
-------------+--------------------------------------------+----------
       Never | 1,255,075  1,206,337  1,147,759  1,086,211 | 5,524,958 
             |     22.72      21.83      20.77      19.66 |    100.00 
-------------+--------------------------------------------+----------
      Former |   883,756    900,209    866,453    798,245 | 4,081,724 
             |     21.65      22.05      21.23      19.56 |    100.00 
-------------+--------------------------------------------+----------
     Current |   230,511    318,340    403,082    524,958 | 2,089,221 
             |     11.03      15.24      19.29      25.13 |    100.00 
-------------+--------------------------------------------+----------
       Total | 2,369,342  2,424,886  2,417,294  2,409,414 |11,695,903 
             |     20.26      20.73      20.67      20.60 |    100.00 


             |  Index of
             |  Multiple
             | Deprivatio
     Smoking |  n (IMD)
      status | 5 most de |     Total
-------------+-----------+----------
       Never |   829,576 | 5,524,958 
             |     15.02 |    100.00 
-------------+-----------+----------
      Former |   633,061 | 4,081,724 
             |     15.51 |    100.00 
-------------+-----------+----------
     Current |   612,330 | 2,089,221 
             |     29.31 |    100.00 
-------------+-----------+----------
       Total | 2,074,967 |11,695,903 
             |     17.74 |    100.00 

. safetab smoke hypertension, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,515,849  1,009,109 | 5,524,958 
             |     81.74      18.26 |    100.00 
-------------+----------------------+----------
      Former | 2,861,275  1,220,449 | 4,081,724 
             |     70.10      29.90 |    100.00 
-------------+----------------------+----------
     Current | 1,802,341    286,880 | 2,089,221 
             |     86.27      13.73 |    100.00 
-------------+----------------------+----------
       Total | 9,179,465  2,516,438 |11,695,903 
             |     78.48      21.52 |    100.00 

. safetab smoke shield,    row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Probable shielding
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,368,769  1,156,189 | 5,524,958 
             |     79.07      20.93 |    100.00 
-------------+----------------------+----------
      Former | 2,879,679  1,202,045 | 4,081,724 
             |     70.55      29.45 |    100.00 
-------------+----------------------+----------
     Current | 1,576,903    512,318 | 2,089,221 
             |     75.48      24.52 |    100.00 
-------------+----------------------+----------
       Total | 8,825,351  2,870,552 |11,695,903 
             |     75.46      24.54 |    100.00 

.                       
. safetab ethnicity imd,          row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |     Index of Multiple Deprivation (IMD)
            Ethnicity | 1 least d          2          3          4 |     Total
----------------------+--------------------------------------------+----------
                White | 2,232,639  2,235,678  2,128,960  1,987,755 |10,219,671 
                      |     21.85      21.88      20.83      19.45 |    100.00 
----------------------+--------------------------------------------+----------
                Mixed |    23,228     28,489     34,249     41,417 |   171,181 
                      |     13.57      16.64      20.01      24.19 |    100.00 
----------------------+--------------------------------------------+----------
Asian or Asian Britis |    88,195    117,644    186,044    271,586 |   928,467 
                      |      9.50      12.67      20.04      29.25 |    100.00 
----------------------+--------------------------------------------+----------
                Black |    23,937     36,906     58,663     93,216 |   337,939 
                      |      7.08      10.92      17.36      27.58 |    100.00 
----------------------+--------------------------------------------+----------
                Other |    42,545     54,806     65,115     80,626 |   316,166 
                      |     13.46      17.33      20.60      25.50 |    100.00 
----------------------+--------------------------------------------+----------
                Total | 2,410,544  2,473,523  2,473,031  2,474,600 |11,973,424 
                      |     20.13      20.66      20.65      20.67 |    100.00 


                      |  Index of
                      |  Multiple
                      | Deprivatio
                      |  n (IMD)
            Ethnicity | 5 most de |     Total
----------------------+-----------+----------
                White | 1,634,639 |10,219,671 
                      |     16.00 |    100.00 
----------------------+-----------+----------
                Mixed |    43,798 |   171,181 
                      |     25.59 |    100.00 
----------------------+-----------+----------
Asian or Asian Britis |   264,998 |   928,467 
                      |     28.54 |    100.00 
----------------------+-----------+----------
                Black |   125,217 |   337,939 
                      |     37.05 |    100.00 
----------------------+-----------+----------
                Other |    73,074 |   316,166 
                      |     23.11 |    100.00 
----------------------+-----------+----------
                Total | 2,141,726 |11,973,424 
                      |     17.89 |    100.00 

. safetab shield imd,             row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |          Index of Multiple Deprivation (IMD)
 shielding | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
         0 | 1,817,267  1,871,745  1,882,517  1,895,432  1,620,099 | 9,087,060 
           |     20.00      20.60      20.72      20.86      17.83 |    100.00 
-----------+-------------------------------------------------------+----------
         1 |   593,277    601,778    590,514    579,168    521,627 | 2,886,364 
           |     20.55      20.85      20.46      20.07      18.07 |    100.00 
-----------+-------------------------------------------------------+----------
     Total | 2,410,544  2,473,523  2,473,031  2,474,600  2,141,726 |11,973,424 
           |     20.13      20.66      20.65      20.67      17.89 |    100.00 

. 
. safetab shield ethnicity,               row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |                       Ethnicity
 shielding |     White      Mixed  Asian or       Black      Other |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,597,393    137,704    787,276    280,723    283,964 | 9,087,060 
           |     83.61       1.52       8.66       3.09       3.12 |    100.00 
-----------+-------------------------------------------------------+----------
         1 | 2,622,278     33,477    141,191     57,216     32,202 | 2,886,364 
           |     90.85       1.16       4.89       1.98       1.12 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |10,219,671    171,181    928,467    337,939    316,166 |11,973,424 
           |     85.35       1.43       7.75       2.82       2.64 |    100.00 

. 
. 
. 
. * Relationships with age
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>                    ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension            ///          
>    
>                                                                              
>    {
  2. 
.                 
.         safetab agegroup `var', row 
  3.  }
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Asthma category
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,530,926    381,726 | 1,912,652 
           |     80.04      19.96 |    100.00 
-----------+----------------------+----------
    30-<40 | 1,820,668    401,378 | 2,222,046 
           |     81.94      18.06 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,685,409    335,621 | 2,021,030 
           |     83.39      16.61 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,740,413    323,759 | 2,064,172 
           |     84.32      15.68 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,436,673    242,373 | 1,679,046 
           |     85.56      14.44 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,190,494    185,163 | 1,375,657 
           |     86.54      13.46 |    100.00 
-----------+----------------------+----------
       80+ |   606,636     92,185 |   698,821 
           |     86.81      13.19 |    100.00 
-----------+----------------------+----------
     Total |10,011,219  1,962,205 |11,973,424 
           |     83.61      16.39 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,906,305      6,347 | 1,912,652 
           |     99.67       0.33 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,211,764     10,282 | 2,222,046 
           |     99.54       0.46 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,995,316     25,714 | 2,021,030 
           |     98.73       1.27 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,990,919     73,253 | 2,064,172 
           |     96.45       3.55 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,551,451    127,595 | 1,679,046 
           |     92.40       7.60 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,208,182    167,475 | 1,375,657 
           |     87.83      12.17 |    100.00 
-----------+----------------------+----------
       80+ |   599,440     99,381 |   698,821 
           |     85.78      14.22 |    100.00 
-----------+----------------------+----------
     Total |11,463,377    510,047 |11,973,424 
           |     95.74       4.26 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,899,760     12,892 | 1,912,652 
           |     99.33       0.67 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,205,295     16,751 | 2,222,046 
           |     99.25       0.75 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,986,212     34,818 | 2,021,030 
           |     98.28       1.72 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,963,993    100,179 | 2,064,172 
           |     95.15       4.85 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,504,878    174,168 | 1,679,046 
           |     89.63      10.37 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,123,182    252,475 | 1,375,657 
           |     81.65      18.35 |    100.00 
-----------+----------------------+----------
       80+ |   477,878    220,943 |   698,821 
           |     68.38      31.62 |    100.00 
-----------+----------------------+----------
     Total |11,161,198    812,226 |11,973,424 
           |     93.22       6.78 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                        Diabetes
       age | No diabet  T1DM, con  T1DM, unc  T2DM, con  T2DM, unc |     Total
-----------+-------------------------------------------------------+----------
    18-<30 | 1,897,184      2,493      8,051      2,336      1,899 | 1,912,652 
           |     99.19       0.13       0.42       0.12       0.10 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 | 2,185,247      3,417      8,420     12,959     11,216 | 2,222,046 
           |     98.34       0.15       0.38       0.58       0.50 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 | 1,933,646      3,026      8,437     40,001     35,059 | 2,021,030 
           |     95.68       0.15       0.42       1.98       1.73 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 | 1,885,147      3,115      9,206     89,986     75,608 | 2,064,172 
           |     91.33       0.15       0.45       4.36       3.66 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 | 1,446,316      2,711      6,051    135,117     87,812 | 1,679,046 
           |     86.14       0.16       0.36       8.05       5.23 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 | 1,136,006      1,897      3,663    159,987     73,242 | 1,375,657 
           |     82.58       0.14       0.27      11.63       5.32 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |   550,182        791      1,633    105,151     40,541 |   698,821 
           |     78.73       0.11       0.23      15.05       5.80 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |11,033,728     17,450     45,461    545,537    325,377 |11,973,424 
           |     92.15       0.15       0.38       4.56       2.72 |    100.00 


   Grouped |  Diabetes
       age | Diabetes, |     Total
-----------+-----------+----------
    18-<30 |       689 | 1,912,652 
           |      0.04 |    100.00 
-----------+-----------+----------
    30-<40 |       787 | 2,222,046 
           |      0.04 |    100.00 
-----------+-----------+----------
    40-<50 |       861 | 2,021,030 
           |      0.04 |    100.00 
-----------+-----------+----------
    50-<60 |     1,110 | 2,064,172 
           |      0.05 |    100.00 
-----------+-----------+----------
    60-<70 |     1,039 | 1,679,046 
           |      0.06 |    100.00 
-----------+-----------+----------
    70-<80 |       862 | 1,375,657 
           |      0.06 |    100.00 
-----------+-----------+----------
       80+ |       523 |   698,821 
           |      0.07 |    100.00 
-----------+-----------+----------
     Total |     5,871 |11,973,424 
           |      0.05 |    100.00 
31

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Chronic liver disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,910,693      1,959 | 1,912,652 
           |     99.90       0.10 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,215,023      7,023 | 2,222,046 
           |     99.68       0.32 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,008,342     12,688 | 2,021,030 
           |     99.37       0.63 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,045,484     18,688 | 2,064,172 
           |     99.09       0.91 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,660,151     18,895 | 1,679,046 
           |     98.87       1.13 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,361,908     13,749 | 1,375,657 
           |     99.00       1.00 |    100.00 
-----------+----------------------+----------
       80+ |   694,155      4,666 |   698,821 
           |     99.33       0.67 |    100.00 
-----------+----------------------+----------
     Total |11,895,756     77,668 |11,973,424 
           |     99.35       0.65 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Neurological disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,905,229      7,423 | 1,912,652 
           |     99.61       0.39 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,211,549     10,497 | 2,222,046 
           |     99.53       0.47 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,007,878     13,152 | 2,021,030 
           |     99.35       0.65 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,044,364     19,808 | 2,064,172 
           |     99.04       0.96 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,656,512     22,534 | 1,679,046 
           |     98.66       1.34 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,349,421     26,236 | 1,375,657 
           |     98.09       1.91 |    100.00 
-----------+----------------------+----------
       80+ |   683,044     15,777 |   698,821 
           |     97.74       2.26 |    100.00 
-----------+----------------------+----------
     Total |11,857,997    115,427 |11,973,424 
           |     99.04       0.96 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Stroke or dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,910,492      2,160 | 1,912,652 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,217,452      4,594 | 2,222,046 
           |     99.79       0.21 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,010,518     10,512 | 2,021,030 
           |     99.48       0.52 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,035,938     28,234 | 2,064,172 
           |     98.63       1.37 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,629,713     49,333 | 1,679,046 
           |     97.06       2.94 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,294,661     80,996 | 1,375,657 
           |     94.11       5.89 |    100.00 
-----------+----------------------+----------
       80+ |   611,419     87,402 |   698,821 
           |     87.49      12.51 |    100.00 
-----------+----------------------+----------
     Total |11,710,193    263,231 |11,973,424 
           |     97.80       2.20 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Autoimmune disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,869,823     42,829 | 1,912,652 
           |     97.76       2.24 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,141,576     80,470 | 2,222,046 
           |     96.38       3.62 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,926,217     94,813 | 2,021,030 
           |     95.31       4.69 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,941,259    122,913 | 2,064,172 
           |     94.05       5.95 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,560,281    118,765 | 1,679,046 
           |     92.93       7.07 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,267,199    108,458 | 1,375,657 
           |     92.12       7.88 |    100.00 
-----------+----------------------+----------
       80+ |   645,587     53,234 |   698,821 
           |     92.38       7.62 |    100.00 
-----------+----------------------+----------
     Total |11,351,942    621,482 |11,973,424 
           |     94.81       5.19 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
   Grouped |      algorithm)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,908,380      4,272 | 1,912,652 
           |     99.78       0.22 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,215,526      6,520 | 2,222,046 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,011,557      9,473 | 2,021,030 
           |     99.53       0.47 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,054,691      9,481 | 2,064,172 
           |     99.54       0.46 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,673,873      5,173 | 1,679,046 
           |     99.69       0.31 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,372,849      2,808 | 1,375,657 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
       80+ |   697,652      1,169 |   698,821 
           |     99.83       0.17 |    100.00 
-----------+----------------------+----------
     Total |11,934,528     38,896 |11,973,424 
           |     99.68       0.32 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
   Grouped |      transplant
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,912,440        212 | 1,912,652 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,221,724        322 | 2,222,046 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,020,556        474 | 2,021,030 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,063,491        681 | 2,064,172 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,678,314        732 | 1,679,046 
           |     99.96       0.04 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,375,234        423 | 1,375,657 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
       80+ |   698,691        130 |   698,821 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
     Total |11,970,450      2,974 |11,973,424 
           |     99.98       0.02 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Asplenia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,911,936        716 | 1,912,652 
           |     99.96       0.04 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,220,481      1,565 | 2,222,046 
           |     99.93       0.07 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,018,690      2,340 | 2,021,030 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,060,251      3,921 | 2,064,172 
           |     99.81       0.19 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,675,182      3,864 | 1,679,046 
           |     99.77       0.23 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,372,146      3,511 | 1,375,657 
           |     99.74       0.26 |    100.00 
-----------+----------------------+----------
       80+ |   697,216      1,605 |   698,821 
           |     99.77       0.23 |    100.00 
-----------+----------------------+----------
     Total |11,955,902     17,522 |11,973,424 
           |     99.85       0.15 |    100.00 
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Non-haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 | 1,908,819        451      1,268      2,114 | 1,912,652 
           |     99.80       0.02       0.07       0.11 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 | 2,208,276      1,652      4,914      7,204 | 2,222,046 
           |     99.38       0.07       0.22       0.32 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 | 1,990,455      3,469     10,122     16,984 | 2,021,030 
           |     98.49       0.17       0.50       0.84 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 | 1,988,099      8,140     24,779     43,154 | 2,064,172 
           |     96.31       0.39       1.20       2.09 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 | 1,551,014     12,940     38,552     76,540 | 1,679,046 
           |     92.37       0.77       2.30       4.56 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 | 1,188,200     15,201     49,209    123,047 | 1,375,657 
           |     86.37       1.10       3.58       8.94 |    100.00 
-----------+--------------------------------------------+----------
       80+ |   575,076      7,855     25,862     90,028 |   698,821 
           |     82.29       1.12       3.70      12.88 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,409,939     49,708    154,706    359,071 |11,973,424 
           |     95.29       0.42       1.29       3.00 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 | 1,910,192        180        578      1,702 | 1,912,652 
           |     99.87       0.01       0.03       0.09 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 | 2,218,200        254        819      2,773 | 2,222,046 
           |     99.83       0.01       0.04       0.12 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 | 2,015,696        340      1,103      3,891 | 2,021,030 
           |     99.74       0.02       0.05       0.19 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 | 2,054,776        773      2,442      6,181 | 2,064,172 
           |     99.54       0.04       0.12       0.30 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 | 1,665,458      1,290      4,041      8,257 | 1,679,046 
           |     99.19       0.08       0.24       0.49 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 | 1,356,600      1,833      5,678     11,546 | 1,375,657 
           |     98.61       0.13       0.41       0.84 |    100.00 
-----------+--------------------------------------------+----------
       80+ |   686,455      1,061      3,580      7,725 |   698,821 
           |     98.23       0.15       0.51       1.11 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,907,377      5,731     18,241     42,075 |11,973,424 
           |     99.45       0.05       0.15       0.35 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |     Reduced kidney function
       age |      None  Stage 3a/  Stage 4/5 |     Total
-----------+---------------------------------+----------
    18-<30 | 1,911,467        835        350 | 1,912,652 
           |     99.94       0.04       0.02 |    100.00 
-----------+---------------------------------+----------
    30-<40 | 2,217,977      3,152        917 | 2,222,046 
           |     99.82       0.14       0.04 |    100.00 
-----------+---------------------------------+----------
    40-<50 | 2,009,749      9,663      1,618 | 2,021,030 
           |     99.44       0.48       0.08 |    100.00 
-----------+---------------------------------+----------
    50-<60 | 2,024,335     36,487      3,350 | 2,064,172 
           |     98.07       1.77       0.16 |    100.00 
-----------+---------------------------------+----------
    60-<70 | 1,578,680     94,868      5,498 | 1,679,046 
           |     94.02       5.65       0.33 |    100.00 
-----------+---------------------------------+----------
    70-<80 | 1,130,464    233,241     11,952 | 1,375,657 
           |     82.18      16.95       0.87 |    100.00 
-----------+---------------------------------+----------
       80+ |   395,225    277,965     25,631 |   698,821 
           |     56.56      39.78       3.67 |    100.00 
-----------+---------------------------------+----------
     Total |11,267,897    656,211     49,316 |11,973,424 
           |     94.11       5.48       0.41 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
   Grouped |        disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,911,912        740 | 1,912,652 
           |     99.96       0.04 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,220,459      1,587 | 2,222,046 
           |     99.93       0.07 |    100.00 
-----------+----------------------+----------
    40-<50 | 2,018,630      2,400 | 2,021,030 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
    50-<60 | 2,060,382      3,790 | 2,064,172 
           |     99.82       0.18 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,675,269      3,777 | 1,679,046 
           |     99.78       0.22 |    100.00 
-----------+----------------------+----------
    70-<80 | 1,372,463      3,194 | 1,375,657 
           |     99.77       0.23 |    100.00 
-----------+----------------------+----------
       80+ |   697,237      1,584 |   698,821 
           |     99.77       0.23 |    100.00 
-----------+----------------------+----------
     Total |11,956,352     17,072 |11,973,424 
           |     99.86       0.14 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
   Grouped |     hypertension
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,899,579     13,073 | 1,912,652 
           |     99.32       0.68 |    100.00 
-----------+----------------------+----------
    30-<40 | 2,164,377     57,669 | 2,222,046 
           |     97.40       2.60 |    100.00 
-----------+----------------------+----------
    40-<50 | 1,837,581    183,449 | 2,021,030 
           |     90.92       9.08 |    100.00 
-----------+----------------------+----------
    50-<60 | 1,624,783    439,389 | 2,064,172 
           |     78.71      21.29 |    100.00 
-----------+----------------------+----------
    60-<70 | 1,067,770    611,276 | 1,679,046 
           |     63.59      36.41 |    100.00 
-----------+----------------------+----------
    70-<80 |   649,082    726,575 | 1,375,657 
           |     47.18      52.82 |    100.00 
-----------+----------------------+----------
       80+ |   211,598    487,223 |   698,821 
           |     30.28      69.72 |    100.00 
-----------+----------------------+----------
     Total | 9,454,770  2,518,654 |11,973,424 
           |     78.96      21.04 |    100.00 

. 
. 
. *Relationships with sex
. foreach var of varlist asthma                                           ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                     /// 
>    
>                                                                              
>    {
  2.                                                 
.         safetab male `var', row 
  3. }
12

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Asthma category
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,138,841  1,076,252 | 6,215,093 
           |     82.68      17.32 |    100.00 
-----------+----------------------+----------
         1 | 4,872,378    885,953 | 5,758,331 
           |     84.61      15.39 |    100.00 
-----------+----------------------+----------
     Total |10,011,219  1,962,205 |11,973,424 
           |     83.61      16.39 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,961,236    253,857 | 6,215,093 
           |     95.92       4.08 |    100.00 
-----------+----------------------+----------
         1 | 5,502,141    256,190 | 5,758,331 
           |     95.55       4.45 |    100.00 
-----------+----------------------+----------
     Total |11,463,377    510,047 |11,973,424 
           |     95.74       4.26 |    100.00 
29

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,894,988    320,105 | 6,215,093 
           |     94.85       5.15 |    100.00 
-----------+----------------------+----------
         1 | 5,266,210    492,121 | 5,758,331 
           |     91.45       8.55 |    100.00 
-----------+----------------------+----------
     Total |11,161,198    812,226 |11,973,424 
           |     93.22       6.78 |    100.00 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |                        Diabetes
      Male | No diabet  T1DM, con  T1DM, unc  T2DM, con  T2DM, unc |     Total
-----------+-------------------------------------------------------+----------
         0 | 5,799,835      7,404     20,057    249,645    135,515 | 6,215,093 
           |     93.32       0.12       0.32       4.02       2.18 |    100.00 
-----------+-------------------------------------------------------+----------
         1 | 5,233,893     10,046     25,404    295,892    189,862 | 5,758,331 
           |     90.89       0.17       0.44       5.14       3.30 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |11,033,728     17,450     45,461    545,537    325,377 |11,973,424 
           |     92.15       0.15       0.38       4.56       2.72 |    100.00 


           |  Diabetes
      Male | Diabetes, |     Total
-----------+-----------+----------
         0 |     2,637 | 6,215,093 
           |      0.04 |    100.00 
-----------+-----------+----------
         1 |     3,234 | 5,758,331 
           |      0.06 |    100.00 
-----------+-----------+----------
     Total |     5,871 |11,973,424 
           |      0.05 |    100.00 
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Chronic liver disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,181,664     33,429 | 6,215,093 
           |     99.46       0.54 |    100.00 
-----------+----------------------+----------
         1 | 5,714,092     44,239 | 5,758,331 
           |     99.23       0.77 |    100.00 
-----------+----------------------+----------
     Total |11,895,756     77,668 |11,973,424 
           |     99.35       0.65 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neurological disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,154,579     60,514 | 6,215,093 
           |     99.03       0.97 |    100.00 
-----------+----------------------+----------
         1 | 5,703,418     54,913 | 5,758,331 
           |     99.05       0.95 |    100.00 
-----------+----------------------+----------
     Total |11,857,997    115,427 |11,973,424 
           |     99.04       0.96 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Stroke or dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,093,177    121,916 | 6,215,093 
           |     98.04       1.96 |    100.00 
-----------+----------------------+----------
         1 | 5,617,016    141,315 | 5,758,331 
           |     97.55       2.45 |    100.00 
-----------+----------------------+----------
     Total |11,710,193    263,231 |11,973,424 
           |     97.80       2.20 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Autoimmune disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,862,612    352,481 | 6,215,093 
           |     94.33       5.67 |    100.00 
-----------+----------------------+----------
         1 | 5,489,330    269,001 | 5,758,331 
           |     95.33       4.67 |    100.00 
-----------+----------------------+----------
     Total |11,351,942    621,482 |11,973,424 
           |     94.81       5.19 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
           |      algorithm)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,197,352     17,741 | 6,215,093 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
         1 | 5,737,176     21,155 | 5,758,331 
           |     99.63       0.37 |    100.00 
-----------+----------------------+----------
     Total |11,934,528     38,896 |11,973,424 
           |     99.68       0.32 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
           |      transplant
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,213,872      1,221 | 6,215,093 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
         1 | 5,756,578      1,753 | 5,758,331 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
     Total |11,970,450      2,974 |11,973,424 
           |     99.98       0.02 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Asplenia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,207,347      7,746 | 6,215,093 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
         1 | 5,748,555      9,776 | 5,758,331 
           |     99.83       0.17 |    100.00 
-----------+----------------------+----------
     Total |11,955,902     17,522 |11,973,424 
           |     99.85       0.15 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          Non-haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 | 5,891,188     24,574     79,714    219,617 | 6,215,093 
           |     94.79       0.40       1.28       3.53 |    100.00 
-----------+--------------------------------------------+----------
         1 | 5,518,751     25,134     74,992    139,454 | 5,758,331 
           |     95.84       0.44       1.30       2.42 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,409,939     49,708    154,706    359,071 |11,973,424 
           |     95.29       0.42       1.29       3.00 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |            Haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 | 6,185,258      2,500      7,954     19,381 | 6,215,093 
           |     99.52       0.04       0.13       0.31 |    100.00 
-----------+--------------------------------------------+----------
         1 | 5,722,119      3,231     10,287     22,694 | 5,758,331 
           |     99.37       0.06       0.18       0.39 |    100.00 
-----------+--------------------------------------------+----------
     Total |11,907,377      5,731     18,241     42,075 |11,973,424 
           |     99.45       0.05       0.15       0.35 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     Reduced kidney function
      Male |      None  Stage 3a/  Stage 4/5 |     Total
-----------+---------------------------------+----------
         0 | 5,821,741    369,508     23,844 | 6,215,093 
           |     93.67       5.95       0.38 |    100.00 
-----------+---------------------------------+----------
         1 | 5,446,156    286,703     25,472 | 5,758,331 
           |     94.58       4.98       0.44 |    100.00 
-----------+---------------------------------+----------
     Total |11,267,897    656,211     49,316 |11,973,424 
           |     94.11       5.48       0.41 |    100.00 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
           |        disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,208,177      6,916 | 6,215,093 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
         1 | 5,748,175     10,156 | 5,758,331 
           |     99.82       0.18 |    100.00 
-----------+----------------------+----------
     Total |11,956,352     17,072 |11,973,424 
           |     99.86       0.14 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
           |     hypertension
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 4,952,469  1,262,624 | 6,215,093 
           |     79.68      20.32 |    100.00 
-----------+----------------------+----------
         1 | 4,502,301  1,256,030 | 5,758,331 
           |     78.19      21.81 |    100.00 
-----------+----------------------+----------
     Total | 9,454,770  2,518,654 |11,973,424 
           |     78.96      21.04 |    100.00 

. 
. *Relationships with smoking
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                         
>    ///
>                                         {
  2.         
.         safetab smoke `var', row 
  3. }
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |    Asthma category
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,664,969    859,989 | 5,524,958 
             |     84.43      15.57 |    100.00 
-------------+----------------------+----------
      Former | 3,350,711    731,013 | 4,081,724 
             |     82.09      17.91 |    100.00 
-------------+----------------------+----------
     Current | 1,731,608    357,613 | 2,089,221 
             |     82.88      17.12 |    100.00 
-------------+----------------------+----------
       Total | 9,747,288  1,948,615 |11,695,903 
             |     83.34      16.66 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Chronic Respiratory
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,444,386     80,572 | 5,524,958 
             |     98.54       1.46 |    100.00 
-------------+----------------------+----------
      Former | 3,790,700    291,024 | 4,081,724 
             |     92.87       7.13 |    100.00 
-------------+----------------------+----------
     Current | 1,951,204    138,017 | 2,089,221 
             |     93.39       6.61 |    100.00 
-------------+----------------------+----------
       Total |11,186,290    509,613 |11,695,903 
             |     95.64       4.36 |    100.00 
30

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Chronic Cardiac
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,264,662    260,296 | 5,524,958 
             |     95.29       4.71 |    100.00 
-------------+----------------------+----------
      Former | 3,636,976    444,748 | 4,081,724 
             |     89.10      10.90 |    100.00 
-------------+----------------------+----------
     Current | 1,983,632    105,589 | 2,089,221 
             |     94.95       5.05 |    100.00 
-------------+----------------------+----------
       Total |10,885,270    810,633 |11,695,903 
             |     93.07       6.93 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |                  Diabetes
      status | No diabet  T1DM, con  T1DM, unc  T2DM, con |     Total
-------------+--------------------------------------------+----------
       Never | 5,176,919      8,396     17,755    200,564 | 5,524,958 
             |     93.70       0.15       0.32       3.63 |    100.00 
-------------+--------------------------------------------+----------
      Former | 3,620,541      6,968     17,449    276,300 | 4,081,724 
             |     88.70       0.17       0.43       6.77 |    100.00 
-------------+--------------------------------------------+----------
     Current | 1,959,245      2,039     10,171     68,548 | 2,089,221 
             |     93.78       0.10       0.49       3.28 |    100.00 
-------------+--------------------------------------------+----------
       Total |10,756,705     17,403     45,375    545,412 |11,695,903 
             |     91.97       0.15       0.39       4.66 |    100.00 


     Smoking |       Diabetes
      status | T2DM, unc  Diabetes, |     Total
-------------+----------------------+----------
       Never |   118,749      2,575 | 5,524,958 
             |      2.15       0.05 |    100.00 
-------------+----------------------+----------
      Former |   158,368      2,098 | 4,081,724 
             |      3.88       0.05 |    100.00 
-------------+----------------------+----------
     Current |    48,154      1,064 | 2,089,221 
             |      2.30       0.05 |    100.00 
-------------+----------------------+----------
       Total |   325,271      5,737 |11,695,903 
             |      2.78       0.05 |    100.00 
28

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Chronic liver disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,502,353     22,605 | 5,524,958 
             |     99.59       0.41 |    100.00 
-------------+----------------------+----------
      Former | 4,049,748     31,976 | 4,081,724 
             |     99.22       0.78 |    100.00 
-------------+----------------------+----------
     Current | 2,066,429     22,792 | 2,089,221 
             |     98.91       1.09 |    100.00 
-------------+----------------------+----------
       Total |11,618,530     77,373 |11,695,903 
             |     99.34       0.66 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Neurological disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,474,464     50,494 | 5,524,958 
             |     99.09       0.91 |    100.00 
-------------+----------------------+----------
      Former | 4,032,417     49,307 | 4,081,724 
             |     98.79       1.21 |    100.00 
-------------+----------------------+----------
     Current | 2,074,310     14,911 | 2,089,221 
             |     99.29       0.71 |    100.00 
-------------+----------------------+----------
       Total |11,581,191    114,712 |11,695,903 
             |     99.02       0.98 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Stroke or dementia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,438,708     86,250 | 5,524,958 
             |     98.44       1.56 |    100.00 
-------------+----------------------+----------
      Former | 3,942,354    139,370 | 4,081,724 
             |     96.59       3.41 |    100.00 
-------------+----------------------+----------
     Current | 2,051,890     37,331 | 2,089,221 
             |     98.21       1.79 |    100.00 
-------------+----------------------+----------
       Total |11,432,952    262,951 |11,695,903 
             |     97.75       2.25 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Autoimmune disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,303,397    221,561 | 5,524,958 
             |     95.99       4.01 |    100.00 
-------------+----------------------+----------
      Former | 3,803,392    278,332 | 4,081,724 
             |     93.18       6.82 |    100.00 
-------------+----------------------+----------
     Current | 1,970,991    118,230 | 2,089,221 
             |     94.34       5.66 |    100.00 
-------------+----------------------+----------
       Total |11,077,780    618,123 |11,695,903 
             |     94.72       5.28 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Immunosuppressed
             |     (combination
     Smoking |      algorithm)
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,505,979     18,979 | 5,524,958 
             |     99.66       0.34 |    100.00 
-------------+----------------------+----------
      Former | 4,069,290     12,434 | 4,081,724 
             |     99.70       0.30 |    100.00 
-------------+----------------------+----------
     Current | 2,082,215      7,006 | 2,089,221 
             |     99.66       0.34 |    100.00 
-------------+----------------------+----------
       Total |11,657,484     38,419 |11,695,903 
             |     99.67       0.33 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Other solid organ
     Smoking |      transplant
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,523,644      1,314 | 5,524,958 
             |     99.98       0.02 |    100.00 
-------------+----------------------+----------
      Former | 4,080,404      1,320 | 4,081,724 
             |     99.97       0.03 |    100.00 
-------------+----------------------+----------
     Current | 2,088,894        327 | 2,089,221 
             |     99.98       0.02 |    100.00 
-------------+----------------------+----------
       Total |11,692,942      2,961 |11,695,903 
             |     99.97       0.03 |    100.00 
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Asplenia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,518,525      6,433 | 5,524,958 
             |     99.88       0.12 |    100.00 
-------------+----------------------+----------
      Former | 4,074,020      7,704 | 4,081,724 
             |     99.81       0.19 |    100.00 
-------------+----------------------+----------
     Current | 2,085,910      3,311 | 2,089,221 
             |     99.84       0.16 |    100.00 
-------------+----------------------+----------
       Total |11,678,455     17,448 |11,695,903 
             |     99.85       0.15 |    100.00 
24

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |          Non-haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never | 5,301,879     18,551     59,258    145,270 | 5,524,958 
             |     95.96       0.34       1.07       2.63 |    100.00 
-------------+--------------------------------------------+----------
      Former | 3,796,106     24,966     79,036    181,616 | 4,081,724 
             |     93.00       0.61       1.94       4.45 |    100.00 
-------------+--------------------------------------------+----------
     Current | 2,035,345      6,081     16,078     31,717 | 2,089,221 
             |     97.42       0.29       0.77       1.52 |    100.00 
-------------+--------------------------------------------+----------
       Total |11,133,330     49,598    154,372    358,603 |11,695,903 
             |     95.19       0.42       1.32       3.07 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never | 5,497,197      2,245      7,297     18,219 | 5,524,958 
             |     99.50       0.04       0.13       0.33 |    100.00 
-------------+--------------------------------------------+----------
      Former | 4,050,519      2,809      9,014     19,382 | 4,081,724 
             |     99.24       0.07       0.22       0.47 |    100.00 
-------------+--------------------------------------------+----------
     Current | 2,082,424        652      1,846      4,299 | 2,089,221 
             |     99.67       0.03       0.09       0.21 |    100.00 
-------------+--------------------------------------------+----------
       Total |11,630,140      5,706     18,157     41,900 |11,695,903 
             |     99.44       0.05       0.16       0.36 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |     Reduced kidney function
      status |      None  Stage 3a/  Stage 4/5 |     Total
-------------+---------------------------------+----------
       Never | 5,252,162    255,737     17,059 | 5,524,958 
             |     95.06       4.63       0.31 |    100.00 
-------------+---------------------------------+----------
      Former | 3,701,751    351,773     28,200 | 4,081,724 
             |     90.69       8.62       0.69 |    100.00 
-------------+---------------------------------+----------
     Current | 2,037,092     48,122      4,007 | 2,089,221 
             |     97.50       2.30       0.19 |    100.00 
-------------+---------------------------------+----------
       Total |10,991,005    655,632     49,266 |11,695,903 
             |     93.97       5.61       0.42 |    100.00 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    End-stage renal
     Smoking |        disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,517,758      7,200 | 5,524,958 
             |     99.87       0.13 |    100.00 
-------------+----------------------+----------
      Former | 4,073,939      7,785 | 4,081,724 
             |     99.81       0.19 |    100.00 
-------------+----------------------+----------
     Current | 2,087,182      2,039 | 2,089,221 
             |     99.90       0.10 |    100.00 
-------------+----------------------+----------
       Total |11,678,879     17,024 |11,695,903 
             |     99.85       0.15 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,515,849  1,009,109 | 5,524,958 
             |     81.74      18.26 |    100.00 
-------------+----------------------+----------
      Former | 2,861,275  1,220,449 | 4,081,724 
             |     70.10      29.90 |    100.00 
-------------+----------------------+----------
     Current | 1,802,341    286,880 | 2,089,221 
             |     86.27      13.73 |    100.00 
-------------+----------------------+----------
       Total | 9,179,465  2,516,438 |11,695,903 
             |     78.48      21.52 |    100.00 

. 
. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab covid_death covid_icu  , row col
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |   Failure/censoring
  outcome: |     indicator for
     covid |  outcome: covid icu
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |11,967,463      1,262 |11,968,725 
           |     99.99       0.01 |    100.00 
           |     99.97      66.91 |     99.96 
-----------+----------------------+----------
         1 |     4,075        624 |     4,699 
           |     86.72      13.28 |    100.00 
           |      0.03      33.09 |      0.04 
-----------+----------------------+----------
     Total |11,971,538      1,886 |11,973,424 
           |     99.98       0.02 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. safecount if covid_icu==1 & covid_death==1
  624

. safecount if covidadmission==1 & covid_death==1
  1,767

. 
. sum positive_SGSS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S | 11,973,424    .0218226    .1461039          0          1

. sum positive_SGSS if date_positive_SGSS<=22267

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |    261,291           1           0          1          1

. 
. safetab positive_SGSS covid_primary_care_codes, row col miss
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |  Indicator positive
 Indicator |   primary care code
  positive |    COVID infection
covid test |         0          1 |     Total
-----------+----------------------+----------
         0 |11,695,591     16,542 |11,712,133 
           |     99.86       0.14 |    100.00 
           |     99.38       8.08 |     97.82 
-----------+----------------------+----------
         1 |    72,983    188,308 |   261,291 
           |     27.93      72.07 |    100.00 
           |      0.62      91.92 |      2.18 
-----------+----------------------+----------
     Total |11,768,574    204,850 |11,973,424 
           |     98.29       1.71 |    100.00 
           |    100.00     100.00 |    100.00 

. safetab positive_SGSS covid_primary_care_codes if date_positive_SGSS<=22267 &
>  date_covid_primary_care_codes<=22267, row col miss
107

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           | Indicator
           |  positive
           |  primary
           | care code
 Indicator |   COVID
  positive | infection
covid test |         1 |     Total
-----------+-----------+----------
         1 |   188,308 |   188,308 
           |    100.00 |    100.00 
           |    100.00 |    100.00 
-----------+-----------+----------
     Total |   188,308 |   188,308 
           |    100.00 |    100.00 
           |    100.00 |    100.00 

. gen diff=date_positive_SGSS-date_covid_primary_care_codes 
(11,785,116 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -10            -92
 5%           -3            -92
10%           -3            -90       Obs             188,308
25%           -2            -88       Sum of Wgt.     188,308

50%           -1                      Mean          -1.517509
                        Largest       Std. Dev.      2.736943
75%           -1             89
90%           -1             91       Variance       7.490859
95%            0             92       Skewness      -1.962565
99%            0             94       Kurtosis       240.1841

. 
. 
. /* DEATHS by STP=======================================================*/
. tab  stp covid_death, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     3,746          3 |     3,749 
           |      0.03       0.06 |      0.03 
-----------+----------------------+----------
         2 | 1,152,464        773 | 1,153,237 
           |      9.63      16.45 |      9.63 
-----------+----------------------+----------
         3 |   497,166        270 |   497,436 
           |      4.15       5.75 |      4.15 
-----------+----------------------+----------
         4 |   106,426        108 |   106,534 
           |      0.89       2.30 |      0.89 
-----------+----------------------+----------
         5 |    77,841         54 |    77,895 
           |      0.65       1.15 |      0.65 
-----------+----------------------+----------
         6 |   568,174        474 |   568,648 
           |      4.75      10.09 |      4.75 
-----------+----------------------+----------
         7 |    31,494         28 |    31,522 
           |      0.26       0.60 |      0.26 
-----------+----------------------+----------
         8 |   437,061        197 |   437,258 
           |      3.65       4.19 |      3.65 
-----------+----------------------+----------
         9 |   362,786        237 |   363,023 
           |      3.03       5.04 |      3.03 
-----------+----------------------+----------
        10 |   486,772        306 |   487,078 
           |      4.07       6.51 |      4.07 
-----------+----------------------+----------
        11 |   565,709        205 |   565,914 
           |      4.73       4.36 |      4.73 
-----------+----------------------+----------
        12 |   178,108        140 |   178,248 
           |      1.49       2.98 |      1.49 
-----------+----------------------+----------
        13 |   274,492        166 |   274,658 
           |      2.29       3.53 |      2.29 
-----------+----------------------+----------
        14 |   331,971        103 |   332,074 
           |      2.77       2.19 |      2.77 
-----------+----------------------+----------
        15 |   466,721         66 |   466,787 
           |      3.90       1.40 |      3.90 
-----------+----------------------+----------
        16 |   453,644         74 |   453,718 
           |      3.79       1.57 |      3.79 
-----------+----------------------+----------
        17 |   433,677         94 |   433,771 
           |      3.62       2.00 |      3.62 
-----------+----------------------+----------
        18 |   499,403        131 |   499,534 
           |      4.17       2.79 |      4.17 
-----------+----------------------+----------
        19 |   378,269         80 |   378,349 
           |      3.16       1.70 |      3.16 
-----------+----------------------+----------
        20 |   552,839        189 |   553,028 
           |      4.62       4.02 |      4.62 
-----------+----------------------+----------
        21 |   933,021        130 |   933,151 
           |      7.80       2.77 |      7.79 
-----------+----------------------+----------
        22 |    58,761         13 |    58,774 
           |      0.49       0.28 |      0.49 
-----------+----------------------+----------
        23 |   405,689         54 |   405,743 
           |      3.39       1.15 |      3.39 
-----------+----------------------+----------
        24 |    21,398          1 |    21,399 
           |      0.18       0.02 |      0.18 
-----------+----------------------+----------
        25 |    97,655         10 |    97,665 
           |      0.82       0.21 |      0.82 
-----------+----------------------+----------
        26 |   358,634         72 |   358,706 
           |      3.00       1.53 |      3.00 
-----------+----------------------+----------
        27 |   414,404         59 |   414,463 
           |      3.46       1.26 |      3.46 
-----------+----------------------+----------
        28 |   396,740         83 |   396,823 
           |      3.31       1.77 |      3.31 
-----------+----------------------+----------
        29 |   298,225         53 |   298,278 
           |      2.49       1.13 |      2.49 
-----------+----------------------+----------
        30 |   253,103         65 |   253,168 
           |      2.11       1.38 |      2.11 
-----------+----------------------+----------
        31 |    14,740          0 |    14,740 
           |      0.12       0.00 |      0.12 
-----------+----------------------+----------
        32 |   857,592        461 |   858,053 
           |      7.17       9.81 |      7.17 
-----------+----------------------+----------
     Total |11,968,725      4,699 |11,973,424 
           |    100.00     100.00 |    100.00 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/log/02_an_data_checksW2.log
  log type:  text
 closed on:  29 Jan 2021, 16:17:28
-------------------------------------------------------------------------------
