-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/03b_an_descriptive_table_1W2.log
  log type:  text
 opened on:  29 Jan 2021, 16:10:44

. 
. program define generaterow
  1. syntax, variable(varname) condition(string) outcome(string)
  2.         
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3.         
.         cou
  4.         local overalldenom=r(N)
  5.         
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9. 
.         cou if kids_cat4==0 
 10.         local coldenom = r(N)
 11.         cou if kids_cat4==0 & `variable' `condition'
 12.         local pct = 100*(r(N)/`coldenom')
 13.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 14.         
.         cou if kids_cat4==1 
 15.         local coldenom = r(N)
 16.         cou if kids_cat4==1 & `variable' `condition'
 17.         local pct = 100*(r(N)/`coldenom')
 18.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 19.         
.         cou if kids_cat4==2 
 20.         local coldenom = r(N)
 21.         cou if kids_cat4==2 & `variable' `condition'
 22.         local pct = 100*(r(N)/`coldenom')
 23.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 24. 
.         cou if kids_cat4==3 
 25.         local coldenom = r(N)
 26.         cou if kids_cat4==3 & `variable' `condition'
 27.         local pct = 100*(r(N)/`coldenom')
 28.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _n
 29.         
. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] outcome(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) outcome(kids_cat4)
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") outcome(kids_cat4)
  6. 
. end

. 
. *****************************************************************************
> **
. 
. *Set up output file
. 
. forvalues x=0/1 {
  2. 
. cap file close tablecontent
  3. file open tablecontent using ./output/03b_an_descriptive_table_1_kids_cat4
> _ageband`x'`dataset'.txt, write text replace
  4. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) outcome(kids_cat4)
  7. file write tablecontent _n 
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) outcome(kids_cat4) 
  9. file write tablecontent _n 
 10. 
. tabulatevariable, variable(male) start(0) end(1) outcome(kids_cat4)
 11. file write tablecontent _n 
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing outcome(kids_cat4)
 13. file write tablecontent _n 
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing outcome(kids_cat4) 
 15. file write tablecontent _n 
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing outcome(kids_ca
> t4)
 17. file write tablecontent _n 
 18. 
. tabulatevariable, variable(imd) start(1) end(5) outcome(kids_cat4)
 19. file write tablecontent _n 
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) outcome(kids_cat4)
 21. file write tablecontent _n 
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing outcome(kids_cat4)
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) outcome(kids_
> cat4)                 
 24. file write tablecontent _n  
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) outco
> me(kids_cat4)
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1) outcome(kids_cat4) /*ever 
> asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) outcome(k
> ids_cat4)
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) outcome(kids_cat4) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4) outcome(kids_cat4
> ) /*<1, 1-4.9, 5+ years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4) outcome(kids_ca
> t4) /*<1, 1-4.9, 5+ years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) outco
> me(kids_cat4)
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) outcome(kids_cat4)
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) outcome(kid
> s_cat4)
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) outcome(kids_cat4
> )
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) outcome(kids_cat4)
 40. *OTHER ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) outcome(kids_cat
> 4)
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) outcome(kids_cat4)
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) outcome(kids_cat
> 4)
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) outcome(kids_cat4)
 44. *SHEILDING
. tabulatevariable, variable(shield) start(1) end(1) outcome(kids_cat4)
 45. *anycomorbidity
. tabulatevariable, variable(anycomorb) start(1) end(1) outcome(kids_cat4)
 46. 
. file close tablecontent
 47. 
. }
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband0W2.txt not fo
> und)
  9,266,919
  9,266,919
  5,826,609
  5,826,609
  1,849,103
  1,849,103
  895,168
  895,168
  696,039
  696,039
  9,266,919
  1,912,652
  5,826,609
  1,315,490
  1,849,103
  338,068
  895,168
  172,635
  696,039
  86,459
  9,266,919
  2,222,046
  5,826,609
  1,042,511
  1,849,103
  854,529
  895,168
  92,963
  696,039
  232,043
  9,266,919
  2,021,030
  5,826,609
  883,126
  1,849,103
  491,383
  895,168
  346,632
  696,039
  299,889
  9,266,919
  2,064,172
  5,826,609
  1,615,153
  1,849,103
  126,089
  895,168
  256,739
  696,039
  66,191
  9,266,919
  1,047,019
  5,826,609
  970,329
  1,849,103
  39,034
  895,168
  26,199
  696,039
  11,457
  9,266,919
  0
  5,826,609
  0
  1,849,103
  0
  895,168
  0
  696,039
  0
  9,266,919
  0
  5,826,609
  0
  1,849,103
  0
  895,168
  0
  696,039
  0
  9,266,919
  4,757,515
  5,826,609
  2,813,198
  1,849,103
  1,061,462
  895,168
  492,480
  696,039
  390,375
  9,266,919
  4,509,404
  5,826,609
  3,013,411
  1,849,103
  787,641
  895,168
  402,688
  696,039
  305,664
  9,266,919
  177,343
  5,826,609
  118,586
  1,849,103
  34,346
  895,168
  13,714
  696,039
  10,697
  9,266,919
  2,822,640
  5,826,609
  1,785,837
  1,849,103
  608,002
  895,168
  239,762
  696,039
  189,039
  9,266,919
  2,489,283
  5,826,609
  1,548,515
  1,849,103
  511,776
  895,168
  239,722
  696,039
  189,270
  9,266,919
  1,256,346
  5,826,609
  793,251
  1,849,103
  239,641
  895,168
  124,754
  696,039
  98,700
  9,266,919
  510,314
  5,826,609
  324,286
  1,849,103
  94,777
  895,168
  50,645
  696,039
  40,606
  9,266,919
  275,736
  5,826,609
  177,670
  1,849,103
  49,510
  895,168
  26,873
  696,039
  21,683
  9,266,919
  1,735,257
  5,826,609
  1,078,464
  1,849,103
  311,051
  895,168
  199,698
  696,039
  146,044
  9,266,919
  4,451,215
  5,826,609
  2,797,847
  1,849,103
  902,700
  895,168
  432,370
  696,039
  318,298
  9,266,919
  2,677,563
  5,826,609
  1,662,786
  1,849,103
  554,278
  895,168
  259,788
  696,039
  200,711
  9,266,919
  1,866,970
  5,826,609
  1,210,916
  1,849,103
  351,077
  895,168
  154,942
  696,039
  150,035
  9,266,919
  271,171
  5,826,609
  155,060
  1,849,103
  41,048
  895,168
  48,068
  696,039
  26,995
  9,266,919
  7,666,700
  5,826,609
  4,978,892
  1,849,103
  1,462,663
  895,168
  717,609
  696,039
  507,536
  9,266,919
  160,932
  5,826,609
  96,111
  1,849,103
  34,747
  895,168
  15,243
  696,039
  14,831
  9,266,919
  835,735
  5,826,609
  397,786
  1,849,103
  224,660
  895,168
  103,212
  696,039
  110,077
  9,266,919
  309,730
  5,826,609
  169,139
  1,849,103
  65,419
  895,168
  35,237
  696,039
  39,935
  9,266,919
  293,822
  5,826,609
  184,681
  1,849,103
  61,614
  895,168
  23,867
  696,039
  23,660
  9,266,919
  0
  5,826,609
  0
  1,849,103
  0
  895,168
  0
  696,039
  0
  9,266,919
  1,741,677
  5,826,609
  1,074,749
  1,849,103
  359,760
  895,168
  193,610
  696,039
  113,558
  9,266,919
  1,837,273
  5,826,609
  1,191,807
  1,849,103
  354,459
  895,168
  177,150
  696,039
  113,857
  9,266,919
  1,898,184
  5,826,609
  1,238,423
  1,849,103
  362,430
  895,168
  172,020
  696,039
  125,311
  9,266,919
  1,994,633
  5,826,609
  1,263,543
  1,849,103
  394,553
  895,168
  179,832
  696,039
  156,705
  9,266,919
  1,795,152
  5,826,609
  1,058,087
  1,849,103
  377,901
  895,168
  172,556
  696,039
  186,608
  9,266,919
  2,223,814
  5,826,609
  1,753,725
  1,849,103
  290,337
  895,168
  101,161
  696,039
  78,591
  9,266,919
  3,772,870
  5,826,609
  2,021,828
  1,849,103
  1,042,094
  895,168
  354,375
  696,039
  354,573
  9,266,919
  3,270,235
  5,826,609
  2,051,056
  1,849,103
  516,672
  895,168
  439,632
  696,039
  262,875
  9,266,919
  2,452,608
  5,826,609
  1,361,836
  1,849,103
  635,143
  895,168
  238,615
  696,039
  217,014
  9,266,919
  1,335,410
  5,826,609
  824,985
  1,849,103
  283,730
  895,168
  124,896
  696,039
  101,799
  9,266,919
  2,924,903
  5,826,609
  1,882,308
  1,849,103
  539,829
  895,168
  288,445
  696,039
  214,321
  9,266,919
  1,552,001
  5,826,609
  1,086,911
  1,849,103
  219,023
  895,168
  149,585
  696,039
  96,482
  9,266,919
  1,001,997
  5,826,609
  670,569
  1,849,103
  171,378
  895,168
  93,627
  696,039
  66,423
  9,266,919
  2,174,941
  5,826,609
  1,567,337
  1,849,103
  278,336
  895,168
  203,794
  696,039
  125,474
  9,266,919
  185,356
  5,826,609
  151,101
  1,849,103
  14,739
  895,168
  12,738
  696,039
  6,778
  9,266,919
  1,595,772
  5,826,609
  995,010
  1,849,103
  324,574
  895,168
  155,995
  696,039
  120,193
  9,266,919
  260,386
  5,826,609
  204,395
  1,849,103
  24,381
  895,168
  20,461
  696,039
  11,149
  9,266,919
  8,811,895
  5,826,609
  5,492,611
  1,849,103
  1,797,701
  895,168
  853,282
  696,039
  668,301
  9,266,919
  13,740
  5,826,609
  9,365
  1,849,103
  2,629
  895,168
  1,048
  696,039
  698
  9,266,919
  38,109
  5,826,609
  26,324
  1,849,103
  6,140
  895,168
  3,402
  696,039
  2,243
  9,266,919
  221,590
  5,826,609
  165,152
  1,849,103
  23,255
  895,168
  19,958
  696,039
  13,225
  9,266,919
  177,484
  5,826,609
  130,481
  1,849,103
  18,651
  895,168
  17,116
  696,039
  11,236
  9,266,919
  4,101
  5,826,609
  2,676
  1,849,103
  727
  895,168
  362
  696,039
  336
  9,266,919
  2,232
  5,826,609
  1,652
  1,849,103
  270
  895,168
  186
  696,039
  124
  9,266,919
  7,103
  5,826,609
  5,311
  1,849,103
  844
  895,168
  605
  696,039
  343
  9,266,919
  19,067
  5,826,609
  13,995
  1,849,103
  2,558
  895,168
  1,637
  696,039
  877
  9,266,919
  20,699
  5,826,609
  15,632
  1,849,103
  2,144
  895,168
  1,936
  696,039
  987
  9,266,919
  61,958
  5,826,609
  47,146
  1,849,103
  6,331
  895,168
  5,700
  696,039
  2,781
  9,266,919
  110,193
  5,826,609
  87,255
  1,849,103
  9,646
  895,168
  9,235
  696,039
  4,057
  9,266,919
  95,475
  5,826,609
  79,704
  1,849,103
  6,540
  895,168
  6,437
  696,039
  2,794
  9,266,919
  9,104
  5,826,609
  7,096
  1,849,103
  890
  895,168
  717
  696,039
  401
  9,266,919
  10,787
  5,826,609
  8,189
  1,849,103
  1,245
  895,168
  838
  696,039
  515
  9,266,919
  51,834
  5,826,609
  39,444
  1,849,103
  6,044
  895,168
  3,549
  696,039
  2,797
  9,266,919
  72,174
  5,826,609
  57,944
  1,849,103
  6,152
  895,168
  5,225
  696,039
  2,853
  9,266,919
  64,030
  5,826,609
  48,899
  1,849,103
  7,128
  895,168
  5,206
  696,039
  2,797
  9,266,919
  2,122
  5,826,609
  1,646
  1,849,103
  225
  895,168
  168
  696,039
  83
  9,266,919
  10,883
  5,826,609
  7,892
  1,849,103
  1,458
  895,168
  1,003
  696,039
  530
  9,266,919
  412,685
  5,826,609
  268,884
  1,849,103
  72,906
  895,168
  41,117
  696,039
  29,778
  9,266,919
  33,238
  5,826,609
  23,385
  1,849,103
  4,807
  895,168
  2,730
  696,039
  2,316
  9,266,919
  1,944,911
  5,826,609
  1,267,606
  1,849,103
  358,550
  895,168
  183,976
  696,039
  134,779
  9,266,919
  2,782,512
  5,826,609
  1,853,883
  1,849,103
  476,053
  895,168
  263,308
  696,039
  189,268
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband1W2.txt not fo
> und)
  2,706,505
  2,706,505
  2,616,423
  2,616,423
  44,335
  44,335
  29,854
  29,854
  15,893
  15,893
  2,706,505
  0
  2,616,423
  0
  44,335
  0
  29,854
  0
  15,893
  0
  2,706,505
  0
  2,616,423
  0
  44,335
  0
  29,854
  0
  15,893
  0
  2,706,505
  0
  2,616,423
  0
  44,335
  0
  29,854
  0
  15,893
  0
  2,706,505
  0
  2,616,423
  0
  44,335
  0
  29,854
  0
  15,893
  0
  2,706,505
  632,027
  2,616,423
  599,415
  44,335
  17,826
  29,854
  9,162
  15,893
  5,624
  2,706,505
  1,375,657
  2,616,423
  1,331,707
  44,335
  21,017
  29,854
  15,153
  15,893
  7,780
  2,706,505
  698,821
  2,616,423
  685,301
  44,335
  5,492
  29,854
  5,539
  15,893
  2,489
  2,706,505
  1,457,578
  2,616,423
  1,409,510
  44,335
  23,386
  29,854
  15,668
  15,893
  9,014
  2,706,505
  1,248,927
  2,616,423
  1,206,913
  44,335
  20,949
  29,854
  14,186
  15,893
  6,879
  2,706,505
  44,591
  2,616,423
  43,371
  44,335
  551
  29,854
  438
  15,893
  231
  2,706,505
  793,996
  2,616,423
  771,543
  44,335
  11,437
  29,854
  7,215
  15,893
  3,801
  2,706,505
  994,595
  2,616,423
  962,848
  44,335
  15,609
  29,854
  10,703
  15,893
  5,435
  2,706,505
  485,856
  2,616,423
  468,212
  44,335
  8,545
  29,854
  5,891
  15,893
  3,208
  2,706,505
  159,518
  2,616,423
  153,406
  44,335
  2,893
  29,854
  2,095
  15,893
  1,124
  2,706,505
  62,493
  2,616,423
  59,863
  44,335
  1,235
  29,854
  902
  15,893
  493
  2,706,505
  165,456
  2,616,423
  157,180
  44,335
  4,065
  29,854
  2,610
  15,893
  1,601
  2,706,505
  1,073,743
  2,616,423
  1,030,164
  44,335
  21,685
  29,854
  13,480
  15,893
  8,414
  2,706,505
  1,404,161
  2,616,423
  1,367,878
  44,335
  17,551
  29,854
  13,095
  15,893
  5,637
  2,706,505
  222,251
  2,616,423
  213,027
  44,335
  4,593
  29,854
  3,036
  15,893
  1,595
  2,706,505
  6,350
  2,616,423
  5,354
  44,335
  506
  29,854
  243
  15,893
  247
  2,706,505
  2,552,971
  2,616,423
  2,493,459
  44,335
  28,815
  29,854
  21,851
  15,893
  8,846
  2,706,505
  10,249
  2,616,423
  9,122
  44,335
  549
  29,854
  361
  15,893
  217
  2,706,505
  92,732
  2,616,423
  70,126
  44,335
  11,582
  29,854
  5,618
  15,893
  5,406
  2,706,505
  28,209
  2,616,423
  24,402
  44,335
  1,771
  29,854
  1,227
  15,893
  809
  2,706,505
  22,344
  2,616,423
  19,314
  44,335
  1,618
  29,854
  797
  15,893
  615
  2,706,505
  0
  2,616,423
  0
  44,335
  0
  29,854
  0
  15,893
  0
  2,706,505
  668,867
  2,616,423
  652,542
  44,335
  7,945
  29,854
  5,868
  15,893
  2,512
  2,706,505
  636,250
  2,616,423
  619,228
  44,335
  8,386
  29,854
  5,888
  15,893
  2,748
  2,706,505
  574,847
  2,616,423
  556,103
  44,335
  9,309
  29,854
  6,331
  15,893
  3,104
  2,706,505
  479,967
  2,616,423
  459,987
  44,335
  9,980
  29,854
  6,246
  15,893
  3,754
  2,706,505
  346,574
  2,616,423
  328,563
  44,335
  8,715
  29,854
  5,521
  15,893
  3,775
  2,706,505
  921,594
  2,616,423
  918,322
  44,335
  1,432
  29,854
  1,579
  15,893
  261
  2,706,505
  1,390,726
  2,616,423
  1,373,830
  44,335
  7,533
  29,854
  7,296
  15,893
  2,067
  2,706,505
  394,185
  2,616,423
  324,271
  44,335
  35,370
  29,854
  20,979
  15,893
  13,565
  2,706,505
  310,503
  2,616,423
  299,723
  44,335
  5,394
  29,854
  3,510
  15,893
  1,876
  2,706,505
  422,947
  2,616,423
  409,265
  44,335
  6,749
  29,854
  4,496
  15,893
  2,437
  2,706,505
  1,011,992
  2,616,423
  978,709
  44,335
  16,518
  29,854
  10,989
  15,893
  5,776
  2,706,505
  946,777
  2,616,423
  916,919
  44,335
  14,329
  29,854
  10,281
  15,893
  5,248
  2,706,505
  14,286
  2,616,423
  11,807
  44,335
  1,345
  29,854
  578
  15,893
  556
  2,706,505
  1,858,019
  2,616,423
  1,798,291
  44,335
  28,917
  29,854
  20,336
  15,893
  10,475
  2,706,505
  324,691
  2,616,423
  315,049
  44,335
  4,507
  29,854
  3,563
  15,893
  1,572
  2,706,505
  366,433
  2,616,423
  353,571
  44,335
  6,353
  29,854
  4,202
  15,893
  2,307
  2,706,505
  551,840
  2,616,423
  534,326
  44,335
  8,245
  29,854
  6,174
  15,893
  3,095
  2,706,505
  2,221,833
  2,616,423
  2,155,520
  44,335
  32,726
  29,854
  22,454
  15,893
  11,133
  2,706,505
  3,710
  2,616,423
  3,609
  44,335
  48
  29,854
  37
  15,893
  16
  2,706,505
  7,352
  2,616,423
  7,137
  44,335
  104
  29,854
  74
  15,893
  37
  2,706,505
  323,947
  2,616,423
  309,264
  44,335
  7,154
  29,854
  4,691
  15,893
  2,838
  2,706,505
  147,893
  2,616,423
  139,316
  44,335
  4,196
  29,854
  2,552
  15,893
  1,829
  2,706,505
  1,770
  2,616,423
  1,577
  44,335
  107
  29,854
  46
  15,893
  40
  2,706,505
  3,499
  2,616,423
  3,410
  44,335
  36
  29,854
  35
  15,893
  18
  2,706,505
  11,138
  2,616,423
  10,848
  44,335
  134
  29,854
  113
  15,893
  43
  2,706,505
  23,008
  2,616,423
  22,415
  44,335
  286
  29,854
  202
  15,893
  105
  2,706,505
  29,009
  2,616,423
  28,240
  44,335
  399
  29,854
  249
  15,893
  121
  2,706,505
  92,748
  2,616,423
  90,331
  44,335
  1,191
  29,854
  819
  15,893
  407
  2,706,505
  248,878
  2,616,423
  243,450
  44,335
  2,565
  29,854
  2,060
  15,893
  803
  2,706,505
  560,736
  2,616,423
  545,878
  44,335
  6,720
  29,854
  5,474
  15,893
  2,664
  2,706,505
  40,212
  2,616,423
  38,848
  44,335
  612
  29,854
  471
  15,893
  281
  2,706,505
  6,285
  2,616,423
  5,934
  44,335
  159
  29,854
  110
  15,893
  82
  2,706,505
  25,834
  2,616,423
  24,900
  44,335
  426
  29,854
  319
  15,893
  189
  2,706,505
  191,057
  2,616,423
  185,318
  44,335
  2,676
  29,854
  2,016
  15,893
  1,047
  2,706,505
  51,397
  2,616,423
  49,856
  44,335
  719
  29,854
  534
  15,893
  288
  2,706,505
  852
  2,616,423
  802
  44,335
  19
  29,854
  17
  15,893
  14
  2,706,505
  6,639
  2,616,423
  6,458
  44,335
  88
  29,854
  67
  15,893
  26
  2,706,505
  208,797
  2,616,423
  202,856
  44,335
  2,917
  29,854
  2,061
  15,893
  963
  2,706,505
  5,658
  2,616,423
  5,448
  44,335
  110
  29,854
  68
  15,893
  32
  2,706,505
  941,453
  2,616,423
  913,752
  44,335
  13,374
  29,854
  9,663
  15,893
  4,664
  2,706,505
  1,623,911
  2,616,423
  1,570,025
  44,335
  26,049
  29,854
  18,226
  15,893
  9,611

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/03b_an_descriptive_table_1W2.log
  log type:  text
 closed on:  29 Jan 2021, 16:12:53
-------------------------------------------------------------------------------
