-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/03b_an_descriptive_table_1MAIN.log
  log type:  text
 opened on:  23 Jan 2021, 02:40:55

. 
. program define generaterow
  1. syntax, variable(varname) condition(string) outcome(string)
  2.         
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3.         
.         cou
  4.         local overalldenom=r(N)
  5.         
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9. 
.         cou if kids_cat4==0 
 10.         local coldenom = r(N)
 11.         cou if kids_cat4==0 & `variable' `condition'
 12.         local pct = 100*(r(N)/`coldenom')
 13.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 14.         
.         cou if kids_cat4==1 
 15.         local coldenom = r(N)
 16.         cou if kids_cat4==1 & `variable' `condition'
 17.         local pct = 100*(r(N)/`coldenom')
 18.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 19.         
.         cou if kids_cat4==2 
 20.         local coldenom = r(N)
 21.         cou if kids_cat4==2 & `variable' `condition'
 22.         local pct = 100*(r(N)/`coldenom')
 23.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 24. 
.         cou if kids_cat4==3 
 25.         local coldenom = r(N)
 26.         cou if kids_cat4==3 & `variable' `condition'
 27.         local pct = 100*(r(N)/`coldenom')
 28.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _n
 29.         
. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] outcome(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) outcome(kids_cat4)
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") outcome(kids_cat4)
  6. 
. end

. 
. *****************************************************************************
> **
. 
. *Set up output file
. 
. forvalues x=0/1 {
  2. 
. cap file close tablecontent
  3. file open tablecontent using ./output/03b_an_descriptive_table_1_kids_cat4
> _ageband`x'`dataset'.txt, write text replace
  4. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) outcome(kids_cat4)
  7. file write tablecontent _n 
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) outcome(kids_cat4) 
  9. file write tablecontent _n 
 10. 
. tabulatevariable, variable(male) start(0) end(1) outcome(kids_cat4)
 11. file write tablecontent _n 
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing outcome(kids_cat4)
 13. file write tablecontent _n 
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing outcome(kids_cat4) 
 15. file write tablecontent _n 
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing outcome(kids_ca
> t4)
 17. file write tablecontent _n 
 18. 
. tabulatevariable, variable(imd) start(1) end(5) outcome(kids_cat4)
 19. file write tablecontent _n 
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) outcome(kids_cat4)
 21. file write tablecontent _n 
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing outcome(kids_cat4)
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) outcome(kids_
> cat4)                 
 24. file write tablecontent _n  
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) outco
> me(kids_cat4)
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1) outcome(kids_cat4) /*ever 
> asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) outcome(k
> ids_cat4)
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) outcome(kids_cat4) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4) outcome(kids_cat4
> ) /*<1, 1-4.9, 5+ years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4) outcome(kids_ca
> t4) /*<1, 1-4.9, 5+ years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) outco
> me(kids_cat4)
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) outcome(kids_cat4)
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) outcome(kid
> s_cat4)
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) outcome(kids_cat4
> )
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) outcome(kids_cat4)
 40. *OTHER ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) outcome(kids_cat
> 4)
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) outcome(kids_cat4)
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) outcome(kids_cat
> 4)
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) outcome(kids_cat4)
 44. *SHEILDING
. tabulatevariable, variable(shield) start(1) end(1) outcome(kids_cat4)
 45. *anycomorbidity
. tabulatevariable, variable(anycomorb) start(1) end(1) outcome(kids_cat4)
 46. 
. file close tablecontent
 47. 
. }
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband0MAIN.txt not 
> found)
  9,334,392
  9,334,392
  5,862,942
  5,862,942
  1,918,698
  1,918,698
  868,582
  868,582
  684,170
  684,170
  9,334,392
  1,981,860
  5,862,942
  1,363,510
  1,918,698
  370,176
  868,582
  163,895
  684,170
  84,279
  9,334,392
  2,230,655
  5,862,942
  1,022,787
  1,918,698
  888,086
  868,582
  89,796
  684,170
  229,986
  9,334,392
  2,022,059
  5,862,942
  892,381
  1,918,698
  493,831
  868,582
  341,432
  684,170
  294,415
  9,334,392
  2,062,371
  5,862,942
  1,622,258
  1,918,698
  127,370
  868,582
  248,283
  684,170
  64,460
  9,334,392
  1,037,447
  5,862,942
  962,006
  1,918,698
  39,235
  868,582
  25,176
  684,170
  11,030
  9,334,392
  0
  5,862,942
  0
  1,918,698
  0
  868,582
  0
  684,170
  0
  9,334,392
  0
  5,862,942
  0
  1,918,698
  0
  868,582
  0
  684,170
  0
  9,334,392
  4,802,386
  5,862,942
  2,837,737
  1,918,698
  1,102,345
  868,582
  478,341
  684,170
  383,963
  9,334,392
  4,532,006
  5,862,942
  3,025,205
  1,918,698
  816,353
  868,582
  390,241
  684,170
  300,207
  9,334,392
  180,395
  5,862,942
  120,758
  1,918,698
  35,697
  868,582
  13,326
  684,170
  10,614
  9,334,392
  2,886,762
  5,862,942
  1,822,971
  1,918,698
  638,503
  868,582
  236,507
  684,170
  188,781
  9,334,392
  2,551,873
  5,862,942
  1,583,707
  1,918,698
  538,493
  868,582
  239,111
  684,170
  190,562
  9,334,392
  1,286,837
  5,862,942
  810,367
  1,918,698
  251,842
  868,582
  124,993
  684,170
  99,635
  9,334,392
  521,821
  5,862,942
  330,749
  1,918,698
  99,667
  868,582
  50,579
  684,170
  40,826
  9,334,392
  281,814
  5,862,942
  181,037
  1,918,698
  51,978
  868,582
  27,042
  684,170
  21,757
  9,334,392
  1,624,890
  5,862,942
  1,013,353
  1,918,698
  302,518
  868,582
  177,024
  684,170
  131,995
  9,334,392
  4,491,312
  5,862,942
  2,817,393
  1,918,698
  936,586
  868,582
  422,934
  684,170
  314,399
  9,334,392
  2,684,880
  5,862,942
  1,664,918
  1,918,698
  572,564
  868,582
  251,378
  684,170
  196,020
  9,334,392
  1,900,976
  5,862,942
  1,230,698
  1,918,698
  368,327
  868,582
  152,752
  684,170
  149,199
  9,334,392
  257,224
  5,862,942
  149,933
  1,918,698
  41,221
  868,582
  41,518
  684,170
  24,552
  9,334,392
  7,734,228
  5,862,942
  5,018,723
  1,918,698
  1,517,885
  868,582
  698,665
  684,170
  498,955
  9,334,392
  160,065
  5,862,942
  95,418
  1,918,698
  35,811
  868,582
  14,439
  684,170
  14,397
  9,334,392
  836,666
  5,862,942
  395,482
  1,918,698
  233,110
  868,582
  99,548
  684,170
  108,526
  9,334,392
  309,079
  5,862,942
  168,273
  1,918,698
  68,060
  868,582
  33,380
  684,170
  39,366
  9,334,392
  294,354
  5,862,942
  185,046
  1,918,698
  63,832
  868,582
  22,550
  684,170
  22,926
  9,334,392
  0
  5,862,942
  0
  1,918,698
  0
  868,582
  0
  684,170
  0
  9,334,392
  1,724,481
  5,862,942
  1,062,278
  1,918,698
  366,563
  868,582
  185,680
  684,170
  109,960
  9,334,392
  1,850,024
  5,862,942
  1,196,763
  1,918,698
  368,768
  868,582
  172,144
  684,170
  112,349
  9,334,392
  1,942,791
  5,862,942
  1,266,447
  1,918,698
  381,946
  868,582
  169,873
  684,170
  124,525
  9,334,392
  2,010,621
  5,862,942
  1,273,190
  1,918,698
  409,140
  868,582
  174,424
  684,170
  153,867
  9,334,392
  1,806,475
  5,862,942
  1,064,264
  1,918,698
  392,281
  868,582
  166,461
  684,170
  183,469
  9,334,392
  2,260,091
  5,862,942
  1,777,253
  1,918,698
  303,248
  868,582
  101,069
  684,170
  78,521
  9,334,392
  3,850,961
  5,862,942
  2,059,460
  1,918,698
  1,087,817
  868,582
  351,896
  684,170
  351,788
  9,334,392
  3,223,340
  5,862,942
  2,026,229
  1,918,698
  527,633
  868,582
  415,617
  684,170
  253,861
  9,334,392
  2,475,941
  5,862,942
  1,370,194
  1,918,698
  662,266
  868,582
  230,284
  684,170
  213,197
  9,334,392
  1,347,313
  5,862,942
  830,854
  1,918,698
  294,240
  868,582
  121,842
  684,170
  100,377
  9,334,392
  2,935,415
  5,862,942
  1,885,302
  1,918,698
  557,383
  868,582
  281,362
  684,170
  211,368
  9,334,392
  1,585,467
  5,862,942
  1,110,816
  1,918,698
  229,031
  868,582
  149,253
  684,170
  96,367
  9,334,392
  990,256
  5,862,942
  665,776
  1,918,698
  175,778
  868,582
  85,841
  684,170
  62,861
  9,334,392
  2,221,567
  5,862,942
  1,599,551
  1,918,698
  291,885
  868,582
  203,970
  684,170
  126,161
  9,334,392
  196,442
  5,862,942
  160,272
  1,918,698
  15,843
  868,582
  13,212
  684,170
  7,115
  9,334,392
  1,607,197
  5,862,942
  1,000,699
  1,918,698
  336,359
  868,582
  151,963
  684,170
  118,176
  9,334,392
  274,825
  5,862,942
  215,880
  1,918,698
  26,189
  868,582
  21,156
  684,170
  11,600
  9,334,392
  8,877,057
  5,862,942
  5,527,127
  1,918,698
  1,865,972
  868,582
  827,415
  684,170
  656,543
  9,334,392
  13,036
  5,862,942
  8,841
  1,918,698
  2,533
  868,582
  998
  684,170
  664
  9,334,392
  39,054
  5,862,942
  26,998
  1,918,698
  6,433
  868,582
  3,354
  684,170
  2,269
  9,334,392
  224,926
  5,862,942
  167,803
  1,918,698
  24,103
  868,582
  19,812
  684,170
  13,208
  9,334,392
  175,978
  5,862,942
  129,290
  1,918,698
  18,872
  868,582
  16,657
  684,170
  11,159
  9,334,392
  4,341
  5,862,942
  2,883
  1,918,698
  785
  868,582
  346
  684,170
  327
  9,334,392
  2,427
  5,862,942
  1,799
  1,918,698
  295
  868,582
  203
  684,170
  130
  9,334,392
  7,583
  5,862,942
  5,740
  1,918,698
  885
  868,582
  609
  684,170
  349
  9,334,392
  19,774
  5,862,942
  14,464
  1,918,698
  2,742
  868,582
  1,664
  684,170
  904
  9,334,392
  22,851
  5,862,942
  17,298
  1,918,698
  2,428
  868,582
  2,029
  684,170
  1,096
  9,334,392
  66,072
  5,862,942
  50,262
  1,918,698
  6,961
  868,582
  5,968
  684,170
  2,881
  9,334,392
  116,131
  5,862,942
  91,877
  1,918,698
  10,380
  868,582
  9,637
  684,170
  4,237
  9,334,392
  96,030
  5,862,942
  80,145
  1,918,698
  6,641
  868,582
  6,391
  684,170
  2,853
  9,334,392
  9,342
  5,862,942
  7,302
  1,918,698
  919
  868,582
  719
  684,170
  402
  9,334,392
  11,510
  5,862,942
  8,716
  1,918,698
  1,359
  868,582
  883
  684,170
  552
  9,334,392
  54,410
  5,862,942
  41,508
  1,918,698
  6,450
  868,582
  3,633
  684,170
  2,819
  9,334,392
  76,724
  5,862,942
  61,665
  1,918,698
  6,672
  868,582
  5,446
  684,170
  2,941
  9,334,392
  66,083
  5,862,942
  50,488
  1,918,698
  7,485
  868,582
  5,248
  684,170
  2,862
  9,334,392
  2,210
  5,862,942
  1,700
  1,918,698
  240
  868,582
  184
  684,170
  86
  9,334,392
  11,363
  5,862,942
  8,190
  1,918,698
  1,567
  868,582
  1,029
  684,170
  577
  9,334,392
  421,447
  5,862,942
  274,278
  1,918,698
  76,463
  868,582
  40,749
  684,170
  29,957
  9,334,392
  33,165
  5,862,942
  23,264
  1,918,698
  5,018
  868,582
  2,583
  684,170
  2,300
  9,334,392
  1,976,741
  5,862,942
  1,289,269
  1,918,698
  373,102
  868,582
  180,874
  684,170
  133,496
  9,334,392
  2,829,678
  5,862,942
  1,885,989
  1,918,698
  495,963
  868,582
  259,559
  684,170
  188,167
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband1MAIN.txt not 
> found)
  2,684,524
  2,684,524
  2,595,472
  2,595,472
  44,420
  44,420
  29,227
  29,227
  15,405
  15,405
  2,684,524
  0
  2,595,472
  0
  44,420
  0
  29,227
  0
  15,405
  0
  2,684,524
  0
  2,595,472
  0
  44,420
  0
  29,227
  0
  15,405
  0
  2,684,524
  0
  2,595,472
  0
  44,420
  0
  29,227
  0
  15,405
  0
  2,684,524
  0
  2,595,472
  0
  44,420
  0
  29,227
  0
  15,405
  0
  2,684,524
  633,913
  2,595,472
  601,603
  44,420
  17,863
  29,227
  9,030
  15,405
  5,417
  2,684,524
  1,357,522
  2,595,472
  1,314,301
  44,420
  20,952
  29,227
  14,752
  15,405
  7,517
  2,684,524
  693,089
  2,595,472
  679,568
  44,420
  5,605
  29,227
  5,445
  15,405
  2,471
  2,684,524
  1,445,097
  2,595,472
  1,397,650
  44,420
  23,411
  29,227
  15,309
  15,405
  8,727
  2,684,524
  1,239,427
  2,595,472
  1,197,822
  44,420
  21,009
  29,227
  13,918
  15,405
  6,678
  2,684,524
  48,518
  2,595,472
  47,232
  44,420
  596
  29,227
  465
  15,405
  225
  2,684,524
  800,412
  2,595,472
  777,844
  44,420
  11,709
  29,227
  7,168
  15,405
  3,691
  2,684,524
  987,076
  2,595,472
  955,538
  44,420
  15,690
  29,227
  10,585
  15,405
  5,263
  2,684,524
  479,258
  2,595,472
  461,889
  44,420
  8,560
  29,227
  5,693
  15,405
  3,116
  2,684,524
  156,751
  2,595,472
  150,696
  44,420
  2,877
  29,227
  2,073
  15,405
  1,105
  2,684,524
  61,135
  2,595,472
  58,530
  44,420
  1,227
  29,227
  875
  15,405
  503
  2,684,524
  151,374
  2,595,472
  143,743
  44,420
  3,761
  29,227
  2,368
  15,405
  1,502
  2,684,524
  1,060,734
  2,595,472
  1,017,749
  44,420
  21,672
  29,227
  13,150
  15,405
  8,163
  2,684,524
  1,395,189
  2,595,472
  1,359,139
  44,420
  17,673
  29,227
  12,873
  15,405
  5,504
  2,684,524
  222,197
  2,595,472
  213,161
  44,420
  4,554
  29,227
  2,974
  15,405
  1,508
  2,684,524
  6,404
  2,595,472
  5,423
  44,420
  521
  29,227
  230
  15,405
  230
  2,684,524
  2,533,944
  2,595,472
  2,475,149
  44,420
  28,867
  29,227
  21,381
  15,405
  8,547
  2,684,524
  9,970
  2,595,472
  8,847
  44,420
  542
  29,227
  371
  15,405
  210
  2,684,524
  91,000
  2,595,472
  68,550
  44,420
  11,626
  29,227
  5,525
  15,405
  5,299
  2,684,524
  27,818
  2,595,472
  24,091
  44,420
  1,761
  29,227
  1,159
  15,405
  807
  2,684,524
  21,792
  2,595,472
  18,835
  44,420
  1,624
  29,227
  791
  15,405
  542
  2,684,524
  0
  2,595,472
  0
  44,420
  0
  29,227
  0
  15,405
  0
  2,684,524
  651,069
  2,595,472
  635,133
  44,420
  7,829
  29,227
  5,705
  15,405
  2,402
  2,684,524
  629,037
  2,595,472
  612,217
  44,420
  8,482
  29,227
  5,656
  15,405
  2,682
  2,684,524
  580,534
  2,595,472
  561,800
  44,420
  9,483
  29,227
  6,272
  15,405
  2,979
  2,684,524
  477,447
  2,595,472
  457,663
  44,420
  9,876
  29,227
  6,212
  15,405
  3,696
  2,684,524
  346,437
  2,595,472
  328,659
  44,420
  8,750
  29,227
  5,382
  15,405
  3,646
  2,684,524
  913,998
  2,595,472
  910,750
  44,420
  1,435
  29,227
  1,549
  15,405
  264
  2,684,524
  1,384,390
  2,595,472
  1,367,469
  44,420
  7,590
  29,227
  7,295
  15,405
  2,036
  2,684,524
  386,136
  2,595,472
  317,253
  44,420
  35,395
  29,227
  20,383
  15,405
  13,105
  2,684,524
  309,796
  2,595,472
  298,880
  44,420
  5,551
  29,227
  3,457
  15,405
  1,908
  2,684,524
  417,855
  2,595,472
  404,259
  44,420
  6,827
  29,227
  4,429
  15,405
  2,340
  2,684,524
  990,139
  2,595,472
  957,771
  44,420
  16,184
  29,227
  10,608
  15,405
  5,576
  2,684,524
  952,842
  2,595,472
  923,056
  44,420
  14,516
  29,227
  10,192
  15,405
  5,078
  2,684,524
  13,892
  2,595,472
  11,506
  44,420
  1,342
  29,227
  541
  15,405
  503
  2,684,524
  1,859,250
  2,595,472
  1,799,565
  44,420
  29,235
  29,227
  20,126
  15,405
  10,324
  2,684,524
  334,940
  2,595,472
  324,968
  44,420
  4,769
  29,227
  3,627
  15,405
  1,576
  2,684,524
  362,235
  2,595,472
  349,399
  44,420
  6,392
  29,227
  4,190
  15,405
  2,254
  2,684,524
  571,371
  2,595,472
  553,202
  44,420
  8,687
  29,227
  6,283
  15,405
  3,199
  2,684,524
  2,201,205
  2,595,472
  2,135,805
  44,420
  32,686
  29,227
  21,947
  15,405
  10,767
  2,684,524
  3,563
  2,595,472
  3,463
  44,420
  48
  29,227
  36
  15,405
  16
  2,684,524
  7,408
  2,595,472
  7,191
  44,420
  98
  29,227
  80
  15,405
  39
  2,684,524
  323,854
  2,595,472
  309,255
  44,420
  7,246
  29,227
  4,578
  15,405
  2,775
  2,684,524
  146,537
  2,595,472
  137,999
  44,420
  4,251
  29,227
  2,530
  15,405
  1,757
  2,684,524
  1,957
  2,595,472
  1,759
  44,420
  91
  29,227
  56
  15,405
  51
  2,684,524
  3,839
  2,595,472
  3,735
  44,420
  48
  29,227
  39
  15,405
  17
  2,684,524
  11,638
  2,595,472
  11,326
  44,420
  149
  29,227
  113
  15,405
  50
  2,684,524
  23,786
  2,595,472
  23,176
  44,420
  295
  29,227
  205
  15,405
  110
  2,684,524
  32,334
  2,595,472
  31,478
  44,420
  447
  29,227
  282
  15,405
  127
  2,684,524
  95,696
  2,595,472
  93,208
  44,420
  1,211
  29,227
  850
  15,405
  427
  2,684,524
  254,667
  2,595,472
  249,106
  44,420
  2,670
  29,227
  2,066
  15,405
  825
  2,684,524
  563,148
  2,595,472
  548,113
  44,420
  6,880
  29,227
  5,454
  15,405
  2,701
  2,684,524
  41,148
  2,595,472
  39,702
  44,420
  668
  29,227
  485
  15,405
  293
  2,684,524
  6,885
  2,595,472
  6,498
  44,420
  183
  29,227
  117
  15,405
  87
  2,684,524
  26,389
  2,595,472
  25,427
  44,420
  456
  29,227
  316
  15,405
  190
  2,684,524
  204,093
  2,595,472
  198,024
  44,420
  2,868
  29,227
  2,095
  15,405
  1,106
  2,684,524
  54,121
  2,595,472
  52,516
  44,420
  775
  29,227
  528
  15,405
  302
  2,684,524
  872
  2,595,472
  821
  44,420
  22
  29,227
  17
  15,405
  12
  2,684,524
  6,733
  2,595,472
  6,556
  44,420
  79
  29,227
  70
  15,405
  28
  2,684,524
  208,673
  2,595,472
  202,704
  44,420
  2,951
  29,227
  2,096
  15,405
  922
  2,684,524
  5,397
  2,595,472
  5,192
  44,420
  99
  29,227
  70
  15,405
  36
  2,684,524
  956,589
  2,595,472
  928,407
  44,420
  13,753
  29,227
  9,756
  15,405
  4,673
  2,684,524
  1,638,898
  2,595,472
  1,584,706
  44,420
  26,541
  29,227
  18,171
  15,405
  9,480

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/03b_an_descriptive_table_1MAIN.log
  log type:  text
 closed on:  23 Jan 2021, 02:43:20
-------------------------------------------------------------------------------
