-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/04a_an_descriptive_tables.log
  log type:  text
 opened on:  18 Jan 2021, 09:11:04

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. safetab covid_death_icu
 28. safetab covid_icu
 29. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death_icu non_covid_death {
 30. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    `outvar', col
 31.         safetab male                                                      
>       `outvar', col
 32.         safetab bmicat                                                    
>       `outvar', col m 
 33.         safetab smoke                                                     
>       `outvar', col m
 34.         safetab obese4cat                                                 
>       `outvar', col m 
 35.         safetab shield                                                    
>       `outvar', col m 
 36. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 37.         safetab `var'           `outvar', col
 38. }
 39.         
.         safetab imd                                                          
>    `outvar', col m
 40.         safetab ethnicity                                                 
>       `outvar', col m
 41.         *safetab urban                                                    
>       `outvar', col
.         safetab stp                                                          
>    `outvar', col
 42. }
 43. 
. 
. ********************************************
. *  Cumulative incidence of ONS NON COVID DEATH*
. ********************************************
. 
. use "$tempdir/cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.dt
> a", clear
 44. 
. sts list , at(0 80) by(agegroup male) fail
 45. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'.dta
> ", clear
 46. 
. sts list , at(0 80) by(agegroup male) fail
 47. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  9,326,419    41.97565    13.08294         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  1,980,114       21.23       21.23
     30-<40 |  2,229,218       23.90       45.13
     40-<50 |  2,020,752       21.67       66.80
     50-<60 |  2,059,973       22.09       88.89
     60-<70 |  1,036,362       11.11      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,326,419      100.00      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  4,798,485       51.45       51.45
          1 |  4,527,934       48.55      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    180,343        2.34        2.34
  Normal (18.5-24.9) |  2,884,639       37.45       39.80
Overweight (25-29.9) |  2,549,108       33.10       72.89
   Obese I (30-34.9) |  1,285,171       16.69       89.58
  Obese II (35-39.9) |    521,071        6.77       96.35
     Obese III (40+) |    281,299        3.65      100.00
---------------------+-----------------------------------
               Total |  7,701,631      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    180,343        1.93        1.93
  Normal (18.5-24.9) |  2,884,639       30.93       32.86
Overweight (25-29.9) |  2,549,108       27.33       60.20
   Obese I (30-34.9) |  1,285,171       13.78       73.98
  Obese II (35-39.9) |    521,071        5.59       79.56
     Obese III (40+) |    281,299        3.02       82.58
        Unknown (.u) |  1,624,788       17.42      100.00
---------------------+-----------------------------------
               Total |  9,326,419      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  7,238,878       77.62       77.62
   Obese I (30-34.9) |  1,285,171       13.78       91.40
  Obese II (35-39.9) |    521,071        5.59       96.98
     Obese III (40+) |    281,299        3.02      100.00
---------------------+-----------------------------------
               Total |  9,326,419      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  4,487,023       49.47       49.47
      Former |  2,682,821       29.58       79.05
     Current |  1,899,725       20.95      100.00
-------------+-----------------------------------
       Total |  9,069,569      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  4,487,023       48.11       48.11
      Former |  2,682,821       28.77       76.88
     Current |  1,899,725       20.37       97.25
Unknown (.u) |    256,850        2.75      100.00
-------------+-----------------------------------
       Total |  9,326,419      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  2,474,242       29.68       29.68
      Elevated |  1,346,308       16.15       45.82
 High, stage I |  2,932,831       35.18       81.00
High, stage II |  1,583,954       19.00      100.00
---------------+-----------------------------------
         Total |  8,337,335      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  2,474,242       26.53       26.53
      Elevated |  1,346,308       14.44       40.96
 High, stage I |  2,932,831       31.45       72.41
High, stage II |  1,583,954       16.98       89.39
       Unknown |    989,084       10.61      100.00
---------------+-----------------------------------
         Total |  9,326,419      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,107,605       76.21       76.21
          1 |  2,218,814       23.79      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,352,253       78.83       78.83
          1 |  1,974,166       21.17      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,130,361       97.90       97.90
          1 |    196,058        2.10      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,720,886       82.79       82.79
          1 |  1,605,533       17.21      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,052,291       97.06       97.06
          1 |    274,128        2.94      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  8,869,401       95.10       95.10
  T1DM, controlled |     13,021        0.14       95.24
T1DM, uncontrolled |     39,026        0.42       95.66
  T2DM, controlled |    224,757        2.41       98.07
T2DM, uncontrolled |    175,878        1.89       99.95
Diabetes, no HbA1c |      4,336        0.05      100.00
-------------------+-----------------------------------
             Total |  9,326,419      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  9,121,597       97.80       97.80
    Last year |     22,819        0.24       98.05
2-5 years ago |     66,001        0.71       98.76
     5+ years |    116,002        1.24      100.00
--------------+-----------------------------------
        Total |  9,326,419      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  9,296,658       99.68       99.68
    Last year |      2,426        0.03       99.71
2-5 years ago |      7,575        0.08       99.79
     5+ years |     19,760        0.21      100.00
--------------+-----------------------------------
        Total |  9,326,419      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,293,268       99.64       99.64
          1 |     33,151        0.36      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,324,212       99.98       99.98
          1 |      2,207        0.02      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,315,079       99.88       99.88
          1 |     11,340        0.12      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,272,160       99.42       99.42
          1 |     54,259        0.58      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,260,449       99.29       99.29
          1 |     65,970        0.71      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,249,937       99.18       99.18
          1 |     76,482        0.82      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,916        0.06        0.06
         15 |      5,423        0.08        0.14
         30 |     13,069        0.20        0.34
         45 |     82,869        1.26        1.60
         60 |  6,478,894       98.40      100.00
------------+-----------------------------------
      Total |  6,584,171      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  9,221,142       98.87       98.87
Stage 3a/3b egfr 30-60       |     95,938        1.03       99.90
           Stage 4/5 egfr<30 |      9,339        0.10      100.00
-----------------------------+-----------------------------------
                       Total |  9,326,419      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,314,930       99.88       99.88
          1 |     11,489        0.12      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,240,345       88.35       88.35
          1 |  1,086,074       11.65      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,905,525       95.49       95.49
          1 |    420,894        4.51      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  1,749,923       18.76       18.76
               2 |  1,820,254       19.52       38.28
               3 |  1,941,324       20.82       59.10
               4 |  2,009,353       21.54       80.64
 5 most deprived |  1,805,565       19.36      100.00
-----------------+-----------------------------------
           Total |  9,326,419      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  1,749,923       18.76       18.76
               2 |  1,820,254       19.52       38.28
               3 |  1,941,324       20.82       59.10
               4 |  2,009,353       21.54       80.64
 5 most deprived |  1,805,565       19.36      100.00
-----------------+-----------------------------------
           Total |  9,326,419      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,727,616       82.86       82.86
                 Mixed |    159,947        1.71       84.57
Asian or Asian British |    835,872        8.96       93.53
                 Black |    308,893        3.31       96.85
                 Other |    294,091        3.15      100.00
-----------------------+-----------------------------------
                 Total |  9,326,419      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,727,616       82.86       82.86
                 Mixed |    159,947        1.71       84.57
Asian or Asian British |    835,872        8.96       93.53
                 Black |    308,893        3.31       96.85
                 Other |    294,091        3.15      100.00
-----------------------+-----------------------------------
                 Total |  9,326,419      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,092        0.02        0.02
          2 |    924,525        9.91        9.94
          3 |    383,015        4.11       14.04
          4 |     80,907        0.87       14.91
          5 |     60,818        0.65       15.56
          6 |    439,277        4.71       20.27
          7 |     25,157        0.27       20.54
          8 |    329,212        3.53       24.07
          9 |    264,823        2.84       26.91
         10 |    372,361        3.99       30.90
         11 |    447,863        4.80       35.71
         12 |    148,586        1.59       37.30
         13 |    218,643        2.34       39.64
         14 |    262,706        2.82       42.46
         15 |    369,794        3.97       46.42
         16 |    323,698        3.47       49.90
         17 |    319,664        3.43       53.32
         18 |    411,753        4.41       57.74
         19 |    301,445        3.23       60.97
         20 |    426,592        4.57       65.54
         21 |    818,142        8.77       74.32
         22 |     51,014        0.55       74.86
         23 |    315,962        3.39       78.25
         24 |     16,131        0.17       78.42
         25 |     73,598        0.79       79.21
         26 |    256,933        2.75       81.97
         27 |    323,330        3.47       85.44
         28 |    283,426        3.04       88.47
         29 |    234,657        2.52       90.99
         30 |    189,730        2.03       93.02
         31 |     11,106        0.12       93.14
         32 |    639,459        6.86      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,311,262       99.84       99.84
          1 |     15,157        0.16      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,324,570       99.98       99.98
          1 |      1,849        0.02      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,035,603       96.88       96.88
          1 |    290,816        3.12      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,323,495       99.97       99.97
          1 |      2,924        0.03      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,324,878       99.98       99.98
          1 |      1,541        0.02      100.00
------------+-----------------------------------
      Total |  9,326,419      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,907,903     72,211 | 1,980,114 
           |     21.12      24.83 |     21.23 
-----------+----------------------+----------
    30-<40 | 2,161,853     67,365 | 2,229,218 
           |     23.93      23.16 |     23.90 
-----------+----------------------+----------
    40-<50 | 1,956,335     64,417 | 2,020,752 
           |     21.65      22.15 |     21.67 
-----------+----------------------+----------
    50-<60 | 1,996,994     62,979 | 2,059,973 
           |     22.10      21.66 |     22.09 
-----------+----------------------+----------
    60-<70 | 1,012,518     23,844 | 1,036,362 
           |     11.21       8.20 |     11.11 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 4,633,356    165,129 | 4,798,485 
           |     51.28      56.78 |     51.45 
-----------+----------------------+----------
         1 | 4,402,247    125,687 | 4,527,934 
           |     48.72      43.22 |     48.55 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   176,120      4,223 |   180,343 
                     |      1.95       1.45 |      1.93 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 2,804,790     79,849 | 2,884,639 
                     |     31.04      27.46 |     30.93 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,466,637     82,471 | 2,549,108 
                     |     27.30      28.36 |     27.33 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,237,703     47,468 | 1,285,171 
                     |     13.70      16.32 |     13.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   500,382     20,689 |   521,071 
                     |      5.54       7.11 |      5.59 
---------------------+----------------------+----------
     Obese III (40+) |   269,257     12,042 |   281,299 
                     |      2.98       4.14 |      3.02 
---------------------+----------------------+----------
        Unknown (.u) | 1,580,714     44,074 | 1,624,788 
                     |     17.49      15.16 |     17.42 
---------------------+----------------------+----------
               Total | 9,035,603    290,816 | 9,326,419 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,330,479    156,544 | 4,487,023 
             |     47.93      53.83 |     48.11 
-------------+----------------------+----------
      Former | 2,594,003     88,818 | 2,682,821 
             |     28.71      30.54 |     28.77 
-------------+----------------------+----------
     Current | 1,861,858     37,867 | 1,899,725 
             |     20.61      13.02 |     20.37 
-------------+----------------------+----------
Unknown (.u) |   249,263      7,587 |   256,850 
             |      2.76       2.61 |      2.75 
-------------+----------------------+----------
       Total | 9,035,603    290,816 | 9,326,419 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 7,028,261    210,617 | 7,238,878 
                     |     77.78      72.42 |     77.62 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,237,703     47,468 | 1,285,171 
                     |     13.70      16.32 |     13.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   500,382     20,689 |   521,071 
                     |      5.54       7.11 |      5.59 
---------------------+----------------------+----------
     Obese III (40+) |   269,257     12,042 |   281,299 
                     |      2.98       4.14 |      3.02 
---------------------+----------------------+----------
               Total | 9,035,603    290,816 | 9,326,419 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,127,943    224,310 | 7,352,253 
           |     78.89      77.13 |     78.83 
-----------+----------------------+----------
         1 | 1,907,660     66,506 | 1,974,166 
           |     21.11      22.87 |     21.17 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,845,764    284,597 | 9,130,361 
           |     97.90      97.86 |     97.90 
-----------+----------------------+----------
         1 |   189,839      6,219 |   196,058 
           |      2.10       2.14 |      2.10 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,485,047    235,839 | 7,720,886 
           |     82.84      81.10 |     82.79 
-----------+----------------------+----------
         1 | 1,550,556     54,977 | 1,605,533 
           |     17.16      18.90 |     17.21 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,771,195    281,096 | 9,052,291 
           |     97.07      96.66 |     97.06 
-----------+----------------------+----------
         1 |   264,408      9,720 |   274,128 
           |      2.93       3.34 |      2.94 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 8,597,062    272,339 | 8,869,401 
                   |     95.15      93.65 |     95.10 
-------------------+----------------------+----------
  T1DM, controlled |    12,616        405 |    13,021 
                   |      0.14       0.14 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    37,660      1,366 |    39,026 
                   |      0.42       0.47 |      0.42 
-------------------+----------------------+----------
  T2DM, controlled |   215,905      8,852 |   224,757 
                   |      2.39       3.04 |      2.41 
-------------------+----------------------+----------
T2DM, uncontrolled |   168,175      7,703 |   175,878 
                   |      1.86       2.65 |      1.89 
-------------------+----------------------+----------
Diabetes, no HbA1c |     4,185        151 |     4,336 
                   |      0.05       0.05 |      0.05 
-------------------+----------------------+----------
             Total | 9,035,603    290,816 | 9,326,419 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 8,836,796    284,801 | 9,121,597 
              |     97.80      97.93 |     97.80 
--------------+----------------------+----------
    Last year |    22,104        715 |    22,819 
              |      0.24       0.25 |      0.24 
--------------+----------------------+----------
2-5 years ago |    64,040      1,961 |    66,001 
              |      0.71       0.67 |      0.71 
--------------+----------------------+----------
     5+ years |   112,663      3,339 |   116,002 
              |      1.25       1.15 |      1.24 
--------------+----------------------+----------
        Total | 9,035,603    290,816 | 9,326,419 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 9,006,821    289,837 | 9,296,658 
              |     99.68      99.66 |     99.68 
--------------+----------------------+----------
    Last year |     2,325        101 |     2,426 
              |      0.03       0.03 |      0.03 
--------------+----------------------+----------
2-5 years ago |     7,299        276 |     7,575 
              |      0.08       0.09 |      0.08 
--------------+----------------------+----------
     5+ years |    19,158        602 |    19,760 
              |      0.21       0.21 |      0.21 
--------------+----------------------+----------
        Total | 9,035,603    290,816 | 9,326,419 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,003,603    289,665 | 9,293,268 
           |     99.65      99.60 |     99.64 
-----------+----------------------+----------
         1 |    32,000      1,151 |    33,151 
           |      0.35       0.40 |      0.36 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,033,499    290,713 | 9,324,212 
           |     99.98      99.96 |     99.98 
-----------+----------------------+----------
         1 |     2,104        103 |     2,207 
           |      0.02       0.04 |      0.02 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,024,621    290,458 | 9,315,079 
           |     99.88      99.88 |     99.88 
-----------+----------------------+----------
         1 |    10,982        358 |    11,340 
           |      0.12       0.12 |      0.12 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,983,123    289,037 | 9,272,160 
           |     99.42      99.39 |     99.42 
-----------+----------------------+----------
         1 |    52,480      1,779 |    54,259 
           |      0.58       0.61 |      0.58 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,971,517    288,932 | 9,260,449 
           |     99.29      99.35 |     99.29 
-----------+----------------------+----------
         1 |    64,086      1,884 |    65,970 
           |      0.71       0.65 |      0.71 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,961,706    288,231 | 9,249,937 
           |     99.18      99.11 |     99.18 
-----------+----------------------+----------
         1 |    73,897      2,585 |    76,482 
           |      0.82       0.89 |      0.82 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,505        411 |     3,916 
           |      0.06       0.18 |      0.06 
-----------+----------------------+----------
        15 |     5,133        290 |     5,423 
           |      0.08       0.13 |      0.08 
-----------+----------------------+----------
        30 |    12,559        510 |    13,069 
           |      0.20       0.23 |      0.20 
-----------+----------------------+----------
        45 |    80,293      2,576 |    82,869 
           |      1.26       1.15 |      1.26 
-----------+----------------------+----------
        60 | 6,259,027    219,867 | 6,478,894 
           |     98.40      98.31 |     98.40 
-----------+----------------------+----------
     Total | 6,360,517    223,654 | 6,584,171 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,024,900    290,030 | 9,314,930 
           |     99.88      99.73 |     99.88 
-----------+----------------------+----------
         1 |    10,703        786 |    11,489 
           |      0.12       0.27 |      0.12 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 8,934,113    287,029 | 9,221,142 
                      |     98.88      98.70 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |    92,852      3,086 |    95,938 
                      |      1.03       1.06 |      1.03 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |     8,638        701 |     9,339 
                      |      0.10       0.24 |      0.10 
----------------------+----------------------+----------
                Total | 9,035,603    290,816 | 9,326,419 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,986,322    254,023 | 8,240,345 
           |     88.39      87.35 |     88.35 
-----------+----------------------+----------
         1 | 1,049,281     36,793 | 1,086,074 
           |     11.61      12.65 |     11.65 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,628,632    276,893 | 8,905,525 
           |     95.50      95.21 |     95.49 
-----------+----------------------+----------
         1 |   406,971     13,923 |   420,894 
           |      4.50       4.79 |      4.51 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 1,701,770     48,153 | 1,749,923 
                 |     18.83      16.56 |     18.76 
-----------------+----------------------+----------
               2 | 1,769,566     50,688 | 1,820,254 
                 |     19.58      17.43 |     19.52 
-----------------+----------------------+----------
               3 | 1,885,812     55,512 | 1,941,324 
                 |     20.87      19.09 |     20.82 
-----------------+----------------------+----------
               4 | 1,943,205     66,148 | 2,009,353 
                 |     21.51      22.75 |     21.54 
-----------------+----------------------+----------
 5 most deprived | 1,735,250     70,315 | 1,805,565 
                 |     19.20      24.18 |     19.36 
-----------------+----------------------+----------
           Total | 9,035,603    290,816 | 9,326,419 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,503,367    224,249 | 7,727,616 
                      |     83.04      77.11 |     82.86 
----------------------+----------------------+----------
                Mixed |   154,958      4,989 |   159,947 
                      |      1.71       1.72 |      1.71 
----------------------+----------------------+----------
Asian or Asian Britis |   790,290     45,582 |   835,872 
                      |      8.75      15.67 |      8.96 
----------------------+----------------------+----------
                Black |   299,318      9,575 |   308,893 
                      |      3.31       3.29 |      3.31 
----------------------+----------------------+----------
                Other |   287,670      6,421 |   294,091 
                      |      3.18       2.21 |      3.15 
----------------------+----------------------+----------
                Total | 9,035,603    290,816 | 9,326,419 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,019         73 |     2,092 
           |      0.02       0.03 |      0.02 
-----------+----------------------+----------
         2 |   878,351     46,174 |   924,525 
           |      9.72      15.88 |      9.91 
-----------+----------------------+----------
         3 |   368,541     14,474 |   383,015 
           |      4.08       4.98 |      4.11 
-----------+----------------------+----------
         4 |    76,055      4,852 |    80,907 
           |      0.84       1.67 |      0.87 
-----------+----------------------+----------
         5 |    57,868      2,950 |    60,818 
           |      0.64       1.01 |      0.65 
-----------+----------------------+----------
         6 |   417,844     21,433 |   439,277 
           |      4.62       7.37 |      4.71 
-----------+----------------------+----------
         7 |    23,989      1,168 |    25,157 
           |      0.27       0.40 |      0.27 
-----------+----------------------+----------
         8 |   317,479     11,733 |   329,212 
           |      3.51       4.03 |      3.53 
-----------+----------------------+----------
         9 |   254,956      9,867 |   264,823 
           |      2.82       3.39 |      2.84 
-----------+----------------------+----------
        10 |   358,811     13,550 |   372,361 
           |      3.97       4.66 |      3.99 
-----------+----------------------+----------
        11 |   428,611     19,252 |   447,863 
           |      4.74       6.62 |      4.80 
-----------+----------------------+----------
        12 |   142,126      6,460 |   148,586 
           |      1.57       2.22 |      1.59 
-----------+----------------------+----------
        13 |   210,173      8,470 |   218,643 
           |      2.33       2.91 |      2.34 
-----------+----------------------+----------
        14 |   256,352      6,354 |   262,706 
           |      2.84       2.18 |      2.82 
-----------+----------------------+----------
        15 |   363,025      6,769 |   369,794 
           |      4.02       2.33 |      3.97 
-----------+----------------------+----------
        16 |   318,384      5,314 |   323,698 
           |      3.52       1.83 |      3.47 
-----------+----------------------+----------
        17 |   314,454      5,210 |   319,664 
           |      3.48       1.79 |      3.43 
-----------+----------------------+----------
        18 |   400,658     11,095 |   411,753 
           |      4.43       3.82 |      4.41 
-----------+----------------------+----------
        19 |   293,808      7,637 |   301,445 
           |      3.25       2.63 |      3.23 
-----------+----------------------+----------
        20 |   412,799     13,793 |   426,592 
           |      4.57       4.74 |      4.57 
-----------+----------------------+----------
        21 |   800,581     17,561 |   818,142 
           |      8.86       6.04 |      8.77 
-----------+----------------------+----------
        22 |    49,319      1,695 |    51,014 
           |      0.55       0.58 |      0.55 
-----------+----------------------+----------
        23 |   310,949      5,013 |   315,962 
           |      3.44       1.72 |      3.39 
-----------+----------------------+----------
        24 |    15,834        297 |    16,131 
           |      0.18       0.10 |      0.17 
-----------+----------------------+----------
        25 |    72,807        791 |    73,598 
           |      0.81       0.27 |      0.79 
-----------+----------------------+----------
        26 |   252,998      3,935 |   256,933 
           |      2.80       1.35 |      2.75 
-----------+----------------------+----------
        27 |   317,762      5,568 |   323,330 
           |      3.52       1.91 |      3.47 
-----------+----------------------+----------
        28 |   278,500      4,926 |   283,426 
           |      3.08       1.69 |      3.04 
-----------+----------------------+----------
        29 |   230,245      4,412 |   234,657 
           |      2.55       1.52 |      2.52 
-----------+----------------------+----------
        30 |   186,457      3,273 |   189,730 
           |      2.06       1.13 |      2.03 
-----------+----------------------+----------
        31 |    10,950        156 |    11,106 
           |      0.12       0.05 |      0.12 
-----------+----------------------+----------
        32 |   612,898     26,561 |   639,459 
           |      6.78       9.13 |      6.86 
-----------+----------------------+----------
     Total | 9,035,603    290,816 | 9,326,419 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |       icu/death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,980,060         54 | 1,980,114 
           |     21.24       1.85 |     21.23 
-----------+----------------------+----------
    30-<40 | 2,229,048        170 | 2,229,218 
           |     23.91       5.81 |     23.90 
-----------+----------------------+----------
    40-<50 | 2,020,273        479 | 2,020,752 
           |     21.67      16.38 |     21.67 
-----------+----------------------+----------
    50-<60 | 2,058,822      1,151 | 2,059,973 
           |     22.08      39.36 |     22.09 
-----------+----------------------+----------
    60-<70 | 1,035,292      1,070 | 1,036,362 
           |     11.10      36.59 |     11.11 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 4,797,482      1,003 | 4,798,485 
           |     51.46      34.30 |     51.45 
-----------+----------------------+----------
         1 | 4,526,013      1,921 | 4,527,934 
           |     48.54      65.70 |     48.55 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |       icu/death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   180,301         42 |   180,343 
                     |      1.93       1.44 |      1.93 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 2,884,240        399 | 2,884,639 
                     |     30.94      13.65 |     30.93 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,548,352        756 | 2,549,108 
                     |     27.33      25.85 |     27.33 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,284,468        703 | 1,285,171 
                     |     13.78      24.04 |     13.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   520,662        409 |   521,071 
                     |      5.58      13.99 |      5.59 
---------------------+----------------------+----------
     Obese III (40+) |   280,981        318 |   281,299 
                     |      3.01      10.88 |      3.02 
---------------------+----------------------+----------
        Unknown (.u) | 1,624,491        297 | 1,624,788 
                     |     17.42      10.16 |     17.42 
---------------------+----------------------+----------
               Total | 9,323,495      2,924 | 9,326,419 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |       icu/death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,485,727      1,296 | 4,487,023 
             |     48.11      44.32 |     48.11 
-------------+----------------------+----------
      Former | 2,681,570      1,251 | 2,682,821 
             |     28.76      42.78 |     28.77 
-------------+----------------------+----------
     Current | 1,899,356        369 | 1,899,725 
             |     20.37      12.62 |     20.37 
-------------+----------------------+----------
Unknown (.u) |   256,842          8 |   256,850 
             |      2.75       0.27 |      2.75 
-------------+----------------------+----------
       Total | 9,323,495      2,924 | 9,326,419 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |       icu/death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 7,237,384      1,494 | 7,238,878 
                     |     77.63      51.09 |     77.62 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,284,468        703 | 1,285,171 
                     |     13.78      24.04 |     13.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   520,662        409 |   521,071 
                     |      5.58      13.99 |      5.59 
---------------------+----------------------+----------
     Obese III (40+) |   280,981        318 |   281,299 
                     |      3.01      10.88 |      3.02 
---------------------+----------------------+----------
               Total | 9,323,495      2,924 | 9,326,419 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |       icu/death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,350,549      1,704 | 7,352,253 
           |     78.84      58.28 |     78.83 
-----------+----------------------+----------
         1 | 1,972,946      1,220 | 1,974,166 
           |     21.16      41.72 |     21.17 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |       icu/death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,127,850      2,511 | 9,130,361 
           |     97.90      85.88 |     97.90 
-----------+----------------------+----------
         1 |   195,645        413 |   196,058 
           |      2.10      14.12 |      2.10 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |       icu/death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,718,563      2,323 | 7,720,886 
           |     82.79      79.45 |     82.79 
-----------+----------------------+----------
         1 | 1,604,932        601 | 1,605,533 
           |     17.21      20.55 |     17.21 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |       icu/death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,049,861      2,430 | 9,052,291 
           |     97.07      83.11 |     97.06 
-----------+----------------------+----------
         1 |   273,634        494 |   274,128 
           |      2.93      16.89 |      2.94 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: covid
                   |       icu/death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 8,867,408      1,993 | 8,869,401 
                   |     95.11      68.16 |     95.10 
-------------------+----------------------+----------
  T1DM, controlled |    13,008         13 |    13,021 
                   |      0.14       0.44 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    38,978         48 |    39,026 
                   |      0.42       1.64 |      0.42 
-------------------+----------------------+----------
  T2DM, controlled |   224,358        399 |   224,757 
                   |      2.41      13.65 |      2.41 
-------------------+----------------------+----------
T2DM, uncontrolled |   175,418        460 |   175,878 
                   |      1.88      15.73 |      1.89 
-------------------+----------------------+----------
Diabetes, no HbA1c |     4,325         11 |     4,336 
                   |      0.05       0.38 |      0.05 
-------------------+----------------------+----------
             Total | 9,323,495      2,924 | 9,326,419 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |       icu/death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 9,118,897      2,700 | 9,121,597 
              |     97.81      92.34 |     97.80 
--------------+----------------------+----------
    Last year |    22,762         57 |    22,819 
              |      0.24       1.95 |      0.24 
--------------+----------------------+----------
2-5 years ago |    65,917         84 |    66,001 
              |      0.71       2.87 |      0.71 
--------------+----------------------+----------
     5+ years |   115,919         83 |   116,002 
              |      1.24       2.84 |      1.24 
--------------+----------------------+----------
        Total | 9,323,495      2,924 | 9,326,419 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |       icu/death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 9,293,813      2,845 | 9,296,658 
              |     99.68      97.30 |     99.68 
--------------+----------------------+----------
    Last year |     2,414         12 |     2,426 
              |      0.03       0.41 |      0.03 
--------------+----------------------+----------
2-5 years ago |     7,545         30 |     7,575 
              |      0.08       1.03 |      0.08 
--------------+----------------------+----------
     5+ years |    19,723         37 |    19,760 
              |      0.21       1.27 |      0.21 
--------------+----------------------+----------
        Total | 9,323,495      2,924 | 9,326,419 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |       icu/death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,290,383      2,885 | 9,293,268 
           |     99.64      98.67 |     99.64 
-----------+----------------------+----------
         1 |    33,112         39 |    33,151 
           |      0.36       1.33 |      0.36 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |    outcome: covid
     organ |       icu/death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,321,297      2,915 | 9,324,212 
           |     99.98      99.69 |     99.98 
-----------+----------------------+----------
         1 |     2,198          9 |     2,207 
           |      0.02       0.31 |      0.02 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,312,170      2,909 | 9,315,079 
           |     99.88      99.49 |     99.88 
-----------+----------------------+----------
         1 |    11,325         15 |    11,340 
           |      0.12       0.51 |      0.12 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,269,351      2,809 | 9,272,160 
           |     99.42      96.07 |     99.42 
-----------+----------------------+----------
         1 |    54,144        115 |    54,259 
           |      0.58       3.93 |      0.58 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |       icu/death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,257,631      2,818 | 9,260,449 
           |     99.29      96.37 |     99.29 
-----------+----------------------+----------
         1 |    65,864        106 |    65,970 
           |      0.71       3.63 |      0.71 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |       icu/death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,247,195      2,742 | 9,249,937 
           |     99.18      93.78 |     99.18 
-----------+----------------------+----------
         1 |    76,300        182 |    76,482 
           |      0.82       6.22 |      0.82 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |       icu/death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,864         52 |     3,916 
           |      0.06       1.91 |      0.06 
-----------+----------------------+----------
        15 |     5,369         54 |     5,423 
           |      0.08       1.99 |      0.08 
-----------+----------------------+----------
        30 |    12,981         88 |    13,069 
           |      0.20       3.24 |      0.20 
-----------+----------------------+----------
        45 |    82,713        156 |    82,869 
           |      1.26       5.74 |      1.26 
-----------+----------------------+----------
        60 | 6,476,528      2,366 | 6,478,894 
           |     98.41      87.11 |     98.40 
-----------+----------------------+----------
     Total | 6,581,455      2,716 | 6,584,171 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |    outcome: covid
     renal |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,312,107      2,823 | 9,314,930 
           |     99.88      96.55 |     99.88 
-----------+----------------------+----------
         1 |    11,388        101 |    11,489 
           |      0.12       3.45 |      0.12 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |       icu/death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 9,218,568      2,574 | 9,221,142 
                      |     98.87      88.03 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |    95,694        244 |    95,938 
                      |      1.03       8.34 |      1.03 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |     9,233        106 |     9,339 
                      |      0.10       3.63 |      0.10 
----------------------+----------------------+----------
                Total | 9,323,495      2,924 | 9,326,419 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |       icu/death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,238,701      1,644 | 8,240,345 
           |     88.36      56.22 |     88.35 
-----------+----------------------+----------
         1 | 1,084,794      1,280 | 1,086,074 
           |     11.64      43.78 |     11.65 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,902,843      2,682 | 8,905,525 
           |     95.49      91.72 |     95.49 
-----------+----------------------+----------
         1 |   420,652        242 |   420,894 
           |      4.51       8.28 |      4.51 
-----------+----------------------+----------
     Total | 9,323,495      2,924 | 9,326,419 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |       icu/death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 1,749,596        327 | 1,749,923 
                 |     18.77      11.18 |     18.76 
-----------------+----------------------+----------
               2 | 1,819,826        428 | 1,820,254 
                 |     19.52      14.64 |     19.52 
-----------------+----------------------+----------
               3 | 1,940,791        533 | 1,941,324 
                 |     20.82      18.23 |     20.82 
-----------------+----------------------+----------
               4 | 2,008,586        767 | 2,009,353 
                 |     21.54      26.23 |     21.54 
-----------------+----------------------+----------
 5 most deprived | 1,804,696        869 | 1,805,565 
                 |     19.36      29.72 |     19.36 
-----------------+----------------------+----------
           Total | 9,323,495      2,924 | 9,326,419 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |       icu/death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,725,593      2,023 | 7,727,616 
                      |     82.86      69.19 |     82.86 
----------------------+----------------------+----------
                Mixed |   159,881         66 |   159,947 
                      |      1.71       2.26 |      1.71 
----------------------+----------------------+----------
Asian or Asian Britis |   835,354        518 |   835,872 
                      |      8.96      17.72 |      8.96 
----------------------+----------------------+----------
                Black |   308,673        220 |   308,893 
                      |      3.31       7.52 |      3.31 
----------------------+----------------------+----------
                Other |   293,994         97 |   294,091 
                      |      3.15       3.32 |      3.15 
----------------------+----------------------+----------
                Total | 9,323,495      2,924 | 9,326,419 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp covid_death_icu REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 1,979,779        335 | 1,980,114 
           |     21.26       2.21 |     21.23 
-----------+----------------------+----------
    30-<40 | 2,228,375        843 | 2,229,218 
           |     23.93       5.56 |     23.90 
-----------+----------------------+----------
    40-<50 | 2,018,442      2,310 | 2,020,752 
           |     21.68      15.24 |     21.67 
-----------+----------------------+----------
    50-<60 | 2,054,113      5,860 | 2,059,973 
           |     22.06      38.66 |     22.09 
-----------+----------------------+----------
    60-<70 | 1,030,553      5,809 | 1,036,362 
           |     11.07      38.33 |     11.11 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 4,792,235      6,250 | 4,798,485 
           |     51.47      41.24 |     51.45 
-----------+----------------------+----------
         1 | 4,519,027      8,907 | 4,527,934 
           |     48.53      58.76 |     48.55 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   179,520        823 |   180,343 
                     |      1.93       5.43 |      1.93 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 2,880,116      4,523 | 2,884,639 
                     |     30.93      29.84 |     30.93 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,545,245      3,863 | 2,549,108 
                     |     27.34      25.49 |     27.33 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,282,798      2,373 | 1,285,171 
                     |     13.78      15.66 |     13.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   520,009      1,062 |   521,071 
                     |      5.58       7.01 |      5.59 
---------------------+----------------------+----------
     Obese III (40+) |   280,467        832 |   281,299 
                     |      3.01       5.49 |      3.02 
---------------------+----------------------+----------
        Unknown (.u) | 1,623,107      1,681 | 1,624,788 
                     |     17.43      11.09 |     17.42 
---------------------+----------------------+----------
               Total | 9,311,262     15,157 | 9,326,419 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 4,482,957      4,066 | 4,487,023 
             |     48.15      26.83 |     48.11 
-------------+----------------------+----------
      Former | 2,677,561      5,260 | 2,682,821 
             |     28.76      34.70 |     28.77 
-------------+----------------------+----------
     Current | 1,893,991      5,734 | 1,899,725 
             |     20.34      37.83 |     20.37 
-------------+----------------------+----------
Unknown (.u) |   256,753         97 |   256,850 
             |      2.76       0.64 |      2.75 
-------------+----------------------+----------
       Total | 9,311,262     15,157 | 9,326,419 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 7,227,988     10,890 | 7,238,878 
                     |     77.63      71.85 |     77.62 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,282,798      2,373 | 1,285,171 
                     |     13.78      15.66 |     13.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   520,009      1,062 |   521,071 
                     |      5.58       7.01 |      5.59 
---------------------+----------------------+----------
     Obese III (40+) |   280,467        832 |   281,299 
                     |      3.01       5.49 |      3.02 
---------------------+----------------------+----------
               Total | 9,311,262     15,157 | 9,326,419 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,346,816      5,437 | 7,352,253 
           |     78.90      35.87 |     78.83 
-----------+----------------------+----------
         1 | 1,964,446      9,720 | 1,974,166 
           |     21.10      64.13 |     21.17 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,117,857     12,504 | 9,130,361 
           |     97.92      82.50 |     97.90 
-----------+----------------------+----------
         1 |   193,405      2,653 |   196,058 
           |      2.08      17.50 |      2.10 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,708,528     12,358 | 7,720,886 
           |     82.79      81.53 |     82.79 
-----------+----------------------+----------
         1 | 1,602,734      2,799 | 1,605,533 
           |     17.21      18.47 |     17.21 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,039,833     12,458 | 9,052,291 
           |     97.08      82.19 |     97.06 
-----------+----------------------+----------
         1 |   271,429      2,699 |   274,128 
           |      2.92      17.81 |      2.94 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 8,857,300     12,101 | 8,869,401 
                   |     95.12      79.84 |     95.10 
-------------------+----------------------+----------
  T1DM, controlled |    12,927         94 |    13,021 
                   |      0.14       0.62 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    38,753        273 |    39,026 
                   |      0.42       1.80 |      0.42 
-------------------+----------------------+----------
  T2DM, controlled |   223,383      1,374 |   224,757 
                   |      2.40       9.07 |      2.41 
-------------------+----------------------+----------
T2DM, uncontrolled |   174,604      1,274 |   175,878 
                   |      1.88       8.41 |      1.89 
-------------------+----------------------+----------
Diabetes, no HbA1c |     4,295         41 |     4,336 
                   |      0.05       0.27 |      0.05 
-------------------+----------------------+----------
             Total | 9,311,262     15,157 | 9,326,419 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 9,111,139     10,458 | 9,121,597 
              |     97.85      69.00 |     97.80 
--------------+----------------------+----------
    Last year |    21,115      1,704 |    22,819 
              |      0.23      11.24 |      0.24 
--------------+----------------------+----------
2-5 years ago |    64,116      1,885 |    66,001 
              |      0.69      12.44 |      0.71 
--------------+----------------------+----------
     5+ years |   114,892      1,110 |   116,002 
              |      1.23       7.32 |      1.24 
--------------+----------------------+----------
        Total | 9,311,262     15,157 | 9,326,419 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 9,281,916     14,742 | 9,296,658 
              |     99.68      97.26 |     99.68 
--------------+----------------------+----------
    Last year |     2,315        111 |     2,426 
              |      0.02       0.73 |      0.03 
--------------+----------------------+----------
2-5 years ago |     7,432        143 |     7,575 
              |      0.08       0.94 |      0.08 
--------------+----------------------+----------
     5+ years |    19,599        161 |    19,760 
              |      0.21       1.06 |      0.21 
--------------+----------------------+----------
        Total | 9,311,262     15,157 | 9,326,419 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,278,311     14,957 | 9,293,268 
           |     99.65      98.68 |     99.64 
-----------+----------------------+----------
         1 |    32,951        200 |    33,151 
           |      0.35       1.32 |      0.36 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,309,097     15,115 | 9,324,212 
           |     99.98      99.72 |     99.98 
-----------+----------------------+----------
         1 |     2,165         42 |     2,207 
           |      0.02       0.28 |      0.02 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,300,055     15,024 | 9,315,079 
           |     99.88      99.12 |     99.88 
-----------+----------------------+----------
         1 |    11,207        133 |    11,340 
           |      0.12       0.88 |      0.12 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,258,467     13,693 | 9,272,160 
           |     99.43      90.34 |     99.42 
-----------+----------------------+----------
         1 |    52,795      1,464 |    54,259 
           |      0.57       9.66 |      0.58 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,245,907     14,542 | 9,260,449 
           |     99.30      95.94 |     99.29 
-----------+----------------------+----------
         1 |    65,355        615 |    65,970 
           |      0.70       4.06 |      0.71 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,235,878     14,059 | 9,249,937 
           |     99.19      92.76 |     99.18 
-----------+----------------------+----------
         1 |    75,384      1,098 |    76,482 
           |      0.81       7.24 |      0.82 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,706        210 |     3,916 
           |      0.06       1.52 |      0.06 
-----------+----------------------+----------
        15 |     5,189        234 |     5,423 
           |      0.08       1.69 |      0.08 
-----------+----------------------+----------
        30 |    12,753        316 |    13,069 
           |      0.19       2.29 |      0.20 
-----------+----------------------+----------
        45 |    82,193        676 |    82,869 
           |      1.25       4.90 |      1.26 
-----------+----------------------+----------
        60 | 6,466,523     12,371 | 6,478,894 
           |     98.42      89.60 |     98.40 
-----------+----------------------+----------
     Total | 6,570,364     13,807 | 6,584,171 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,300,067     14,863 | 9,314,930 
           |     99.88      98.06 |     99.88 
-----------+----------------------+----------
         1 |    11,195        294 |    11,489 
           |      0.12       1.94 |      0.12 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 9,207,421     13,721 | 9,221,142 
                      |     98.88      90.53 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |    94,946        992 |    95,938 
                      |      1.02       6.54 |      1.03 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |     8,895        444 |     9,339 
                      |      0.10       2.93 |      0.10 
----------------------+----------------------+----------
                Total | 9,311,262     15,157 | 9,326,419 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,230,294     10,051 | 8,240,345 
           |     88.39      66.31 |     88.35 
-----------+----------------------+----------
         1 | 1,080,968      5,106 | 1,086,074 
           |     11.61      33.69 |     11.65 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 8,891,544     13,981 | 8,905,525 
           |     95.49      92.24 |     95.49 
-----------+----------------------+----------
         1 |   419,718      1,176 |   420,894 
           |      4.51       7.76 |      4.51 
-----------+----------------------+----------
     Total | 9,311,262     15,157 | 9,326,419 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 1,747,957      1,966 | 1,749,923 
                 |     18.77      12.97 |     18.76 
-----------------+----------------------+----------
               2 | 1,817,858      2,396 | 1,820,254 
                 |     19.52      15.81 |     19.52 
-----------------+----------------------+----------
               3 | 1,938,480      2,844 | 1,941,324 
                 |     20.82      18.76 |     20.82 
-----------------+----------------------+----------
               4 | 2,005,773      3,580 | 2,009,353 
                 |     21.54      23.62 |     21.54 
-----------------+----------------------+----------
 5 most deprived | 1,801,194      4,371 | 1,805,565 
                 |     19.34      28.84 |     19.36 
-----------------+----------------------+----------
           Total | 9,311,262     15,157 | 9,326,419 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,713,852     13,764 | 7,727,616 
                      |     82.84      90.81 |     82.86 
----------------------+----------------------+----------
                Mixed |   159,805        142 |   159,947 
                      |      1.72       0.94 |      1.71 
----------------------+----------------------+----------
Asian or Asian Britis |   835,178        694 |   835,872 
                      |      8.97       4.58 |      8.96 
----------------------+----------------------+----------
                Black |   308,500        393 |   308,893 
                      |      3.31       2.59 |      3.31 
----------------------+----------------------+----------
                Other |   293,927        164 |   294,091 
                      |      3.16       1.08 |      3.15 
----------------------+----------------------+----------
                Total | 9,311,262     15,157 | 9,326,419 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp non_covid_death REDACTED DUE TO SMALL N**


         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.0e+06       32              0.0000    0.0000     0.0000    0.0000
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80    918103       98              0.0001    0.0000     0.0001    0.0001
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06      120              0.0001    0.0000     0.0001    0.0001
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.1e+06      169              0.0002    0.0000     0.0001    0.0002
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.0e+06      299              0.0003    0.0000     0.0003    0.0003
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.0e+06      419              0.0004    0.0000     0.0004    0.0005
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.0e+06      731              0.0007    0.0000     0.0007    0.0008
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.0e+06     1019              0.0010    0.0000     0.0009    0.0011
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    531347      669              0.0013    0.0000     0.0012    0.0014
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    500365     1012              0.0020    0.0001     0.0019    0.0021
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.0e+06     1760              0.0017    0.0000     0.0016    0.0018
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80    917497      897              0.0010    0.0000     0.0009    0.0010
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06     1972              0.0017    0.0000     0.0016    0.0018
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.1e+06     1237              0.0012    0.0000     0.0011    0.0012
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.0e+06     2100              0.0021    0.0000     0.0020    0.0022
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.0e+06     1606              0.0016    0.0000     0.0015    0.0017
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.0e+06     2345              0.0023    0.0000     0.0022    0.0024
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.0e+06     2053              0.0020    0.0000     0.0019    0.0021
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    530537      967              0.0018    0.0001     0.0017    0.0019
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    499530     1084              0.0022    0.0001     0.0020    0.0023
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  2,682,101     75.2375    6.929678         66        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    633,413       23.62       23.62
     70-<80 |  1,356,489       50.58       74.19
        80+ |    692,199       25.81      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    163,230        6.09        6.09
          1 |  2,518,871       93.91      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,443,799       53.83       53.83
          1 |  1,238,302       46.17      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     48,366        1.91        1.91
  Normal (18.5-24.9) |    799,338       31.59       33.50
Overweight (25-29.9) |    986,382       38.98       72.47
   Obese I (30-34.9) |    478,901       18.92       91.40
  Obese II (35-39.9) |    156,683        6.19       97.59
     Obese III (40+) |     61,072        2.41      100.00
---------------------+-----------------------------------
               Total |  2,530,742      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     48,366        1.80        1.80
  Normal (18.5-24.9) |    799,338       29.80       31.61
Overweight (25-29.9) |    986,382       36.78       68.38
   Obese I (30-34.9) |    478,901       17.86       86.24
  Obese II (35-39.9) |    156,683        5.84       92.08
     Obese III (40+) |     61,072        2.28       94.36
        Unknown (.u) |    151,359        5.64      100.00
---------------------+-----------------------------------
               Total |  2,682,101      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  1,985,445       74.03       74.03
   Obese I (30-34.9) |    478,901       17.86       91.88
  Obese II (35-39.9) |    156,683        5.84       97.72
     Obese III (40+) |     61,072        2.28      100.00
---------------------+-----------------------------------
               Total |  2,682,101      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,059,595       39.60       39.60
      Former |  1,394,085       52.10       91.70
     Current |    222,030        8.30      100.00
-------------+-----------------------------------
       Total |  2,675,710      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,059,595       39.51       39.51
      Former |  1,394,085       51.98       91.48
     Current |    222,030        8.28       99.76
Unknown (.u) |      6,391        0.24      100.00
-------------+-----------------------------------
       Total |  2,682,101      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    309,534       11.60       11.60
      Elevated |    417,539       15.65       27.25
 High, stage I |    989,247       37.08       64.32
High, stage II |    951,910       35.68      100.00
---------------+-----------------------------------
         Total |  2,668,230      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    309,534       11.54       11.54
      Elevated |    417,539       15.57       27.11
 High, stage I |    989,247       36.88       63.99
High, stage II |    951,910       35.49       99.48
       Unknown |     13,871        0.52      100.00
---------------+-----------------------------------
         Total |  2,682,101      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    824,922       30.76       30.76
          1 |  1,857,179       69.24      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,727,154       64.40       64.40
          1 |    954,947       35.60      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,347,661       87.53       87.53
          1 |    334,440       12.47      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,320,244       86.51       86.51
          1 |    361,857       13.49      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,111,770       78.74       78.74
          1 |    570,331       21.26      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,199,149       81.99       81.99
  T1DM, controlled |      3,558        0.13       82.13
T1DM, uncontrolled |      7,399        0.28       82.40
  T2DM, controlled |    323,582       12.06       94.47
T2DM, uncontrolled |    146,460        5.46       99.93
Diabetes, no HbA1c |      1,953        0.07      100.00
-------------------+-----------------------------------
             Total |  2,682,101      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,299,780       85.75       85.75
    Last year |     32,296        1.20       86.95
2-5 years ago |     95,600        3.56       90.51
     5+ years |    254,425        9.49      100.00
--------------+-----------------------------------
        Total |  2,682,101      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,642,874       98.54       98.54
    Last year |      3,837        0.14       98.68
2-5 years ago |     11,627        0.43       99.11
     5+ years |     23,763        0.89      100.00
--------------+-----------------------------------
        Total |  2,682,101      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,676,707       99.80       99.80
          1 |      5,394        0.20      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,681,230       99.97       99.97
          1 |        871        0.03      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,675,377       99.75       99.75
          1 |      6,724        0.25      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,655,785       99.02       99.02
          1 |     26,316        0.98      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,628,098       97.99       97.99
          1 |     54,003        2.01      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,478,648       92.41       92.41
          1 |    203,453        7.59      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,075        0.24        0.24
         15 |     35,031        1.37        1.61
         30 |    149,413        5.84        7.45
         45 |    413,092       16.15       23.60
         60 |  1,953,964       76.40      100.00
------------+-----------------------------------
      Total |  2,557,575      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,078,490       77.49       77.49
Stage 3a/3b egfr 30-60       |    562,505       20.97       98.47
           Stage 4/5 egfr<30 |     41,106        1.53      100.00
-----------------------------+-----------------------------------
                       Total |  2,682,101      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,675,241       99.74       99.74
          1 |      6,860        0.26      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,193,129       44.48       44.48
          1 |  1,488,972       55.52      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,473,684       92.23       92.23
          1 |    208,417        7.77      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    659,466       24.59       24.59
               2 |    619,004       23.08       47.67
               3 |    580,115       21.63       69.30
               4 |    477,227       17.79       87.09
 5 most deprived |    346,289       12.91      100.00
-----------------+-----------------------------------
           Total |  2,682,101      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    659,466       24.59       24.59
               2 |    619,004       23.08       47.67
               3 |    580,115       21.63       69.30
               4 |    477,227       17.79       87.09
 5 most deprived |    346,289       12.91      100.00
-----------------+-----------------------------------
           Total |  2,682,101      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,531,631       94.39       94.39
                 Mixed |      9,964        0.37       94.76
Asian or Asian British |     90,934        3.39       98.15
                 Black |     27,792        1.04       99.19
                 Other |     21,780        0.81      100.00
-----------------------+-----------------------------------
                 Total |  2,682,101      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,531,631       94.39       94.39
                 Mixed |      9,964        0.37       94.76
Asian or Asian British |     90,934        3.39       98.15
                 Black |     27,792        1.04       99.19
                 Other |     21,780        0.81      100.00
-----------------------+-----------------------------------
                 Total |  2,682,101      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        189        0.01        0.01
          2 |    234,789        8.75        8.76
          3 |    115,263        4.30       13.06
          4 |     26,251        0.98       14.04
          5 |     17,409        0.65       14.69
          6 |    133,373        4.97       19.66
          7 |      6,554        0.24       19.90
          8 |    105,302        3.93       23.83
          9 |    100,663        3.75       27.58
         10 |    117,161        4.37       31.95
         11 |    123,100        4.59       36.54
         12 |     31,473        1.17       37.71
         13 |     56,729        2.12       39.83
         14 |     69,804        2.60       42.43
         15 |     95,922        3.58       46.01
         16 |    130,590        4.87       50.88
         17 |    114,029        4.25       55.13
         18 |     89,948        3.35       58.48
         19 |     76,632        2.86       61.34
         20 |    127,072        4.74       66.08
         21 |    118,664        4.42       70.50
         22 |      7,143        0.27       70.77
         23 |     90,644        3.38       74.15
         24 |      5,078        0.19       74.34
         25 |     24,106        0.90       75.24
         26 |    100,519        3.75       78.98
         27 |     91,927        3.43       82.41
         28 |    115,592        4.31       86.72
         29 |     65,630        2.45       89.17
         30 |     63,408        2.36       91.53
         31 |      3,772        0.14       91.67
         32 |    223,365        8.33      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,612,391       97.40       97.40
          1 |     69,710        2.60      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,671,268       99.60       99.60
          1 |     10,833        0.40      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,628,539       98.00       98.00
          1 |     53,562        2.00      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,670,968       99.58       99.58
          1 |     11,133        0.42      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,681,389       99.97       99.97
          1 |        712        0.03      100.00
------------+-----------------------------------
      Total |  2,682,101      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   622,762     10,651 |   633,413 
           |     23.69      19.89 |     23.62 
-----------+----------------------+----------
    70-<80 | 1,334,462     22,027 | 1,356,489 
           |     50.77      41.12 |     50.58 
-----------+----------------------+----------
       80+ |   671,315     20,884 |   692,199 
           |     25.54      38.99 |     25.81 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,416,847     26,952 | 1,443,799 
           |     53.90      50.32 |     53.83 
-----------+----------------------+----------
         1 | 1,211,692     26,610 | 1,238,302 
           |     46.10      49.68 |     46.17 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    46,826      1,540 |    48,366 
                     |      1.78       2.88 |      1.80 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   784,512     14,826 |   799,338 
                     |     29.85      27.68 |     29.80 
---------------------+----------------------+----------
Overweight (25-29.9) |   967,752     18,630 |   986,382 
                     |     36.82      34.78 |     36.78 
---------------------+----------------------+----------
   Obese I (30-34.9) |   468,249     10,652 |   478,901 
                     |     17.81      19.89 |     17.86 
---------------------+----------------------+----------
  Obese II (35-39.9) |   152,802      3,881 |   156,683 
                     |      5.81       7.25 |      5.84 
---------------------+----------------------+----------
     Obese III (40+) |    59,393      1,679 |    61,072 
                     |      2.26       3.13 |      2.28 
---------------------+----------------------+----------
        Unknown (.u) |   149,005      2,354 |   151,359 
                     |      5.67       4.39 |      5.64 
---------------------+----------------------+----------
               Total | 2,628,539     53,562 | 2,682,101 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,040,902     18,693 | 1,059,595 
             |     39.60      34.90 |     39.51 
-------------+----------------------+----------
      Former | 1,362,757     31,328 | 1,394,085 
             |     51.84      58.49 |     51.98 
-------------+----------------------+----------
     Current |   218,563      3,467 |   222,030 
             |      8.31       6.47 |      8.28 
-------------+----------------------+----------
Unknown (.u) |     6,317         74 |     6,391 
             |      0.24       0.14 |      0.24 
-------------+----------------------+----------
       Total | 2,628,539     53,562 | 2,682,101 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 1,948,095     37,350 | 1,985,445 
                     |     74.11      69.73 |     74.03 
---------------------+----------------------+----------
   Obese I (30-34.9) |   468,249     10,652 |   478,901 
                     |     17.81      19.89 |     17.86 
---------------------+----------------------+----------
  Obese II (35-39.9) |   152,802      3,881 |   156,683 
                     |      5.81       7.25 |      5.84 
---------------------+----------------------+----------
     Obese III (40+) |    59,393      1,679 |    61,072 
                     |      2.26       3.13 |      2.28 
---------------------+----------------------+----------
               Total | 2,628,539     53,562 | 2,682,101 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,698,135     29,019 | 1,727,154 
           |     64.60      54.18 |     64.40 
-----------+----------------------+----------
         1 |   930,404     24,543 |   954,947 
           |     35.40      45.82 |     35.60 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,305,137     42,524 | 2,347,661 
           |     87.70      79.39 |     87.53 
-----------+----------------------+----------
         1 |   323,402     11,038 |   334,440 
           |     12.30      20.61 |     12.47 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,275,420     44,824 | 2,320,244 
           |     86.57      83.69 |     86.51 
-----------+----------------------+----------
         1 |   353,119      8,738 |   361,857 
           |     13.43      16.31 |     13.49 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,076,238     35,532 | 2,111,770 
           |     78.99      66.34 |     78.74 
-----------+----------------------+----------
         1 |   552,301     18,030 |   570,331 
           |     21.01      33.66 |     21.26 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,160,585     38,564 | 2,199,149 
                   |     82.20      72.00 |     81.99 
-------------------+----------------------+----------
  T1DM, controlled |     3,450        108 |     3,558 
                   |      0.13       0.20 |      0.13 
-------------------+----------------------+----------
T1DM, uncontrolled |     7,142        257 |     7,399 
                   |      0.27       0.48 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   314,164      9,418 |   323,582 
                   |     11.95      17.58 |     12.06 
-------------------+----------------------+----------
T2DM, uncontrolled |   141,300      5,160 |   146,460 
                   |      5.38       9.63 |      5.46 
-------------------+----------------------+----------
Diabetes, no HbA1c |     1,898         55 |     1,953 
                   |      0.07       0.10 |      0.07 
-------------------+----------------------+----------
             Total | 2,628,539     53,562 | 2,682,101 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,254,848     44,932 | 2,299,780 
              |     85.78      83.89 |     85.75 
--------------+----------------------+----------
    Last year |    31,439        857 |    32,296 
              |      1.20       1.60 |      1.20 
--------------+----------------------+----------
2-5 years ago |    93,527      2,073 |    95,600 
              |      3.56       3.87 |      3.56 
--------------+----------------------+----------
     5+ years |   248,725      5,700 |   254,425 
              |      9.46      10.64 |      9.49 
--------------+----------------------+----------
        Total | 2,628,539     53,562 | 2,682,101 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,590,529     52,345 | 2,642,874 
              |     98.55      97.73 |     98.54 
--------------+----------------------+----------
    Last year |     3,706        131 |     3,837 
              |      0.14       0.24 |      0.14 
--------------+----------------------+----------
2-5 years ago |    11,255        372 |    11,627 
              |      0.43       0.69 |      0.43 
--------------+----------------------+----------
     5+ years |    23,049        714 |    23,763 
              |      0.88       1.33 |      0.89 
--------------+----------------------+----------
        Total | 2,628,539     53,562 | 2,682,101 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,623,292     53,415 | 2,676,707 
           |     99.80      99.73 |     99.80 
-----------+----------------------+----------
         1 |     5,247        147 |     5,394 
           |      0.20       0.27 |      0.20 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,627,704     53,526 | 2,681,230 
           |     99.97      99.93 |     99.97 
-----------+----------------------+----------
         1 |       835         36 |       871 
           |      0.03       0.07 |      0.03 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,622,000     53,377 | 2,675,377 
           |     99.75      99.65 |     99.75 
-----------+----------------------+----------
         1 |     6,539        185 |     6,724 
           |      0.25       0.35 |      0.25 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,603,097     52,688 | 2,655,785 
           |     99.03      98.37 |     99.02 
-----------+----------------------+----------
         1 |    25,442        874 |    26,316 
           |      0.97       1.63 |      0.98 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,576,661     51,437 | 2,628,098 
           |     98.03      96.03 |     97.99 
-----------+----------------------+----------
         1 |    51,878      2,125 |    54,003 
           |      1.97       3.97 |      2.01 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,433,111     45,537 | 2,478,648 
           |     92.57      85.02 |     92.41 
-----------+----------------------+----------
         1 |   195,428      8,025 |   203,453 
           |      7.43      14.98 |      7.59 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,520        555 |     6,075 
           |      0.22       1.06 |      0.24 
-----------+----------------------+----------
        15 |    33,281      1,750 |    35,031 
           |      1.33       3.34 |      1.37 
-----------+----------------------+----------
        30 |   144,028      5,385 |   149,413 
           |      5.75      10.27 |      5.84 
-----------+----------------------+----------
        45 |   403,189      9,903 |   413,092 
           |     16.09      18.89 |     16.15 
-----------+----------------------+----------
        60 | 1,919,129     34,835 | 1,953,964 
           |     76.61      66.44 |     76.40 
-----------+----------------------+----------
     Total | 2,505,147     52,428 | 2,557,575 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,622,225     53,016 | 2,675,241 
           |     99.76      98.98 |     99.74 
-----------+----------------------+----------
         1 |     6,314        546 |     6,860 
           |      0.24       1.02 |      0.26 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,042,521     35,969 | 2,078,490 
                      |     77.71      67.15 |     77.49 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   547,217     15,288 |   562,505 
                      |     20.82      28.54 |     20.97 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    38,801      2,305 |    41,106 
                      |      1.48       4.30 |      1.53 
----------------------+----------------------+----------
                Total | 2,628,539     53,562 | 2,682,101 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,174,170     18,959 | 1,193,129 
           |     44.67      35.40 |     44.48 
-----------+----------------------+----------
         1 | 1,454,369     34,603 | 1,488,972 
           |     55.33      64.60 |     55.52 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,425,083     48,601 | 2,473,684 
           |     92.26      90.74 |     92.23 
-----------+----------------------+----------
         1 |   203,456      4,961 |   208,417 
           |      7.74       9.26 |      7.77 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   649,856      9,610 |   659,466 
                 |     24.72      17.94 |     24.59 
-----------------+----------------------+----------
               2 |   608,645     10,359 |   619,004 
                 |     23.16      19.34 |     23.08 
-----------------+----------------------+----------
               3 |   569,667     10,448 |   580,115 
                 |     21.67      19.51 |     21.63 
-----------------+----------------------+----------
               4 |   465,678     11,549 |   477,227 
                 |     17.72      21.56 |     17.79 
-----------------+----------------------+----------
 5 most deprived |   334,693     11,596 |   346,289 
                 |     12.73      21.65 |     12.91 
-----------------+----------------------+----------
           Total | 2,628,539     53,562 | 2,682,101 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,483,475     48,156 | 2,531,631 
                      |     94.48      89.91 |     94.39 
----------------------+----------------------+----------
                Mixed |     9,755        209 |     9,964 
                      |      0.37       0.39 |      0.37 
----------------------+----------------------+----------
Asian or Asian Britis |    86,861      4,073 |    90,934 
                      |      3.30       7.60 |      3.39 
----------------------+----------------------+----------
                Black |    27,089        703 |    27,792 
                      |      1.03       1.31 |      1.04 
----------------------+----------------------+----------
                Other |    21,359        421 |    21,780 
                      |      0.81       0.79 |      0.81 
----------------------+----------------------+----------
                Total | 2,628,539     53,562 | 2,682,101 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       183          6 |       189 
           |      0.01       0.01 |      0.01 
-----------+----------------------+----------
         2 |   228,011      6,778 |   234,789 
           |      8.67      12.65 |      8.75 
-----------+----------------------+----------
         3 |   112,745      2,518 |   115,263 
           |      4.29       4.70 |      4.30 
-----------+----------------------+----------
         4 |    25,316        935 |    26,251 
           |      0.96       1.75 |      0.98 
-----------+----------------------+----------
         5 |    16,809        600 |    17,409 
           |      0.64       1.12 |      0.65 
-----------+----------------------+----------
         6 |   129,070      4,303 |   133,373 
           |      4.91       8.03 |      4.97 
-----------+----------------------+----------
         7 |     6,346        208 |     6,554 
           |      0.24       0.39 |      0.24 
-----------+----------------------+----------
         8 |   102,888      2,414 |   105,302 
           |      3.91       4.51 |      3.93 
-----------+----------------------+----------
         9 |    97,796      2,867 |   100,663 
           |      3.72       5.35 |      3.75 
-----------+----------------------+----------
        10 |   114,540      2,621 |   117,161 
           |      4.36       4.89 |      4.37 
-----------+----------------------+----------
        11 |   120,275      2,825 |   123,100 
           |      4.58       5.27 |      4.59 
-----------+----------------------+----------
        12 |    30,243      1,230 |    31,473 
           |      1.15       2.30 |      1.17 
-----------+----------------------+----------
        13 |    55,125      1,604 |    56,729 
           |      2.10       2.99 |      2.12 
-----------+----------------------+----------
        14 |    68,470      1,334 |    69,804 
           |      2.60       2.49 |      2.60 
-----------+----------------------+----------
        15 |    94,821      1,101 |    95,922 
           |      3.61       2.06 |      3.58 
-----------+----------------------+----------
        16 |   129,451      1,139 |   130,590 
           |      4.92       2.13 |      4.87 
-----------+----------------------+----------
        17 |   112,843      1,186 |   114,029 
           |      4.29       2.21 |      4.25 
-----------+----------------------+----------
        18 |    87,907      2,041 |    89,948 
           |      3.34       3.81 |      3.35 
-----------+----------------------+----------
        19 |    75,479      1,153 |    76,632 
           |      2.87       2.15 |      2.86 
-----------+----------------------+----------
        20 |   124,054      3,018 |   127,072 
           |      4.72       5.63 |      4.74 
-----------+----------------------+----------
        21 |   115,902      2,762 |   118,664 
           |      4.41       5.16 |      4.42 
-----------+----------------------+----------
        22 |     6,957        186 |     7,143 
           |      0.26       0.35 |      0.27 
-----------+----------------------+----------
        23 |    89,682        962 |    90,644 
           |      3.41       1.80 |      3.38 
-----------+----------------------+----------
        24 |     5,009         69 |     5,078 
           |      0.19       0.13 |      0.19 
-----------+----------------------+----------
        25 |    23,990        116 |    24,106 
           |      0.91       0.22 |      0.90 
-----------+----------------------+----------
        26 |    99,558        961 |   100,519 
           |      3.79       1.79 |      3.75 
-----------+----------------------+----------
        27 |    91,073        854 |    91,927 
           |      3.46       1.59 |      3.43 
-----------+----------------------+----------
        28 |   114,650        942 |   115,592 
           |      4.36       1.76 |      4.31 
-----------+----------------------+----------
        29 |    64,874        756 |    65,630 
           |      2.47       1.41 |      2.45 
-----------+----------------------+----------
        30 |    62,736        672 |    63,408 
           |      2.39       1.25 |      2.36 
-----------+----------------------+----------
        31 |     3,742         30 |     3,772 
           |      0.14       0.06 |      0.14 
-----------+----------------------+----------
        32 |   217,994      5,371 |   223,365 
           |      8.29      10.03 |      8.33 
-----------+----------------------+----------
     Total | 2,628,539     53,562 | 2,682,101 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |       icu/death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   632,519        894 |   633,413 
           |     23.68       8.03 |     23.62 
-----------+----------------------+----------
    70-<80 | 1,352,911      3,578 | 1,356,489 
           |     50.65      32.14 |     50.58 
-----------+----------------------+----------
       80+ |   685,538      6,661 |   692,199 
           |     25.67      59.83 |     25.81 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,439,241      4,558 | 1,443,799 
           |     53.88      40.94 |     53.83 
-----------+----------------------+----------
         1 | 1,231,727      6,575 | 1,238,302 
           |     46.12      59.06 |     46.17 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |       icu/death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    47,953        413 |    48,366 
                     |      1.80       3.71 |      1.80 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   795,993      3,345 |   799,338 
                     |     29.80      30.05 |     29.80 
---------------------+----------------------+----------
Overweight (25-29.9) |   982,974      3,408 |   986,382 
                     |     36.80      30.61 |     36.78 
---------------------+----------------------+----------
   Obese I (30-34.9) |   476,810      2,091 |   478,901 
                     |     17.85      18.78 |     17.86 
---------------------+----------------------+----------
  Obese II (35-39.9) |   155,845        838 |   156,683 
                     |      5.83       7.53 |      5.84 
---------------------+----------------------+----------
     Obese III (40+) |    60,682        390 |    61,072 
                     |      2.27       3.50 |      2.28 
---------------------+----------------------+----------
        Unknown (.u) |   150,711        648 |   151,359 
                     |      5.64       5.82 |      5.64 
---------------------+----------------------+----------
               Total | 2,670,968     11,133 | 2,682,101 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |       icu/death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,056,370      3,225 | 1,059,595 
             |     39.55      28.97 |     39.51 
-------------+----------------------+----------
      Former | 1,386,984      7,101 | 1,394,085 
             |     51.93      63.78 |     51.98 
-------------+----------------------+----------
     Current |   221,244        786 |   222,030 
             |      8.28       7.06 |      8.28 
-------------+----------------------+----------
Unknown (.u) |     6,370         21 |     6,391 
             |      0.24       0.19 |      0.24 
-------------+----------------------+----------
       Total | 2,670,968     11,133 | 2,682,101 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |       icu/death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 1,977,631      7,814 | 1,985,445 
                     |     74.04      70.19 |     74.03 
---------------------+----------------------+----------
   Obese I (30-34.9) |   476,810      2,091 |   478,901 
                     |     17.85      18.78 |     17.86 
---------------------+----------------------+----------
  Obese II (35-39.9) |   155,845        838 |   156,683 
                     |      5.83       7.53 |      5.84 
---------------------+----------------------+----------
     Obese III (40+) |    60,682        390 |    61,072 
                     |      2.27       3.50 |      2.28 
---------------------+----------------------+----------
               Total | 2,670,968     11,133 | 2,682,101 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |       icu/death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,721,817      5,337 | 1,727,154 
           |     64.46      47.94 |     64.40 
-----------+----------------------+----------
         1 |   949,151      5,796 |   954,947 
           |     35.54      52.06 |     35.60 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |       icu/death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,339,490      8,171 | 2,347,661 
           |     87.59      73.39 |     87.53 
-----------+----------------------+----------
         1 |   331,478      2,962 |   334,440 
           |     12.41      26.61 |     12.47 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |       icu/death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,310,819      9,425 | 2,320,244 
           |     86.52      84.66 |     86.51 
-----------+----------------------+----------
         1 |   360,149      1,708 |   361,857 
           |     13.48      15.34 |     13.49 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |       icu/death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,105,566      6,204 | 2,111,770 
           |     78.83      55.73 |     78.74 
-----------+----------------------+----------
         1 |   565,402      4,929 |   570,331 
           |     21.17      44.27 |     21.26 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: covid
                   |       icu/death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,191,941      7,208 | 2,199,149 
                   |     82.07      64.74 |     81.99 
-------------------+----------------------+----------
  T1DM, controlled |     3,524         34 |     3,558 
                   |      0.13       0.31 |      0.13 
-------------------+----------------------+----------
T1DM, uncontrolled |     7,325         74 |     7,399 
                   |      0.27       0.66 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   321,223      2,359 |   323,582 
                   |     12.03      21.19 |     12.06 
-------------------+----------------------+----------
T2DM, uncontrolled |   145,014      1,446 |   146,460 
                   |      5.43      12.99 |      5.46 
-------------------+----------------------+----------
Diabetes, no HbA1c |     1,941         12 |     1,953 
                   |      0.07       0.11 |      0.07 
-------------------+----------------------+----------
             Total | 2,670,968     11,133 | 2,682,101 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |       icu/death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,290,774      9,006 | 2,299,780 
              |     85.77      80.89 |     85.75 
--------------+----------------------+----------
    Last year |    32,018        278 |    32,296 
              |      1.20       2.50 |      1.20 
--------------+----------------------+----------
2-5 years ago |    95,076        524 |    95,600 
              |      3.56       4.71 |      3.56 
--------------+----------------------+----------
     5+ years |   253,100      1,325 |   254,425 
              |      9.48      11.90 |      9.49 
--------------+----------------------+----------
        Total | 2,670,968     11,133 | 2,682,101 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |       icu/death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,632,113     10,761 | 2,642,874 
              |     98.55      96.66 |     98.54 
--------------+----------------------+----------
    Last year |     3,794         43 |     3,837 
              |      0.14       0.39 |      0.14 
--------------+----------------------+----------
2-5 years ago |    11,496        131 |    11,627 
              |      0.43       1.18 |      0.43 
--------------+----------------------+----------
     5+ years |    23,565        198 |    23,763 
              |      0.88       1.78 |      0.89 
--------------+----------------------+----------
        Total | 2,670,968     11,133 | 2,682,101 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |       icu/death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,665,622     11,085 | 2,676,707 
           |     99.80      99.57 |     99.80 
-----------+----------------------+----------
         1 |     5,346         48 |     5,394 
           |      0.20       0.43 |      0.20 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |    outcome: covid
     organ |       icu/death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,670,109     11,121 | 2,681,230 
           |     99.97      99.89 |     99.97 
-----------+----------------------+----------
         1 |       859         12 |       871 
           |      0.03       0.11 |      0.03 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,664,278     11,099 | 2,675,377 
           |     99.75      99.69 |     99.75 
-----------+----------------------+----------
         1 |     6,690         34 |     6,724 
           |      0.25       0.31 |      0.25 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,644,884     10,901 | 2,655,785 
           |     99.02      97.92 |     99.02 
-----------+----------------------+----------
         1 |    26,084        232 |    26,316 
           |      0.98       2.08 |      0.98 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |       icu/death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,617,593     10,505 | 2,628,098 
           |     98.00      94.36 |     97.99 
-----------+----------------------+----------
         1 |    53,375        628 |    54,003 
           |      2.00       5.64 |      2.01 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |       icu/death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,469,827      8,821 | 2,478,648 
           |     92.47      79.23 |     92.41 
-----------+----------------------+----------
         1 |   201,141      2,312 |   203,453 
           |      7.53      20.77 |      7.59 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |       icu/death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,885        190 |     6,075 
           |      0.23       1.74 |      0.24 
-----------+----------------------+----------
        15 |    34,257        774 |    35,031 
           |      1.35       7.08 |      1.37 
-----------+----------------------+----------
        30 |   147,592      1,821 |   149,413 
           |      5.80      16.66 |      5.84 
-----------+----------------------+----------
        45 |   410,564      2,528 |   413,092 
           |     16.12      23.12 |     16.15 
-----------+----------------------+----------
        60 | 1,948,344      5,620 | 1,953,964 
           |     76.51      51.40 |     76.40 
-----------+----------------------+----------
     Total | 2,546,642     10,933 | 2,557,575 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |    outcome: covid
     renal |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,664,274     10,967 | 2,675,241 
           |     99.75      98.51 |     99.74 
-----------+----------------------+----------
         1 |     6,694        166 |     6,860 
           |      0.25       1.49 |      0.26 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |       icu/death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,072,670      5,820 | 2,078,490 
                      |     77.60      52.28 |     77.49 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   558,156      4,349 |   562,505 
                      |     20.90      39.06 |     20.97 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    40,142        964 |    41,106 
                      |      1.50       8.66 |      1.53 
----------------------+----------------------+----------
                Total | 2,670,968     11,133 | 2,682,101 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |       icu/death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,189,932      3,197 | 1,193,129 
           |     44.55      28.72 |     44.48 
-----------+----------------------+----------
         1 | 1,481,036      7,936 | 1,488,972 
           |     55.45      71.28 |     55.52 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,463,634     10,050 | 2,473,684 
           |     92.24      90.27 |     92.23 
-----------+----------------------+----------
         1 |   207,334      1,083 |   208,417 
           |      7.76       9.73 |      7.77 
-----------+----------------------+----------
     Total | 2,670,968     11,133 | 2,682,101 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |       icu/death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   657,543      1,923 |   659,466 
                 |     24.62      17.27 |     24.59 
-----------------+----------------------+----------
               2 |   616,936      2,068 |   619,004 
                 |     23.10      18.58 |     23.08 
-----------------+----------------------+----------
               3 |   577,948      2,167 |   580,115 
                 |     21.64      19.46 |     21.63 
-----------------+----------------------+----------
               4 |   474,766      2,461 |   477,227 
                 |     17.78      22.11 |     17.79 
-----------------+----------------------+----------
 5 most deprived |   343,775      2,514 |   346,289 
                 |     12.87      22.58 |     12.91 
-----------------+----------------------+----------
           Total | 2,670,968     11,133 | 2,682,101 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |       icu/death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,521,669      9,962 | 2,531,631 
                      |     94.41      89.48 |     94.39 
----------------------+----------------------+----------
                Mixed |     9,905         59 |     9,964 
                      |      0.37       0.53 |      0.37 
----------------------+----------------------+----------
Asian or Asian Britis |    90,136        798 |    90,934 
                      |      3.37       7.17 |      3.39 
----------------------+----------------------+----------
                Black |    27,580        212 |    27,792 
                      |      1.03       1.90 |      1.04 
----------------------+----------------------+----------
                Other |    21,678        102 |    21,780 
                      |      0.81       0.92 |      0.81 
----------------------+----------------------+----------
                Total | 2,670,968     11,133 | 2,682,101 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp covid_death_icu REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   627,910      5,503 |   633,413 
           |     24.04       7.89 |     23.62 
-----------+----------------------+----------
    70-<80 | 1,333,800     22,689 | 1,356,489 
           |     51.06      32.55 |     50.58 
-----------+----------------------+----------
       80+ |   650,681     41,518 |   692,199 
           |     24.91      59.56 |     25.81 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,410,125     33,674 | 1,443,799 
           |     53.98      48.31 |     53.83 
-----------+----------------------+----------
         1 | 1,202,266     36,036 | 1,238,302 
           |     46.02      51.69 |     46.17 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    43,739      4,627 |    48,366 
                     |      1.67       6.64 |      1.80 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   773,450     25,888 |   799,338 
                     |     29.61      37.14 |     29.80 
---------------------+----------------------+----------
Overweight (25-29.9) |   966,204     20,178 |   986,382 
                     |     36.99      28.95 |     36.78 
---------------------+----------------------+----------
   Obese I (30-34.9) |   469,683      9,218 |   478,901 
                     |     17.98      13.22 |     17.86 
---------------------+----------------------+----------
  Obese II (35-39.9) |   153,315      3,368 |   156,683 
                     |      5.87       4.83 |      5.84 
---------------------+----------------------+----------
     Obese III (40+) |    59,534      1,538 |    61,072 
                     |      2.28       2.21 |      2.28 
---------------------+----------------------+----------
        Unknown (.u) |   146,466      4,893 |   151,359 
                     |      5.61       7.02 |      5.64 
---------------------+----------------------+----------
               Total | 2,612,391     69,710 | 2,682,101 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,038,877     20,718 | 1,059,595 
             |     39.77      29.72 |     39.51 
-------------+----------------------+----------
      Former | 1,353,373     40,712 | 1,394,085 
             |     51.81      58.40 |     51.98 
-------------+----------------------+----------
     Current |   213,863      8,167 |   222,030 
             |      8.19      11.72 |      8.28 
-------------+----------------------+----------
Unknown (.u) |     6,278        113 |     6,391 
             |      0.24       0.16 |      0.24 
-------------+----------------------+----------
       Total | 2,612,391     69,710 | 2,682,101 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 1,929,859     55,586 | 1,985,445 
                     |     73.87      79.74 |     74.03 
---------------------+----------------------+----------
   Obese I (30-34.9) |   469,683      9,218 |   478,901 
                     |     17.98      13.22 |     17.86 
---------------------+----------------------+----------
  Obese II (35-39.9) |   153,315      3,368 |   156,683 
                     |      5.87       4.83 |      5.84 
---------------------+----------------------+----------
     Obese III (40+) |    59,534      1,538 |    61,072 
                     |      2.28       2.21 |      2.28 
---------------------+----------------------+----------
               Total | 2,612,391     69,710 | 2,682,101 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,701,382     25,772 | 1,727,154 
           |     65.13      36.97 |     64.40 
-----------+----------------------+----------
         1 |   911,009     43,938 |   954,947 
           |     34.87      63.03 |     35.60 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,296,272     51,389 | 2,347,661 
           |     87.90      73.72 |     87.53 
-----------+----------------------+----------
         1 |   316,119     18,321 |   334,440 
           |     12.10      26.28 |     12.47 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,259,941     60,303 | 2,320,244 
           |     86.51      86.51 |     86.51 
-----------+----------------------+----------
         1 |   352,450      9,407 |   361,857 
           |     13.49      13.49 |     13.49 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,071,521     40,249 | 2,111,770 
           |     79.30      57.74 |     78.74 
-----------+----------------------+----------
         1 |   540,870     29,461 |   570,331 
           |     20.70      42.26 |     21.26 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,148,789     50,360 | 2,199,149 
                   |     82.25      72.24 |     81.99 
-------------------+----------------------+----------
  T1DM, controlled |     3,374        184 |     3,558 
                   |      0.13       0.26 |      0.13 
-------------------+----------------------+----------
T1DM, uncontrolled |     6,998        401 |     7,399 
                   |      0.27       0.58 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   311,002     12,580 |   323,582 
                   |     11.90      18.05 |     12.06 
-------------------+----------------------+----------
T2DM, uncontrolled |   140,384      6,076 |   146,460 
                   |      5.37       8.72 |      5.46 
-------------------+----------------------+----------
Diabetes, no HbA1c |     1,844        109 |     1,953 
                   |      0.07       0.16 |      0.07 
-------------------+----------------------+----------
             Total | 2,612,391     69,710 | 2,682,101 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,251,225     48,555 | 2,299,780 
              |     86.17      69.65 |     85.75 
--------------+----------------------+----------
    Last year |    27,429      4,867 |    32,296 
              |      1.05       6.98 |      1.20 
--------------+----------------------+----------
2-5 years ago |    89,531      6,069 |    95,600 
              |      3.43       8.71 |      3.56 
--------------+----------------------+----------
     5+ years |   244,206     10,219 |   254,425 
              |      9.35      14.66 |      9.49 
--------------+----------------------+----------
        Total | 2,612,391     69,710 | 2,682,101 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,575,799     67,075 | 2,642,874 
              |     98.60      96.22 |     98.54 
--------------+----------------------+----------
    Last year |     3,362        475 |     3,837 
              |      0.13       0.68 |      0.14 
--------------+----------------------+----------
2-5 years ago |    10,776        851 |    11,627 
              |      0.41       1.22 |      0.43 
--------------+----------------------+----------
     5+ years |    22,454      1,309 |    23,763 
              |      0.86       1.88 |      0.89 
--------------+----------------------+----------
        Total | 2,612,391     69,710 | 2,682,101 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,607,298     69,409 | 2,676,707 
           |     99.81      99.57 |     99.80 
-----------+----------------------+----------
         1 |     5,093        301 |     5,394 
           |      0.19       0.43 |      0.20 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,611,571     69,659 | 2,681,230 
           |     99.97      99.93 |     99.97 
-----------+----------------------+----------
         1 |       820         51 |       871 
           |      0.03       0.07 |      0.03 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,605,987     69,390 | 2,675,377 
           |     99.75      99.54 |     99.75 
-----------+----------------------+----------
         1 |     6,404        320 |     6,724 
           |      0.25       0.46 |      0.25 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,587,843     67,942 | 2,655,785 
           |     99.06      97.46 |     99.02 
-----------+----------------------+----------
         1 |    24,548      1,768 |    26,316 
           |      0.94       2.54 |      0.98 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,561,856     66,242 | 2,628,098 
           |     98.07      95.03 |     97.99 
-----------+----------------------+----------
         1 |    50,535      3,468 |    54,003 
           |      1.93       4.97 |      2.01 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,422,950     55,698 | 2,478,648 
           |     92.75      79.90 |     92.41 
-----------+----------------------+----------
         1 |   189,441     14,012 |   203,453 
           |      7.25      20.10 |      7.59 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,926      1,149 |     6,075 
           |      0.20       1.69 |      0.24 
-----------+----------------------+----------
        15 |    30,593      4,438 |    35,031 
           |      1.23       6.53 |      1.37 
-----------+----------------------+----------
        30 |   139,037     10,376 |   149,413 
           |      5.58      15.27 |      5.84 
-----------+----------------------+----------
        45 |   398,437     14,655 |   413,092 
           |     16.00      21.57 |     16.15 
-----------+----------------------+----------
        60 | 1,916,647     37,317 | 1,953,964 
           |     76.98      54.93 |     76.40 
-----------+----------------------+----------
     Total | 2,489,640     67,935 | 2,557,575 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,606,339     68,902 | 2,675,241 
           |     99.77      98.84 |     99.74 
-----------+----------------------+----------
         1 |     6,052        808 |     6,860 
           |      0.23       1.16 |      0.26 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,039,398     39,092 | 2,078,490 
                      |     78.07      56.08 |     77.49 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   537,474     25,031 |   562,505 
                      |     20.57      35.91 |     20.97 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    35,519      5,587 |    41,106 
                      |      1.36       8.01 |      1.53 
----------------------+----------------------+----------
                Total | 2,612,391     69,710 | 2,682,101 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,171,548     21,581 | 1,193,129 
           |     44.85      30.96 |     44.48 
-----------+----------------------+----------
         1 | 1,440,843     48,129 | 1,488,972 
           |     55.15      69.04 |     55.52 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,410,311     63,373 | 2,473,684 
           |     92.26      90.91 |     92.23 
-----------+----------------------+----------
         1 |   202,080      6,337 |   208,417 
           |      7.74       9.09 |      7.77 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   645,426     14,040 |   659,466 
                 |     24.71      20.14 |     24.59 
-----------------+----------------------+----------
               2 |   604,355     14,649 |   619,004 
                 |     23.13      21.01 |     23.08 
-----------------+----------------------+----------
               3 |   565,285     14,830 |   580,115 
                 |     21.64      21.27 |     21.63 
-----------------+----------------------+----------
               4 |   463,324     13,903 |   477,227 
                 |     17.74      19.94 |     17.79 
-----------------+----------------------+----------
 5 most deprived |   334,001     12,288 |   346,289 
                 |     12.79      17.63 |     12.91 
-----------------+----------------------+----------
           Total | 2,612,391     69,710 | 2,682,101 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,465,168     66,463 | 2,531,631 
                      |     94.36      95.34 |     94.39 
----------------------+----------------------+----------
                Mixed |     9,749        215 |     9,964 
                      |      0.37       0.31 |      0.37 
----------------------+----------------------+----------
Asian or Asian Britis |    88,931      2,003 |    90,934 
                      |      3.40       2.87 |      3.39 
----------------------+----------------------+----------
                Black |    27,126        666 |    27,792 
                      |      1.04       0.96 |      1.04 
----------------------+----------------------+----------
                Other |    21,417        363 |    21,780 
                      |      0.82       0.52 |      0.81 
----------------------+----------------------+----------
                Total | 2,612,391     69,710 | 2,682,101 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       182          7 |       189 
           |      0.01       0.01 |      0.01 
-----------+----------------------+----------
         2 |   228,228      6,561 |   234,789 
           |      8.74       9.41 |      8.75 
-----------+----------------------+----------
         3 |   112,199      3,064 |   115,263 
           |      4.29       4.40 |      4.30 
-----------+----------------------+----------
         4 |    25,557        694 |    26,251 
           |      0.98       1.00 |      0.98 
-----------+----------------------+----------
         5 |    16,959        450 |    17,409 
           |      0.65       0.65 |      0.65 
-----------+----------------------+----------
         6 |   129,527      3,846 |   133,373 
           |      4.96       5.52 |      4.97 
-----------+----------------------+----------
         7 |     6,358        196 |     6,554 
           |      0.24       0.28 |      0.24 
-----------+----------------------+----------
         8 |   102,534      2,768 |   105,302 
           |      3.92       3.97 |      3.93 
-----------+----------------------+----------
         9 |    97,990      2,673 |   100,663 
           |      3.75       3.83 |      3.75 
-----------+----------------------+----------
        10 |   113,925      3,236 |   117,161 
           |      4.36       4.64 |      4.37 
-----------+----------------------+----------
        11 |   119,904      3,196 |   123,100 
           |      4.59       4.58 |      4.59 
-----------+----------------------+----------
        12 |    30,391      1,082 |    31,473 
           |      1.16       1.55 |      1.17 
-----------+----------------------+----------
        13 |    55,117      1,612 |    56,729 
           |      2.11       2.31 |      2.12 
-----------+----------------------+----------
        14 |    68,047      1,757 |    69,804 
           |      2.60       2.52 |      2.60 
-----------+----------------------+----------
        15 |    93,591      2,331 |    95,922 
           |      3.58       3.34 |      3.58 
-----------+----------------------+----------
        16 |   127,274      3,316 |   130,590 
           |      4.87       4.76 |      4.87 
-----------+----------------------+----------
        17 |   111,391      2,638 |   114,029 
           |      4.26       3.78 |      4.25 
-----------+----------------------+----------
        18 |    87,813      2,135 |    89,948 
           |      3.36       3.06 |      3.35 
-----------+----------------------+----------
        19 |    74,566      2,066 |    76,632 
           |      2.85       2.96 |      2.86 
-----------+----------------------+----------
        20 |   123,873      3,199 |   127,072 
           |      4.74       4.59 |      4.74 
-----------+----------------------+----------
        21 |   115,794      2,870 |   118,664 
           |      4.43       4.12 |      4.42 
-----------+----------------------+----------
        22 |     6,976        167 |     7,143 
           |      0.27       0.24 |      0.27 
-----------+----------------------+----------
        23 |    88,459      2,185 |    90,644 
           |      3.39       3.13 |      3.38 
-----------+----------------------+----------
        24 |     4,975        103 |     5,078 
           |      0.19       0.15 |      0.19 
-----------+----------------------+----------
        25 |    23,568        538 |    24,106 
           |      0.90       0.77 |      0.90 
-----------+----------------------+----------
        26 |    98,136      2,383 |   100,519 
           |      3.76       3.42 |      3.75 
-----------+----------------------+----------
        27 |    89,583      2,344 |    91,927 
           |      3.43       3.36 |      3.43 
-----------+----------------------+----------
        28 |   112,638      2,954 |   115,592 
           |      4.31       4.24 |      4.31 
-----------+----------------------+----------
        29 |    64,003      1,627 |    65,630 
           |      2.45       2.33 |      2.45 
-----------+----------------------+----------
        30 |    61,860      1,548 |    63,408 
           |      2.37       2.22 |      2.36 
-----------+----------------------+----------
        31 |     3,693         79 |     3,772 
           |      0.14       0.11 |      0.14 
-----------+----------------------+----------
        32 |   217,280      6,085 |   223,365 
           |      8.32       8.73 |      8.33 
-----------+----------------------+----------
     Total | 2,612,391     69,710 | 2,682,101 
           |    100.00     100.00 |    100.00 

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    328503      605              0.0018    0.0001     0.0017    0.0020
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    301701      978              0.0032    0.0001     0.0030    0.0034
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    710956     2728              0.0038    0.0001     0.0037    0.0040
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    635197     3759              0.0059    0.0001     0.0057    0.0061
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    389943     6422              0.0161    0.0002     0.0158    0.0165
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    285623     5978              0.0204    0.0003     0.0199    0.0209
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    328101      516              0.0016    0.0001     0.0014    0.0017
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    301169      724              0.0024    0.0001     0.0022    0.0026
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    709872     1542              0.0022    0.0001     0.0021    0.0023
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    633922     2158              0.0034    0.0001     0.0032    0.0035
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    388707     2191              0.0056    0.0001     0.0053    0.0058
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    284527     2395              0.0083    0.0002     0.0080    0.0086
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/log/04a_an_descriptive_tables.log
  log type:  text
 closed on:  18 Jan 2021, 09:29:14
-------------------------------------------------------------------------------
