-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/04b_an_descriptive_table_2_W2.log
  log type:  text
 opened on:  23 Jan 2021, 03:19:34

. 
. 
. *****************************************************************************
> **
. *Generic code to output one row of table
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string)
  2. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3. 
.         cou
  4.         local overalldenom=r(N)
  5. 
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9.         
.         foreach outcome in covid_tpp_prob  covidadmission  covid_icu covid_de
> ath non_covid_death {
 10.         cou if `outcome'==1 & `variable' `condition'
 11.         local pct = 100*(r(N)/`rowdenom')
 12.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab 
 13. 
. }
 14.         file write tablecontent _n 
 15. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] 
  2. 
.         foreach varlevel of numlist `start'/`end'{
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) 
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") 
  6. 
. end

. 
. *****************************************************************************
> **
. 
. 
. forvalues x=0/1 {
  2. 
. *Set up output file
. cap file close tablecontent
  3. file open tablecontent using ./output/04b_an_descriptive_table_2_`dataset'
> _ageband`x'.txt, write text replace
  4. 
. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) 
  7. file write tablecontent _n
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) 
  9. file write tablecontent _n
 10. 
. tabulatevariable, variable(male) start(0) end(1) 
 11. file write tablecontent _n
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing 
 13. file write tablecontent _n
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing 
 15. file write tablecontent _n
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing 
 17. file write tablecontent _n
 18. 
. tabulatevariable, variable(imd) start(1) end(5) 
 19. file write tablecontent _n
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) 
 21. file write tablecontent _n
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing 
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) 
 24. file write tablecontent _n
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) 
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1)  /*ever asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) 
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4)  /*<1, 1-4.9, 5+ 
> years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4)  /*<1, 1-4.9, 5
> + years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) 
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) 
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) 
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) 
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) 
 40. *ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) 
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) 
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) 
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) 
 44. 
. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(shield) start(1) end(1) 
 45. 
. file close tablecontent
 46. 
. }
(note: file ./output/04b_an_descriptive_table_2_W2_ageband0.txt not found)
  9,266,919
  9,266,919
  241,693
  3,616
  1,102
  591
  4,409
  9,266,919
  1,912,652
  62,523
  246
  39
  6
  60
  9,266,919
  2,222,046
  56,007
  440
  102
  14
  205
  9,266,919
  2,021,030
  52,553
  771
  222
  67
  647
  9,266,919
  2,064,172
  51,315
  1,302
  426
  250
  1,772
  9,266,919
  1,047,019
  19,295
  857
  313
  254
  1,725
  9,266,919
  0
  0
  0
  0
  0
  0
  9,266,919
  0
  0
  0
  0
  0
  0
  9,266,919
  4,757,515
  135,947
  1,573
  342
  201
  1,866
  9,266,919
  4,509,404
  105,746
  2,043
  760
  390
  2,543
  9,266,919
  177,343
  3,515
  31
  5
  11
  230
  9,266,919
  2,822,640
  66,149
  442
  97
  74
  1,286
  9,266,919
  2,489,283
  67,124
  944
  248
  131
  1,107
  9,266,919
  1,256,346
  38,047
  890
  314
  154
  710
  9,266,919
  510,314
  16,402
  518
  169
  87
  339
  9,266,919
  275,736
  9,298
  397
  142
  71
  233
  9,266,919
  1,735,257
  41,158
  394
  127
  63
  504
  9,266,919
  4,451,215
  129,583
  1,840
  524
  214
  1,199
  9,266,919
  2,677,563
  73,998
  1,468
  500
  292
  1,568
  9,266,919
  1,866,970
  30,547
  287
  69
  85
  1,613
  9,266,919
  271,171
  7,565
  21
  9
  0
  29
  9,266,919
  7,666,700
  190,672
  2,470
  731
  471
  4,002
  9,266,919
  160,932
  4,026
  66
  24
  6
  43
  9,266,919
  835,735
  34,963
  789
  262
  93
  203
  9,266,919
  309,730
  7,029
  184
  52
  17
  110
  9,266,919
  293,822
  5,003
  107
  33
  4
  51
  9,266,919
  0
  0
  0
  0
  0
  0
  9,266,919
  1,741,677
  41,659
  437
  123
  52
  602
  9,266,919
  1,837,273
  43,514
  494
  155
  72
  734
  9,266,919
  1,898,184
  45,357
  574
  179
  86
  830
  9,266,919
  1,994,633
  54,108
  832
  252
  141
  1,026
  9,266,919
  1,795,152
  57,055
  1,279
  393
  240
  1,217
  9,266,919
  2,223,814
  49,780
  775
  209
  166
  1,497
  9,266,919
  3,772,870
  94,536
  1,280
  399
  201
  1,686
  9,266,919
  3,270,235
  97,377
  1,561
  494
  224
  1,226
  9,266,919
  2,452,608
  68,001
  663
  142
  84
  1,020
  9,266,919
  1,335,410
  36,135
  526
  143
  85
  557
  9,266,919
  2,924,903
  77,834
  1,382
  443
  227
  1,489
  9,266,919
  1,552,001
  38,762
  952
  352
  190
  1,267
  9,266,919
  1,001,997
  20,961
  93
  22
  5
  76
  9,266,919
  2,174,941
  55,350
  1,634
  611
  341
  2,216
  9,266,919
  185,356
  4,401
  412
  145
  114
  766
  9,266,919
  1,595,772
  45,694
  906
  249
  130
  792
  9,266,919
  260,386
  7,115
  396
  133
  130
  811
  9,266,919
  8,811,895
  227,899
  2,783
  778
  387
  3,468
  9,266,919
  13,740
  336
  5
  2
  3
  29
  9,266,919
  38,109
  1,042
  32
  15
  6
  86
  9,266,919
  221,590
  6,556
  371
  127
  92
  438
  9,266,919
  177,484
  5,752
  419
  173
  101
  374
  9,266,919
  4,101
  108
  6
  7
  2
  14
  9,266,919
  2,232
  57
  7
  5
  3
  31
  9,266,919
  7,103
  171
  14
  8
  9
  23
  9,266,919
  19,067
  462
  23
  9
  14
  51
  9,266,919
  20,699
  477
  28
  9
  17
  426
  9,266,919
  61,958
  1,488
  51
  16
  24
  496
  9,266,919
  110,193
  2,569
  74
  21
  22
  320
  9,266,919
  95,475
  2,312
  130
  62
  52
  302
  9,266,919
  9,104
  360
  55
  26
  21
  135
  9,266,919
  10,787
  396
  56
  30
  18
  90
  9,266,919
  51,834
  1,202
  50
  15
  34
  458
  9,266,919
  72,174
  1,762
  103
  32
  39
  321
  9,266,919
  64,030
  1,372
  74
  10
  23
  177
  9,266,919
  2,122
  64
  8
  3
  3
  9
  9,266,919
  10,883
  247
  13
  2
  2
  43
  9,266,919
  412,685
  11,255
  255
  80
  60
  363
  9,266,919
  33,238
  799
  11
  4
  9
  57
  9,266,919
  1,944,911
  53,970
  1,399
  429
  290
  2,922
(note: file ./output/04b_an_descriptive_table_2_W2_ageband1.txt not found)
  2,706,505
  2,706,505
  34,519
  4,280
  784
  4,108
  21,796
  2,706,505
  0
  0
  0
  0
  0
  0
  2,706,505
  0
  0
  0
  0
  0
  0
  2,706,505
  0
  0
  0
  0
  0
  0
  2,706,505
  0
  0
  0
  0
  0
  0
  2,706,505
  632,027
  8,124
  573
  213
  286
  1,654
  2,706,505
  1,375,657
  14,938
  1,809
  459
  1,275
  7,153
  2,706,505
  698,821
  11,457
  1,898
  112
  2,547
  12,989
  2,706,505
  1,457,578
  17,650
  1,858
  232
  1,666
  10,433
  2,706,505
  1,248,927
  16,869
  2,422
  552
  2,442
  11,363
  2,706,505
  44,591
  709
  98
  2
  146
  1,395
  2,706,505
  793,996
  8,798
  994
  98
  1,178
  7,870
  2,706,505
  994,595
  12,485
  1,401
  280
  1,265
  6,496
  2,706,505
  485,856
  7,227
  1,002
  228
  803
  2,942
  2,706,505
  159,518
  2,601
  407
  93
  314
  1,030
  2,706,505
  62,493
  1,128
  190
  49
  171
  512
  2,706,505
  165,456
  1,571
  188
  34
  231
  1,551
  2,706,505
  1,073,743
  12,321
  1,207
  216
  1,122
  6,413
  2,706,505
  1,404,161
  20,122
  2,830
  539
  2,693
  12,819
  2,706,505
  222,251
  2,043
  239
  28
  287
  2,539
  2,706,505
  6,350
  33
  4
  1
  6
  25
  2,706,505
  2,552,971
  31,054
  3,731
  669
  3,701
  20,786
  2,706,505
  10,249
  117
  13
  2
  19
  78
  2,706,505
  92,732
  2,791
  438
  88
  310
  611
  2,706,505
  28,209
  323
  61
  17
  54
  207
  2,706,505
  22,344
  234
  37
  8
  24
  114
  2,706,505
  0
  0
  0
  0
  0
  0
  2,706,505
  668,867
  6,175
  633
  127
  677
  4,469
  2,706,505
  636,250
  6,674
  693
  118
  709
  4,685
  2,706,505
  574,847
  6,480
  762
  156
  736
  4,588
  2,706,505
  479,967
  7,360
  899
  180
  922
  4,295
  2,706,505
  346,574
  7,830
  1,293
  203
  1,064
  3,759
  2,706,505
  921,594
  12,322
  1,680
  239
  1,859
  9,846
  2,706,505
  1,390,726
  15,600
  1,813
  378
  1,645
  9,189
  2,706,505
  394,185
  6,597
  787
  167
  604
  2,761
  2,706,505
  310,503
  4,830
  636
  89
  754
  5,004
  2,706,505
  422,947
  5,614
  695
  117
  754
  3,497
  2,706,505
  1,011,992
  12,469
  1,508
  308
  1,317
  6,420
  2,706,505
  946,777
  11,544
  1,435
  267
  1,275
  6,828
  2,706,505
  14,286
  62
  6
  3
  8
  47
  2,706,505
  1,858,019
  25,105
  3,340
  573
  3,254
  16,794
  2,706,505
  324,691
  6,356
  1,313
  187
  1,189
  5,638
  2,706,505
  366,433
  5,610
  771
  135
  647
  3,016
  2,706,505
  551,840
  10,384
  1,735
  235
  1,962
  9,142
  2,706,505
  2,221,833
  25,566
  2,774
  506
  2,625
  15,723
  2,706,505
  3,710
  57
  9
  3
  12
  64
  2,706,505
  7,352
  135
  21
  1
  27
  110
  2,706,505
  323,947
  5,616
  878
  157
  882
  3,963
  2,706,505
  147,893
  3,101
  595
  116
  557
  1,897
  2,706,505
  1,770
  44
  3
  1
  5
  39
  2,706,505
  3,499
  53
  9
  0
  10
  132
  2,706,505
  11,138
  191
  37
  6
  43
  265
  2,706,505
  23,008
  384
  72
  16
  80
  408
  2,706,505
  29,009
  434
  62
  5
  87
  1,199
  2,706,505
  92,748
  1,257
  172
  30
  203
  1,749
  2,706,505
  248,878
  3,350
  449
  69
  494
  3,131
  2,706,505
  560,736
  8,830
  1,470
  202
  1,661
  7,765
  2,706,505
  40,212
  1,143
  237
  24
  413
  1,892
  2,706,505
  6,285
  213
  37
  10
  43
  244
  2,706,505
  25,834
  503
  77
  13
  89
  586
  2,706,505
  191,057
  4,133
  659
  57
  827
  4,167
  2,706,505
  51,397
  1,091
  158
  17
  209
  1,063
  2,706,505
  852
  15
  6
  1
  4
  16
  2,706,505
  6,639
  107
  15
  1
  15
  107
  2,706,505
  208,797
  3,040
  451
  80
  405
  1,956
  2,706,505
  5,658
  86
  12
  3
  16
  112
  2,706,505
  941,453
  14,751
  2,320
  359
  2,244
  13,841

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/04b_an_descriptive_table_2_W2.log
  log type:  text
 closed on:  23 Jan 2021, 03:21:12
-------------------------------------------------------------------------------
