-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/04b_an_descriptive_table_2_MAIN.log
  log type:  text
 opened on:  23 Jan 2021, 03:07:49

. 
. 
. *****************************************************************************
> **
. *Generic code to output one row of table
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string)
  2. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3. 
.         cou
  4.         local overalldenom=r(N)
  5. 
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9.         
.         foreach outcome in covid_tpp_prob  covidadmission  covid_icu covid_de
> ath non_covid_death {
 10.         cou if `outcome'==1 & `variable' `condition'
 11.         local pct = 100*(r(N)/`rowdenom')
 12.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab 
 13. 
. }
 14.         file write tablecontent _n 
 15. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] 
  2. 
.         foreach varlevel of numlist `start'/`end'{
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) 
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") 
  6. 
. end

. 
. *****************************************************************************
> **
. 
. 
. forvalues x=0/1 {
  2. 
. *Set up output file
. cap file close tablecontent
  3. file open tablecontent using ./output/04b_an_descriptive_table_2_`dataset'
> _ageband`x'.txt, write text replace
  4. 
. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) 
  7. file write tablecontent _n
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) 
  9. file write tablecontent _n
 10. 
. tabulatevariable, variable(male) start(0) end(1) 
 11. file write tablecontent _n
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing 
 13. file write tablecontent _n
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing 
 15. file write tablecontent _n
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing 
 17. file write tablecontent _n
 18. 
. tabulatevariable, variable(imd) start(1) end(5) 
 19. file write tablecontent _n
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) 
 21. file write tablecontent _n
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing 
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) 
 24. file write tablecontent _n
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) 
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1)  /*ever asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) 
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4)  /*<1, 1-4.9, 5+ 
> years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4)  /*<1, 1-4.9, 5
> + years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) 
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) 
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) 
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) 
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) 
 40. *ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) 
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) 
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) 
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) 
 44. 
. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(shield) start(1) end(1) 
 45. 
. file close tablecontent
 46. 
. }
(note: file ./output/04b_an_descriptive_table_2_MAIN_ageband0.txt not found)
  9,334,392
  9,334,392
  51,560
  6,374
  1,601
  1,219
  10,580
  9,334,392
  1,981,860
  9,778
  345
  45
  12
  280
  9,334,392
  2,230,655
  11,580
  766
  132
  46
  654
  9,334,392
  2,022,059
  11,897
  1,402
  316
  160
  1,671
  9,334,392
  2,062,371
  12,740
  2,344
  648
  466
  4,001
  9,334,392
  1,037,447
  5,565
  1,517
  460
  535
  3,974
  9,334,392
  0
  0
  0
  0
  0
  0
  9,334,392
  0
  0
  0
  0
  0
  0
  9,334,392
  4,802,386
  30,629
  2,740
  513
  436
  4,284
  9,334,392
  4,532,006
  20,931
  3,634
  1,088
  783
  6,296
  9,334,392
  180,395
  804
  74
  9
  22
  579
  9,334,392
  2,886,762
  13,498
  981
  184
  194
  3,170
  9,334,392
  2,551,873
  14,743
  1,829
  434
  319
  2,714
  9,334,392
  1,286,837
  9,118
  1,470
  414
  251
  1,610
  9,334,392
  521,821
  4,207
  824
  232
  180
  737
  9,334,392
  281,814
  2,655
  601
  170
  123
  584
  9,334,392
  1,624,890
  6,535
  595
  158
  130
  1,186
  9,334,392
  4,491,312
  28,132
  3,342
  814
  509
  2,795
  9,334,392
  2,684,880
  15,829
  2,389
  669
  515
  3,652
  9,334,392
  1,900,976
  6,683
  602
  111
  190
  4,073
  9,334,392
  257,224
  916
  41
  7
  5
  60
  9,334,392
  7,734,228
  35,276
  4,120
  1,002
  827
  9,604
  9,334,392
  160,065
  1,052
  161
  46
  28
  95
  9,334,392
  836,666
  11,067
  1,291
  328
  220
  484
  9,334,392
  309,079
  2,656
  525
  148
  103
  281
  9,334,392
  294,354
  1,509
  277
  77
  41
  116
  9,334,392
  0
  0
  0
  0
  0
  0
  9,334,392
  1,724,481
  7,391
  854
  197
  121
  1,343
  9,334,392
  1,850,024
  8,627
  1,021
  260
  177
  1,666
  9,334,392
  1,942,791
  9,870
  1,161
  313
  227
  1,975
  9,334,392
  2,010,621
  12,239
  1,577
  406
  351
  2,486
  9,334,392
  1,806,475
  13,433
  1,761
  425
  343
  3,110
  9,334,392
  2,260,091
  10,670
  1,459
  346
  339
  3,912
  9,334,392
  3,850,961
  20,288
  2,319
  564
  392
  3,836
  9,334,392
  3,223,340
  20,602
  2,596
  691
  488
  2,832
  9,334,392
  2,475,941
  13,741
  1,232
  218
  235
  2,506
  9,334,392
  1,347,313
  7,493
  777
  183
  145
  1,371
  9,334,392
  2,935,415
  17,396
  2,418
  642
  449
  3,403
  9,334,392
  1,585,467
  9,740
  1,787
  517
  374
  3,075
  9,334,392
  990,256
  3,190
  160
  41
  16
  225
  9,334,392
  2,221,567
  14,915
  3,087
  908
  735
  5,194
  9,334,392
  196,442
  1,706
  602
  152
  177
  1,821
  9,334,392
  1,607,197
  9,659
  1,430
  325
  243
  1,974
  9,334,392
  274,825
  2,446
  758
  191
  238
  1,825
  9,334,392
  8,877,057
  46,639
  4,892
  1,131
  793
  8,504
  9,334,392
  13,036
  82
  21
  7
  6
  68
  9,334,392
  39,054
  313
  78
  23
  21
  191
  9,334,392
  224,926
  2,300
  650
  193
  178
  913
  9,334,392
  175,978
  2,187
  722
  240
  214
  877
  9,334,392
  4,341
  39
  11
  7
  7
  27
  9,334,392
  2,427
  46
  11
  4
  7
  80
  9,334,392
  7,583
  103
  45
  9
  15
  113
  9,334,392
  19,774
  140
  40
  15
  14
  106
  9,334,392
  22,851
  210
  57
  7
  32
  1,248
  9,334,392
  66,072
  434
  106
  19
  48
  1,340
  9,334,392
  116,131
  715
  138
  21
  49
  757
  9,334,392
  96,030
  858
  291
  90
  128
  690
  9,334,392
  9,342
  352
  140
  37
  67
  322
  9,334,392
  11,510
  374
  157
  49
  50
  195
  9,334,392
  54,410
  557
  156
  25
  65
  1,005
  9,334,392
  76,724
  768
  246
  64
  91
  731
  9,334,392
  66,083
  486
  165
  20
  66
  416
  9,334,392
  2,210
  37
  11
  3
  4
  31
  9,334,392
  11,363
  107
  22
  10
  5
  89
  9,334,392
  421,447
  2,603
  452
  120
  98
  799
  9,334,392
  33,165
  365
  47
  18
  21
  156
  9,334,392
  1,976,741
  12,740
  2,284
  548
  532
  6,589
(note: file ./output/04b_an_descriptive_table_2_MAIN_ageband1.txt not found)
  2,684,524
  2,684,524
  18,893
  8,560
  732
  6,507
  45,940
  2,684,524
  0
  0
  0
  0
  0
  0
  2,684,524
  0
  0
  0
  0
  0
  0
  2,684,524
  0
  0
  0
  0
  0
  0
  2,684,524
  0
  0
  0
  0
  0
  0
  2,684,524
  633,913
  2,723
  1,045
  240
  475
  3,682
  2,684,524
  1,357,522
  7,153
  3,239
  428
  2,032
  14,970
  2,684,524
  693,089
  9,017
  4,276
  64
  4,000
  27,288
  2,684,524
  1,445,097
  9,065
  3,593
  210
  2,688
  22,087
  2,684,524
  1,239,427
  9,828
  4,967
  522
  3,819
  23,853
  2,684,524
  48,518
  710
  263
  4
  253
  2,985
  2,684,524
  800,412
  5,697
  2,405
  122
  1,996
  17,122
  2,684,524
  987,076
  6,129
  2,764
  280
  1,952
  13,160
  2,684,524
  479,258
  3,500
  1,695
  188
  1,190
  6,105
  2,684,524
  156,751
  1,349
  704
  81
  488
  2,259
  2,684,524
  61,135
  605
  304
  23
  218
  1,011
  2,684,524
  151,374
  903
  425
  34
  410
  3,298
  2,684,524
  1,060,734
  6,317
  2,612
  224
  1,906
  13,564
  2,684,524
  1,395,189
  11,234
  5,401
  471
  4,126
  26,874
  2,684,524
  222,197
  1,312
  537
  33
  464
  5,423
  2,684,524
  6,404
  30
  10
  4
  11
  79
  2,684,524
  2,533,944
  16,803
  7,448
  603
  5,796
  43,761
  2,684,524
  9,970
  94
  51
  8
  35
  133
  2,684,524
  91,000
  1,407
  709
  73
  467
  1,362
  2,684,524
  27,818
  397
  248
  29
  145
  443
  2,684,524
  21,792
  192
  104
  19
  64
  241
  2,684,524
  0
  0
  0
  0
  0
  0
  2,684,524
  651,069
  3,333
  1,385
  143
  1,101
  8,972
  2,684,524
  629,037
  3,795
  1,626
  145
  1,299
  9,782
  2,684,524
  580,534
  3,797
  1,753
  162
  1,314
  9,752
  2,684,524
  477,447
  4,163
  1,948
  161
  1,430
  9,234
  2,684,524
  346,437
  3,805
  1,848
  121
  1,363
  8,200
  2,684,524
  913,998
  8,180
  3,690
  184
  3,028
  21,246
  2,684,524
  1,384,390
  7,508
  3,421
  388
  2,459
  18,799
  2,684,524
  386,136
  3,205
  1,449
  160
  1,020
  5,895
  2,684,524
  309,796
  3,282
  1,522
  84
  1,334
  10,455
  2,684,524
  417,855
  3,138
  1,485
  114
  1,176
  7,693
  2,684,524
  990,139
  6,163
  2,814
  264
  1,969
  13,670
  2,684,524
  952,842
  6,279
  2,727
  265
  2,017
  14,026
  2,684,524
  13,892
  31
  12
  5
  11
  96
  2,684,524
  1,859,250
  14,515
  6,673
  542
  5,111
  35,289
  2,684,524
  334,940
  4,581
  2,339
  134
  1,659
  12,241
  2,684,524
  362,235
  3,209
  1,450
  117
  993
  6,166
  2,684,524
  571,371
  7,262
  3,520
  172
  2,805
  19,427
  2,684,524
  2,201,205
  12,799
  5,512
  510
  4,173
  33,039
  2,684,524
  3,563
  50
  26
  2
  20
  125
  2,684,524
  7,408
  127
  54
  3
  47
  273
  2,684,524
  323,854
  3,770
  1,803
  125
  1,427
  8,447
  2,684,524
  146,537
  2,116
  1,145
  91
  829
  3,990
  2,684,524
  1,957
  31
  20
  1
  11
  66
  2,684,524
  3,839
  74
  36
  6
  31
  333
  2,684,524
  11,638
  184
  105
  15
  83
  572
  2,684,524
  23,786
  308
  134
  8
  109
  871
  2,684,524
  32,334
  425
  202
  7
  181
  3,614
  2,684,524
  95,696
  805
  383
  20
  314
  4,205
  2,684,524
  254,667
  2,244
  1,018
  61
  783
  6,780
  2,684,524
  563,148
  6,172
  2,963
  156
  2,552
  16,311
  2,684,524
  41,148
  1,218
  640
  17
  597
  3,856
  2,684,524
  6,885
  334
  174
  13
  121
  537
  2,684,524
  26,389
  380
  173
  8
  138
  1,160
  2,684,524
  204,093
  3,502
  1,581
  63
  1,370
  9,118
  2,684,524
  54,121
  938
  430
  13
  388
  2,253
  2,684,524
  872
  21
  8
  1
  7
  35
  2,684,524
  6,733
  80
  34
  3
  17
  205
  2,684,524
  208,673
  1,915
  861
  68
  625
  4,222
  2,684,524
  5,397
  77
  34
  2
  29
  221
  2,684,524
  956,589
  9,662
  4,547
  317
  3,330
  29,076

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/04b_an_descriptive_table_2_MAIN.log
  log type:  text
 closed on:  23 Jan 2021, 03:09:28
-------------------------------------------------------------------------------
