-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_tpp_probW2.lo
> g
  log type:  text
 opened on:  24 Jan 2021, 10:32:57

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   6534.68 /        1 =    6534.6790

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,266,919             Number of obs    =   9,266,919
No. of failures      =      241,693
Time at risk         =    984628256
                                                Wald chi2(47)    =    30543.19
Log pseudolikelihood =   -3099866.5             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,781,608 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.062197   .0068621     9.34   0.000     1.048832    1.075732
 only 12-18  |   1.219069   .0094891    25.45   0.000     1.200612     1.23781
      mixed  |   1.250671     .01071    26.12   0.000     1.229855    1.271839
             |
        age1 |   .9564011   .0007271   -58.64   0.000     .9549771    .9578272
        age2 |   1.112406   .0027425    43.21   0.000     1.107044    1.117794
        age3 |   .7326869   .0053758   -42.39   0.000     .7222259    .7432994
      1.male |   .8454216   .0032253   -44.02   0.000     .8391237    .8517667
             |
   obese4cat |
Obese I ..)  |   1.219359   .0071834    33.67   0.000      1.20536    1.233519
Obese II..)  |   1.239624   .0105416    25.26   0.000     1.219134    1.260458
Obese II..)  |   1.257107   .0139884    20.56   0.000     1.229987    1.284825
             |
smoke_nomiss |
     Former  |   1.058781   .0052303    11.56   0.000      1.04858    1.069082
    Current  |   .5899556   .0040025   -77.78   0.000     .5821627    .5978528
             |
         imd |
          2  |   1.022342    .008112     2.78   0.005     1.006566    1.038365
          3  |   1.038192   .0082363     4.72   0.000     1.022174    1.054461
          4  |   1.074671   .0083355     9.28   0.000     1.058457    1.091133
5 most de..  |   1.052175   .0084216     6.35   0.000     1.035798    1.068811
             |
tot_adults~h |
          2  |   1.054908   .0063364     8.90   0.000     1.042562    1.067401
          3  |   1.165967   .0072172    24.81   0.000     1.151907    1.180198
             |
   ethnicity |
      Mixed  |   .9892505   .0163767    -0.65   0.514      .957668    1.021875
Asian or ..  |   1.441027   .0110849    47.50   0.000     1.419464    1.462918
      Black  |    .839522   .0113144   -12.98   0.000     .8176366    .8619932
      Other  |   .7093331   .0109555   -22.24   0.000     .6881825    .7311338
             |
1.htdiag_o~p |   1.045076   .0057214     8.05   0.000     1.033923     1.05635
1.~y_disease |   1.077971   .0168748     4.80   0.000     1.045399    1.111557
    1.asthma |   1.076936   .0057643    13.85   0.000     1.065698    1.088294
1.~c_disease |   1.110325   .0139383     8.34   0.000     1.083339    1.137982
             |
     diabcat |
T1DM, con..  |   .9555435   .0523083    -0.83   0.406     .8583295    1.063768
T1DM, unc..  |   1.061783   .0330769     1.92   0.054     .9988934    1.128633
T2DM, con..  |   1.104711   .0144177     7.63   0.000     1.076811    1.133334
T2DM, unc..  |   1.187672   .0165423    12.35   0.000     1.155688    1.220541
Diabetes,..  |   1.004991   .0967882     0.05   0.959     .8321184    1.213778
             |
cancer_exh~t |
  Last year  |   .9940096   .0455467    -0.13   0.896     .9086308    1.087411
2-5 years..  |   1.018832   .0265779     0.72   0.475     .9680491    1.072278
   5+ years  |   1.005279   .0201163     0.26   0.792     .9666145    1.045489
             |
cancer_hae~t |
  Last year  |     1.0989    .145678     0.71   0.477     .8474555     1.42495
2-5 years..  |   1.021088    .078248     0.27   0.785     .8786868    1.186568
   5+ years  |   1.010988   .0471188     0.23   0.815      .922729    1.107688
             |
1.~r_disease |   1.012337   .0294349     0.42   0.673     .9562593    1.071704
1.stroke_d~a |   1.026704   .0248802     1.09   0.277     .9790795    1.076645
1.other_ne~o |   .8336371   .0228709    -6.63   0.000     .7899947    .8796904
             |
reduced_ki~t |
Stage 3a/..  |    1.03802   .0221406     1.75   0.080     .9955197    1.082334
Stage 4/5..  |    1.36726   .0809991     5.28   0.000     1.217375      1.5356
             |
      1.esrd |   1.180386   .0677794     2.89   0.004     1.054743    1.320995
1.other_tr~t |   1.039184   .1315185     0.30   0.761     .8108956    1.331742
  1.asplenia |   .9893817   .0630612    -0.17   0.867     .8731925    1.121031
1.ra_sle_p~s |   1.067708   .0104109     6.72   0.000     1.047497     1.08831
1.other_im~o |   1.021193    .036962     0.58   0.562     .9512589    1.096269
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFU
> LLYADJMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFULLYADJM
> ODEL_ageband_0W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.03437       365.74        1         0.0000
      2.kids_cat4 |      0.02003       134.95        1         0.0000
      3.kids_cat4 |      0.03778       464.02        1         0.0000
      age1        |      0.10397      2878.65        1         0.0000
      age2        |     -0.07329      1451.18        1         0.0000
      age3        |      0.06176      1034.94        1         0.0000
      0b.male     |            .            .        1             .
      1.male      |     -0.00303         1.90        1         0.1685
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00664        10.94        1         0.0009
      3.obese4cat |      0.00895        19.98        1         0.0000
      4.obese4cat |      0.00723        13.14        1         0.0003
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00326         2.71        1         0.0995
      3.smoke_no~s|      0.01125        34.12        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.01520        74.08        1         0.0000
      3.imd       |      0.02048       134.87        1         0.0000
      4.imd       |      0.03332       361.53        1         0.0000
      5.imd       |      0.03934       514.93        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01500        60.94        1         0.0000
      3.tot_adul~h|     -0.00232         1.59        1         0.2068
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00497         6.39        1         0.0115
      3.ethnicity |     -0.01732       100.27        1         0.0000
      4.ethnicity |      0.00257         1.86        1         0.1727
      5.ethnicity |      0.01634        73.81        1         0.0000
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00184         0.84        1         0.3600
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00030         0.02        1         0.8814
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00323         2.64        1         0.1041
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00022         0.01        1         0.9128
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00143         0.50        1         0.4802
      3.diabcat   |     -0.00082         0.16        1         0.6873
      4.diabcat   |     -0.00488         5.85        1         0.0156
      5.diabcat   |     -0.00182         0.82        1         0.3648
      6.diabcat   |     -0.00248         1.49        1         0.2222
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00344         2.86        1         0.0907
      3.cancer_e~t|     -0.00072         0.13        1         0.7223
      4.cancer_e~t|      0.00020         0.01        1         0.9220
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00364         3.22        1         0.0727
      3.cancer_h~t|     -0.00141         0.48        1         0.4865
      4.cancer_h~t|      0.00083         0.17        1         0.6843
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00149         0.54        1         0.4645
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00296         2.12        1         0.1458
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00751        13.93        1         0.0002
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00018         0.01        1         0.9289
      3.reduced_~t|      0.00343         2.74        1         0.0979
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00445         4.63        1         0.0313
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00314         2.36        1         0.1247
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00044         0.05        1         0.8277
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00310         2.35        1         0.1253
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00487         5.94        1         0.0148
      ------------+---------------------------------------------------
      global test |                   6853.16       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:  12469.02 /        1 =   12469.0220
   1:   1481.87 /        1 =    1481.8670

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,849,103             Number of obs    =   1,849,103
No. of failures      =       50,293
Time at risk         =    196752736
                                                Wald chi2(47)    =     3501.91
Log pseudolikelihood =   -566508.22             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,058,848 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |    1.04131   .0116962     3.60   0.000     1.018636    1.064488
3 childre..  |   1.050514   .0197059     2.63   0.009     1.012592    1.089855
4+ childr..  |   1.038422   .0374534     1.05   0.296     .9675491    1.114486
             |
        age1 |   .9886569   .0019269    -5.85   0.000     .9848874    .9924408
        age2 |   1.008557   .0061973     1.39   0.166     .9964829    1.020777
        age3 |   .9822027   .0187148    -0.94   0.346     .9461988    1.019577
      1.male |   .9254166   .0077188    -9.29   0.000      .910411    .9406695
             |
   obese4cat |
Obese I ..)  |   1.194094   .0153602    13.79   0.000     1.164365    1.224582
Obese II..)  |   1.224827   .0232292    10.69   0.000     1.180134    1.271212
Obese II..)  |   1.296235    .032341    10.40   0.000     1.234372    1.361197
             |
smoke_nomiss |
     Former  |   1.047392   .0110253     4.40   0.000     1.026005    1.069226
    Current  |   .6081986   .0091024   -33.23   0.000     .5906173    .6263033
             |
         imd |
          2  |   1.057346   .0189508     3.11   0.002     1.020848    1.095149
          3  |   1.096091   .0195926     5.13   0.000     1.058355    1.135173
          4  |   1.157731   .0201187     8.43   0.000     1.118964    1.197843
5 most de..  |   1.097502   .0197052     5.18   0.000     1.059552    1.136811
             |
tot_adults~h |
          2  |   .9682492   .0130961    -2.39   0.017     .9429185    .9942604
          3  |   .9910299   .0157022    -0.57   0.570     .9607271    1.022289
             |
   ethnicity |
      Mixed  |   1.040335   .0361446     1.14   0.255     .9718511    1.113645
Asian or ..  |   1.509241   .0230671    26.93   0.000       1.4647    1.555135
      Black  |   .8800549   .0254586    -4.42   0.000     .8315452    .9313944
      Other  |    .837929   .0261543    -5.67   0.000      .788204    .8907909
             |
1.htdiag_o~p |   1.081181   .0142375     5.93   0.000     1.053633    1.109449
1.~y_disease |   1.117499   .0548098     2.27   0.024     1.015075    1.230257
    1.asthma |   1.078705    .012646     6.46   0.000     1.054202    1.103778
1.~c_disease |   1.145062   .0418594     3.71   0.000      1.06589    1.230116
             |
     diabcat |
T1DM, con..  |   .8163856   .1073004    -1.54   0.123      .630985    1.056262
T1DM, unc..  |   .9767149    .077525    -0.30   0.767     .8359979    1.141118
T2DM, con..  |   1.128794   .0404849     3.38   0.001      1.05217    1.210998
T2DM, unc..  |   1.234057   .0475468     5.46   0.000     1.144299    1.330856
Diabetes,..  |   .8847318   .2027154    -0.53   0.593     .5646494    1.386259
             |
cancer_exh~t |
  Last year  |   1.216905   .1475005     1.62   0.105     .9595839    1.543229
2-5 years..  |   1.051189   .0792806     0.66   0.508     .9067405    1.218648
   5+ years  |   1.035207   .0650626     0.55   0.582     .9152278    1.170914
             |
cancer_hae~t |
  Last year  |   .8053532   .3296907    -0.53   0.597     .3610161    1.796578
2-5 years..  |   1.464828   .2514362     2.22   0.026     1.046354    2.050664
   5+ years  |   1.003158   .1208816     0.03   0.979      .792134    1.270398
             |
1.~r_disease |   .9407265   .0757546    -0.76   0.448     .8033744    1.101562
1.stroke_d~a |   1.032291   .0775439     0.42   0.672     .8909664    1.196032
1.other_ne~o |   .8313129   .0657013    -2.34   0.019     .7120186    .9705941
             |
reduced_ki~t |
Stage 3a/..  |   1.029222   .0755301     0.39   0.695      .891339    1.188433
Stage 4/5..  |   1.353418   .2383126     1.72   0.086     .9584089    1.911232
             |
      1.esrd |   .8206301   .1462412    -1.11   0.267     .5787064    1.163688
1.other_tr~t |   .7949161   .3627335    -0.50   0.615     .3250153     1.94419
  1.asplenia |   .9912412   .1627795    -0.05   0.957     .7184505    1.367609
1.ra_sle_p~s |   1.068427   .0238272     2.97   0.003     1.022733    1.116164
1.other_im~o |    1.04102   .0927999     0.45   0.652     .8741389    1.239761
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_M
> AINFULLYADJMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULL
> YADJMODEL_ageband_0W2.ster saved
(533,406 observations deleted)
   1:   6016.02 /        1 =    6016.0210

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,733,513             Number of obs    =   8,733,513
No. of failures      =      227,131
Time at risk         =    928344090
                                                Wald chi2(47)    =    28507.13
Log pseudolikelihood =   -2900401.1             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,502,867 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.077871   .0071838    11.25   0.000     1.063882    1.092043
 only 12-18  |   1.229807   .0097612    26.06   0.000     1.210824    1.249088
      mixed  |   1.264686   .0110605    26.85   0.000     1.243192    1.286551
             |
        age1 |   .9591815   .0007639   -52.33   0.000     .9576855    .9606798
        age2 |   1.105618    .002825    39.29   0.000     1.100094    1.111168
        age3 |   .7444269   .0056347   -38.99   0.000     .7334646     .755553
      1.male |   .8428429   .0033141   -43.48   0.000     .8363724    .8493635
             |
   obese4cat |
Obese I ..)  |   1.222688   .0073914    33.26   0.000     1.208286    1.237261
Obese II..)  |   1.241261   .0108188    24.80   0.000     1.220236    1.262647
Obese II..)  |    1.26536   .0143908    20.69   0.000     1.237466    1.293882
             |
smoke_nomiss |
     Former  |   1.061389   .0053912    11.73   0.000     1.050875    1.072008
    Current  |   .5904485   .0041455   -75.04   0.000     .5823792    .5986296
             |
         imd |
          2  |   1.028922   .0084329     3.48   0.001     1.012526    1.045584
          3  |   1.041487   .0085523     4.95   0.000     1.024859    1.058385
          4  |   1.084563   .0086865    10.14   0.000     1.067671    1.101722
5 most de..  |   1.067701   .0088063     7.94   0.000     1.050579    1.085101
             |
tot_adults~h |
          2  |   1.069396   .0066996    10.71   0.000     1.056346    1.082608
          3  |   1.194423   .0076971    27.57   0.000     1.179431    1.209604
             |
   ethnicity |
      Mixed  |    .987384    .017195    -0.73   0.466     .9542511    1.021667
Asian or ..  |    1.44843    .011523    46.57   0.000     1.426021    1.471192
      Black  |   .8349837   .0117675   -12.80   0.000     .8122355    .8583691
      Other  |   .7228498   .0117173   -20.02   0.000     .7002452     .746184
             |
1.htdiag_o~p |   1.044259   .0058426     7.74   0.000      1.03287    1.055773
1.~y_disease |   1.073081   .0171426     4.42   0.000     1.040003    1.107212
    1.asthma |   1.074278   .0059303    12.98   0.000     1.062717    1.085964
1.~c_disease |   1.112206   .0142206     8.32   0.000     1.084681     1.14043
             |
     diabcat |
T1DM, con..  |   .9567177   .0539106    -0.79   0.432     .8566807    1.068436
T1DM, unc..  |    1.07076   .0342231     2.14   0.032     1.005741    1.139981
T2DM, con..  |   1.097054    .014567     6.98   0.000     1.068871    1.125979
T2DM, unc..  |   1.183157   .0167861    11.85   0.000      1.15071    1.216519
Diabetes,..  |    .981337    .100225    -0.18   0.854     .8033115    1.198815
             |
cancer_exh~t |
  Last year  |   1.004692   .0466777     0.10   0.920     .9172473    1.100474
2-5 years..  |    1.01618    .026892     0.61   0.544     .9648157    1.070278
   5+ years  |   1.005388   .0204034     0.26   0.791     .9661832    1.046184
             |
cancer_hae~t |
  Last year  |   1.113964   .1502893     0.80   0.424     .8551302    1.451143
2-5 years..  |   1.016539   .0795373     0.21   0.834     .8720134    1.185018
   5+ years  |   .9943826     .04771    -0.12   0.907     .9051349     1.09243
             |
1.~r_disease |   1.011451   .0301316     0.38   0.702     .9540847    1.072266
1.stroke_d~a |   1.032036   .0254717     1.28   0.201     .9833002    1.083186
1.other_ne~o |   .8340206   .0233702    -6.48   0.000     .7894509    .8811065
             |
reduced_ki~t |
Stage 3a/..  |   1.036345   .0224463     1.65   0.099     .9932721    1.081287
Stage 4/5..  |   1.382051    .082484     5.42   0.000     1.229483    1.553552
             |
      1.esrd |   1.192963   .0691382     3.04   0.002     1.064867    1.336467
1.other_tr~t |   1.054359   .1355833     0.41   0.681     .8194641    1.356586
  1.asplenia |   .9769989   .0641162    -0.35   0.723     .8590795    1.111104
1.ra_sle_p~s |   1.067126   .0106346     6.52   0.000     1.046485    1.088174
1.other_im~o |   1.023049   .0383041     0.61   0.543     .9506632    1.100947
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_0W2.ster not
>  found)
file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_0W2.ster saved
   1:   1785.91 /        1 =    1785.9060

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,706,505             Number of obs    =   2,706,505
No. of failures      =       34,519
Time at risk         =    289075127
                                                Wald chi2(47)    =     9814.82
Log pseudolikelihood =   -397476.75             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,109,802 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.147622   .0448942     3.52   0.000      1.06292    1.239074
 only 12-18  |   1.160202   .0552815     3.12   0.002     1.056757    1.273772
      mixed  |   1.270277   .0715892     4.24   0.000     1.137436    1.418632
             |
        age1 |   .9415972   .0049591   -11.43   0.000     .9319276    .9513672
        age2 |   1.238957   .0340654     7.79   0.000     1.173957    1.307556
        age3 |   .7240817   .0421901    -5.54   0.000     .6459377    .8116794
      1.male |   1.066508   .0109581     6.27   0.000     1.045245    1.088203
             |
   obese4cat |
Obese I ..)  |   1.142138   .0159099     9.54   0.000     1.111377    1.173751
Obese II..)  |   1.188038   .0252923     8.09   0.000     1.139486    1.238658
Obese II..)  |   1.266438   .0398661     7.50   0.000     1.190663    1.347034
             |
smoke_nomiss |
     Former  |   1.149486   .0141915    11.28   0.000     1.122005     1.17764
    Current  |   .6689397   .0168701   -15.94   0.000     .6366788    .7028353
             |
         imd |
          2  |    1.11838   .0219641     5.70   0.000     1.076149    1.162268
          3  |   1.206424   .0239513     9.45   0.000     1.160381    1.254293
          4  |   1.401043   .0273466    17.28   0.000     1.348457    1.455679
5 most de..  |   1.666005   .0332168    25.60   0.000     1.602157    1.732397
             |
tot_adults~h |
          2  |   .9530488     .01273    -3.60   0.000     .9284222    .9783286
          3  |   1.194018   .0225393     9.39   0.000     1.150649    1.239022
             |
   ethnicity |
      Mixed  |   .9288675    .087947    -0.78   0.436     .7715434    1.118271
Asian or ..  |   1.847911   .0473816    23.95   0.000      1.75734    1.943151
      Black  |   .7566638   .0448423    -4.71   0.000     .6736868    .8498608
      Other  |   .9000649   .0606036    -1.56   0.118      .788788     1.02704
             |
1.htdiag_o~p |   1.004697   .0126951     0.37   0.711      .980121     1.02989
1.~y_disease |   1.413919   .0209425    23.38   0.000     1.373462    1.455567
    1.asthma |    1.10671   .0166804     6.73   0.000     1.074495    1.139891
1.~c_disease |   1.256392   .0159066    18.03   0.000       1.2256    1.287959
             |
     diabcat |
T1DM, con..  |   1.144211   .1516265     1.02   0.309     .8824863    1.483556
T1DM, unc..  |    1.35949   .1174173     3.56   0.000      1.14778    1.610249
T2DM, con..  |   1.134933   .0175409     8.19   0.000     1.101069    1.169838
T2DM, unc..  |   1.318875   .0264768    13.79   0.000     1.267989    1.371803
Diabetes,..  |   1.746985   .2630202     3.71   0.000     1.300574    2.346622
             |
cancer_exh~t |
  Last year  |   1.200685   .0579677     3.79   0.000     1.092281    1.319849
2-5 years..  |   1.085175   .0313044     2.83   0.005     1.025522    1.148299
   5+ years  |   1.075557   .0197395     3.97   0.000     1.037556     1.11495
             |
cancer_hae~t |
  Last year  |   1.208886   .1659532     1.38   0.167     .9237072    1.582109
2-5 years..  |   1.332247   .0966156     3.96   0.000     1.155726    1.535729
   5+ years  |   1.275462    .065632     4.73   0.000     1.153099    1.410808
             |
1.~r_disease |   1.361334   .0614293     6.84   0.000     1.246105    1.487218
1.stroke_d~a |   1.392702   .0241284    19.12   0.000     1.346205    1.440804
1.other_ne~o |   1.540705   .0478996    13.90   0.000     1.449626    1.637506
             |
reduced_ki~t |
Stage 3a/..  |    1.07954   .0147536     5.60   0.000     1.051008    1.108848
Stage 4/5..  |    1.45673   .0482847    11.35   0.000     1.365103    1.554509
             |
      1.esrd |   1.689295   .1227206     7.22   0.000     1.465106    1.947789
1.other_tr~t |   .9042847   .2339707    -0.39   0.697     .5445892    1.501555
  1.asplenia |   1.205389   .1170372     1.92   0.054     .9965056    1.458057
1.ra_sle_p~s |   1.100868   .0209595     5.05   0.000     1.060545    1.142724
1.other_im~o |   1.187195   .1282981     1.59   0.112     .9605814     1.46727
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFU
> LLYADJMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFULLYADJM
> ODEL_ageband_1W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.00185         0.14        1         0.7108
      2.kids_cat4 |      0.00766         2.46        1         0.1171
      3.kids_cat4 |      0.01030         4.31        1         0.0378
      age1        |     -0.01034         3.91        1         0.0479
      age2        |      0.01795        11.77        1         0.0006
      age3        |     -0.01605         9.37        1         0.0022
      0b.male     |            .            .        1             .
      1.male      |     -0.01036         3.17        1         0.0751
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01294         5.97        1         0.0145
      3.obese4cat |     -0.00703         1.73        1         0.1879
      4.obese4cat |      0.01573         8.76        1         0.0031
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00739         1.97        1         0.1607
      3.smoke_no~s|      0.03364        41.43        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00471         0.94        1         0.3324
      3.imd       |     -0.00281         0.33        1         0.5634
      4.imd       |     -0.01999        16.62        1         0.0000
      5.imd       |     -0.01292         6.99        1         0.0082
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.02634        27.23        1         0.0000
      3.tot_adul~h|     -0.01220         6.25        1         0.0124
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00627         1.41        1         0.2343
      3.ethnicity |     -0.04488        78.42        1         0.0000
      4.ethnicity |      0.00052         0.01        1         0.9194
      5.ethnicity |     -0.00230         0.19        1         0.6654
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.00433         0.66        1         0.4176
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00561         1.12        1         0.2894
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00127         0.06        1         0.8094
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.01690        10.06        1         0.0015
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00173         0.10        1         0.7476
      3.diabcat   |      0.00934         3.03        1         0.0820
      4.diabcat   |      0.01042         3.80        1         0.0513
      5.diabcat   |      0.01687        10.12        1         0.0015
      6.diabcat   |      0.00477         0.78        1         0.3757
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.01635         9.22        1         0.0024
      3.cancer_e~t|      0.00303         0.32        1         0.5726
      4.cancer_e~t|      0.00144         0.07        1         0.7894
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00016         0.00        1         0.9759
      3.cancer_h~t|      0.00115         0.05        1         0.8304
      4.cancer_h~t|      0.00391         0.53        1         0.4661
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01350         6.33        1         0.0119
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.02185        17.12        1         0.0000
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.02214        17.17        1         0.0000
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00998         3.49        1         0.0617
      3.reduced_~t|      0.00934         3.10        1         0.0781
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01249         5.41        1         0.0200
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00661         1.50        1         0.2200
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00577         1.16        1         0.2812
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00181         0.11        1         0.7358
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00338         0.40        1         0.5291
      ------------+---------------------------------------------------
      global test |                    736.84       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   3353.54 /        1 =    3353.5370
   1:     67.85 /        1 =      67.8470

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       44,335             Number of obs    =      44,335
No. of failures      =          891
Time at risk         =      4713767
                                                Wald chi2(47)    =    89041.86
Log pseudolikelihood =   -6724.8773             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,383 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.146727   .0922713     1.70   0.089     .9794183    1.342616
3 childre..  |   1.206772   .1469498     1.54   0.123     .9505473    1.532064
4+ childr..  |   1.136268   .2956654     0.49   0.623     .6823258    1.892212
             |
        age1 |   .9868178   .0274039    -0.48   0.633     .9345427    1.042017
        age2 |   1.048923   .1761601     0.28   0.776     .7547266    1.457799
        age3 |    .890234   .3331291    -0.31   0.756     .4275444    1.853647
      1.male |   1.108083    .075173     1.51   0.130     .9701215    1.265663
             |
   obese4cat |
Obese I ..)  |   1.250946   .1047641     2.67   0.008     1.061579    1.474093
Obese II..)  |   1.248019   .1585734     1.74   0.081     .9728981    1.600939
Obese II..)  |   1.026863   .2083812     0.13   0.896     .6898871    1.528434
             |
smoke_nomiss |
     Former  |   1.070333   .0851345     0.85   0.393     .9158289    1.250903
    Current  |    .541085   .0848267    -3.92   0.000     .3979435    .7357151
             |
         imd |
          2  |   .8944131   .1322899    -0.75   0.451     .6693288     1.19519
          3  |   1.145033   .1559017     0.99   0.320     .8768453    1.495248
          4  |   1.395771   .1802478     2.58   0.010     1.083656    1.797783
5 most de..  |   1.292775   .1721179     1.93   0.054      .995853    1.678226
             |
tot_adults~h |
          2  |   .7136719   .1499071    -1.61   0.108     .4728281    1.077194
          3  |   .8017088   .1542112    -1.15   0.251     .5499021    1.168821
             |
   ethnicity |
      Mixed  |   .8788065   .3362556    -0.34   0.736     .4151453    1.860315
Asian or ..  |   2.018941    .181357     7.82   0.000      1.69302    2.407605
      Black  |   .6482759    .164689    -1.71   0.088     .3940209    1.066597
      Other  |    .866065   .2123872    -0.59   0.558     .5355603    1.400531
             |
1.htdiag_o~p |    1.11674   .0893517     1.38   0.168     .9546545    1.306344
1.~y_disease |   1.316181   .1400669     2.58   0.010     1.068394    1.621436
    1.asthma |   1.141871   .1046713     1.45   0.148     .9540925    1.366607
1.~c_disease |   1.160679   .0964727     1.79   0.073     .9861941    1.366035
             |
     diabcat |
T1DM, con..  |   .8674906   .8950907    -0.14   0.890     .1148105    6.554629
T1DM, unc..  |   1.761146   .8932967     1.12   0.265      .651696     4.75933
T2DM, con..  |   1.250916   .1080481     2.59   0.010     1.056101    1.481668
T2DM, unc..  |   1.283098   .1315381     2.43   0.015     1.049538    1.568634
Diabetes,..  |   2.152749   1.059097     1.56   0.119     .8207748    5.646284
             |
cancer_exh~t |
  Last year  |   1.104631   .3917491     0.28   0.779     .5512456    2.213551
2-5 years..  |   .9479025   .2117168    -0.24   0.811     .6118505    1.468527
   5+ years  |   1.150102   .1672553     0.96   0.336     .8648665    1.529409
             |
cancer_hae~t |
  Last year  |   3.37e-16   8.08e-17  -148.64   0.000     2.11e-16    5.39e-16
2-5 years..  |   2.375346   .9626024     2.13   0.033     1.073445    5.256225
   5+ years  |   1.347787   .4844343     0.83   0.406     .6663068    2.726265
             |
1.~r_disease |   1.326087   .3682177     1.02   0.309     .7695146    2.285215
1.stroke_d~a |   .9613508   .1280284    -0.30   0.767     .7404959    1.248076
1.other_ne~o |   1.413149   .3034959     1.61   0.107     .9276389    2.152766
             |
reduced_ki~t |
Stage 3a/..  |   1.108381   .1055066     1.08   0.280     .9197361    1.335718
Stage 4/5..  |   .7801206   .1978125    -0.98   0.327     .4745975    1.282325
             |
      1.esrd |   3.743115   1.165617     4.24   0.000     2.033137    6.891279
1.other_tr~t |   2.25e-16   1.05e-16   -77.01   0.000     8.98e-17    5.62e-16
  1.asplenia |   1.272373   .8868726     0.35   0.730     .3245698    4.987937
1.ra_sle_p~s |   .8411202   .1190329    -1.22   0.221       .63738    1.109986
1.other_im~o |   3.09e-16   4.72e-17  -233.70   0.000     2.29e-16    4.17e-16
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_M
> AINFULLYADJMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULL
> YADJMODEL_ageband_1W2.ster saved
(55,013 observations deleted)
   1:   1726.62 /        1 =    1726.6150

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,651,492             Number of obs    =   2,651,492
No. of failures      =       33,687
Time at risk         =    283228611
                                                Wald chi2(47)    =     9581.13
Log pseudolikelihood =   -387242.86             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,067,442 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.154949   .0458741     3.63   0.000     1.068448    1.248452
 only 12-18  |   1.156176   .0561145     2.99   0.003     1.051263     1.27156
      mixed  |   1.273268   .0732571     4.20   0.000     1.137486    1.425258
             |
        age1 |   .9415861   .0050221   -11.28   0.000     .9317942    .9514809
        age2 |   1.236294   .0344378     7.61   0.000     1.170607    1.305668
        age3 |   .7269677   .0429261    -5.40   0.000     .6475201    .8161631
      1.male |   1.067296   .0111062     6.26   0.000     1.045748    1.089287
             |
   obese4cat |
Obese I ..)  |   1.145192   .0161313     9.62   0.000     1.114008     1.17725
Obese II..)  |   1.187629   .0255849     7.98   0.000     1.138527    1.238848
Obese II..)  |   1.268557    .040382     7.47   0.000     1.191829    1.350226
             |
smoke_nomiss |
     Former  |   1.150282   .0143768    11.20   0.000     1.122447    1.178808
    Current  |   .6717666   .0171495   -15.58   0.000     .6389812    .7062342
             |
         imd |
          2  |   1.116929   .0222073     5.56   0.000      1.07424    1.161314
          3  |   1.205943   .0242341     9.32   0.000     1.159368    1.254389
          4  |   1.404994   .0277426    17.22   0.000     1.351658    1.460434
5 most de..  |   1.664764   .0336101    25.25   0.000     1.600176    1.731959
             |
tot_adults~h |
          2  |   .9575668   .0129555    -3.20   0.001     .9325081    .9832989
          3  |   1.196801   .0228082     9.43   0.000     1.152923     1.24235
             |
   ethnicity |
      Mixed  |   .9474738   .0905014    -0.56   0.572     .7857087    1.142544
Asian or ..  |   1.862544   .0483471    23.96   0.000     1.770156    1.959755
      Black  |   .7463291   .0450787    -4.84   0.000     .6630058    .8401241
      Other  |   .9057252   .0619359    -1.45   0.148     .7921164    1.035628
             |
1.htdiag_o~p |   1.008464   .0129127     0.66   0.510     .9834708    1.034093
1.~y_disease |   1.412708    .021191    23.03   0.000     1.371779    1.454858
    1.asthma |   1.104862   .0168649     6.53   0.000     1.072297    1.138416
1.~c_disease |   1.256155   .0161054    17.79   0.000     1.224983    1.288121
             |
     diabcat |
T1DM, con..  |   1.148077   .1535084     1.03   0.302     .8834003    1.492053
T1DM, unc..  |   1.362245   .1189789     3.54   0.000     1.147918    1.616588
T2DM, con..  |    1.13433   .0177399     8.06   0.000     1.100088    1.169637
T2DM, unc..  |   1.320083   .0268305    13.66   0.000      1.26853    1.373731
Diabetes,..  |   1.717357    .270937     3.43   0.001     1.260584    2.339642
             |
cancer_exh~t |
  Last year  |   1.213042   .0590519     3.97   0.000     1.102652    1.334483
2-5 years..  |   1.084461   .0316583     2.78   0.005     1.024154     1.14832
   5+ years  |     1.0732   .0199554     3.80   0.000     1.034792    1.113033
             |
cancer_hae~t |
  Last year  |    1.19595   .1673338     1.28   0.201     .9091081    1.573297
2-5 years..  |    1.32593   .0974487     3.84   0.000     1.148053    1.531367
   5+ years  |   1.276107   .0663596     4.69   0.000     1.152453    1.413029
             |
1.~r_disease |    1.37392   .0625223     6.98   0.000     1.256684    1.502093
1.stroke_d~a |   1.386056   .0243928    18.55   0.000     1.339062    1.434699
1.other_ne~o |     1.5512   .0487789    13.96   0.000     1.458482    1.649812
             |
reduced_ki~t |
Stage 3a/..  |     1.0844   .0149943     5.86   0.000     1.055407    1.114191
Stage 4/5..  |   1.464404   .0491071    11.38   0.000     1.371251    1.563886
             |
      1.esrd |   1.710685   .1246918     7.37   0.000     1.482948    1.973395
1.other_tr~t |   .9178134   .2375325    -0.33   0.740     .5526641     1.52422
  1.asplenia |   1.201446   .1183293     1.86   0.062     .9905361    1.457265
1.ra_sle_p~s |   1.099225   .0211829     4.91   0.000     1.058482    1.141537
1.other_im~o |    1.21298   .1318504     1.78   0.076     .9802311    1.500994
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_1W2.ster not
>  found)
file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_1W2.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_tpp_probW2.lo
> g
  log type:  text
 closed on:  24 Jan 2021, 19:50:42
-------------------------------------------------------------------------------
