-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covidadmissionMAIN.
> log
  log type:  text
 opened on:  24 Jan 2021, 11:07:39

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   6196.99 /        1 =    6196.9920

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,334,392             Number of obs    =   9,334,392
No. of failures      =        6,374
Time at risk         =   1963027620
                                                Wald chi2(47)    =    13075.39
Log pseudolikelihood =   -77819.803             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,833,113 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9204611   .0377871    -2.02   0.043     .8493009    .9975836
 only 12-18  |   1.062155   .0466144     1.37   0.169      .974612    1.157562
      mixed  |   1.115288     .05613     2.17   0.030     1.010527     1.23091
             |
        age1 |   1.079317   .0085308     9.66   0.000     1.062725    1.096167
        age2 |    .963407   .0192903    -1.86   0.063      .926331    1.001967
        age3 |    1.01317   .0534664     0.25   0.804     .9136149    1.123573
      1.male |   1.422982   .0373279    13.45   0.000     1.351669    1.498057
             |
   obese4cat |
Obese I ..)  |   1.579627   .0521811    13.84   0.000     1.480594    1.685283
Obese II..)  |   2.098562   .0875667    17.76   0.000     1.933765    2.277403
Obese II..)  |   2.813885    .136886    21.27   0.000     2.557986    3.095383
             |
smoke_nomiss |
     Former  |   .9514072   .0269591    -1.76   0.079     .9000089    1.005741
    Current  |   .3939582    .018177   -20.19   0.000     .3598953     .431245
             |
         imd |
          2  |   1.064422   .0503729     1.32   0.187     .9701337    1.167875
          3  |   1.107572   .0515043     2.20   0.028     1.011089    1.213262
          4  |    1.28168   .0573918     5.54   0.000     1.173989     1.39925
5 most de..  |   1.459565   .0672069     8.21   0.000     1.333611    1.597415
             |
tot_adults~h |
          2  |   .9226739   .0320138    -2.32   0.020     .8620139    .9876026
          3  |   1.084931   .0373512     2.37   0.018     1.014139    1.160664
             |
   ethnicity |
      Mixed  |   2.325978    .190753    10.29   0.000     1.980608    2.731571
Asian or ..  |   2.534419   .1020512    23.10   0.000     2.342091     2.74254
      Black  |   2.567216   .1329213    18.21   0.000     2.319477    2.841414
      Other  |   2.458659    .162011    13.65   0.000     2.160774    2.797612
             |
1.htdiag_o~p |   1.283702   .0385063     8.33   0.000     1.210407    1.361436
1.~y_disease |   2.670911   .1275361    20.57   0.000     2.432285    2.932948
    1.asthma |    1.36745   .0425532    10.06   0.000      1.28654    1.453449
1.~c_disease |   1.479074   .0652159     8.88   0.000      1.35662     1.61258
             |
     diabcat |
T1DM, con..  |   1.688555   .3694817     2.39   0.017     1.099662    2.592813
T1DM, unc..  |   2.467837   .2894789     7.70   0.000     1.960966    3.105725
T2DM, con..  |   1.553294   .0720196     9.50   0.000     1.418362    1.701062
T2DM, unc..  |   2.209397   .0999902    17.52   0.000      2.02186    2.414329
Diabetes,..  |   1.887344   .5715466     2.10   0.036     1.042511    3.416815
             |
cancer_exh~t |
  Last year  |   2.330261   .3130664     6.30   0.000       1.7908    3.032228
2-5 years..  |   1.466403   .1450256     3.87   0.000      1.20801    1.780067
   5+ years  |    1.19669   .1042932     2.06   0.039     1.008784    1.419597
             |
cancer_hae~t |
  Last year  |   3.375011   1.032249     3.98   0.000     1.853254    6.146326
2-5 years..  |   4.762853   .7256216    10.25   0.000     3.533348     6.42019
   5+ years  |   1.810854   .2928232     3.67   0.000     1.318987    2.486146
             |
1.~r_disease |   2.054913   .1715572     8.63   0.000     1.744736    2.420233
1.stroke_d~a |   1.551849   .1110346     6.14   0.000     1.348796    1.785472
1.other_ne~o |   2.530028   .2078964    11.30   0.000     2.153678    2.972145
             |
reduced_ki~t |
Stage 3a/..  |   1.558244   .1000206     6.91   0.000     1.374037    1.767145
Stage 4/5..  |   2.472148   .3222275     6.94   0.000     1.914812    3.191705
             |
      1.esrd |   3.574861   .4458532    10.21   0.000     2.799614    4.564784
1.other_tr~t |   .8749566   .2753376    -0.42   0.671     .4721982    1.621245
  1.asplenia |   1.645391   .3577804     2.29   0.022     1.074435    2.519752
1.ra_sle_p~s |   1.242751   .0616819     4.38   0.000     1.127551    1.369721
1.other_im~o |    1.05979     .15821     0.39   0.697     .7909496    1.420008
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFU
> LLYADJMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJM
> ODEL_ageband_0MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.00863         0.49        1         0.4828
      2.kids_cat4 |     -0.01067         0.75        1         0.3850
      3.kids_cat4 |      0.00883         0.51        1         0.4738
      age1        |      0.01219         0.82        1         0.3639
      age2        |     -0.02888         4.89        1         0.0270
      age3        |      0.03039         5.54        1         0.0185
      0b.male     |            .            .        1             .
      1.male      |     -0.08021        46.96        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01978         2.90        1         0.0887
      3.obese4cat |     -0.00905         0.60        1         0.4379
      4.obese4cat |     -0.01700         2.24        1         0.1345
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01615         1.73        1         0.1889
      3.smoke_no~s|      0.06150        25.93        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.02511         4.24        1         0.0396
      3.imd       |      0.02616         4.57        1         0.0325
      4.imd       |      0.05053        17.13        1         0.0000
      5.imd       |      0.08123        46.55        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.01242         1.03        1         0.3099
      3.tot_adul~h|      0.01362         1.23        1         0.2669
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.01457         1.45        1         0.2284
      3.ethnicity |      0.05963        28.91        1         0.0000
      4.ethnicity |     -0.04391        13.99        1         0.0002
      5.ethnicity |     -0.02100         3.08        1         0.0793
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.02022         3.25        1         0.0714
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.01573         1.88        1         0.1707
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.02108         3.08        1         0.0791
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00086         0.01        1         0.9408
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01022         0.67        1         0.4144
      3.diabcat   |      0.01863         2.33        1         0.1266
      4.diabcat   |      0.01097         0.92        1         0.3384
      5.diabcat   |     -0.01574         1.95        1         0.1629
      6.diabcat   |     -0.00351         0.08        1         0.7746
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01450         1.40        1         0.2374
      3.cancer_e~t|     -0.00007         0.00        1         0.9954
      4.cancer_e~t|     -0.00405         0.11        1         0.7424
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00779         0.41        1         0.5243
      3.cancer_h~t|      0.00158         0.02        1         0.8959
      4.cancer_h~t|      0.00054         0.00        1         0.9641
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.04101        11.93        1         0.0006
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00171         0.02        1         0.8794
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00417         0.13        1         0.7219
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.00623         0.27        1         0.6021
      3.reduced_~t|     -0.00221         0.04        1         0.8424
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01392         1.59        1         0.2078
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00824         0.48        1         0.4888
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00029         0.00        1         0.9810
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.01971         2.64        1         0.1043
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00519         0.19        1         0.6651
      ------------+---------------------------------------------------
      global test |                    325.98       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:  10445.81 /        1 =   10445.8100
   1:   1922.48 /        1 =    1922.4790

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,918,698             Number of obs    =   1,918,698
No. of failures      =          874
Time at risk         =    404277167
                                                Wald chi2(47)    =    23370.71
Log pseudolikelihood =   -9277.1807             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,098,510 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9863058   .0754228    -0.18   0.857     .8490245    1.145785
3 childre..  |   1.104851     .12875     0.86   0.392     .8792495    1.388339
4+ childr..  |   .8857706   .2037667    -0.53   0.598      .564296    1.390386
             |
        age1 |   1.034494   .0178441     1.97   0.049     1.000105    1.070066
        age2 |   .9985866   .0460213    -0.03   0.976     .9123403    1.092986
        age3 |   .9958705   .1276582    -0.03   0.974     .7746212    1.280314
      1.male |   1.621569   .1179367     6.65   0.000     1.406136    1.870007
             |
   obese4cat |
Obese I ..)  |   1.695759   .1543546     5.80   0.000      1.41868    2.026954
Obese II..)  |   2.542959   .2896131     8.20   0.000     2.034218    3.178932
Obese II..)  |   3.184212   .4526383     8.15   0.000     2.409922    4.207276
             |
smoke_nomiss |
     Former  |   .9337783   .0740107    -0.86   0.387     .7994257     1.09071
    Current  |   .3578775   .0477203    -7.71   0.000     .2755708    .4647674
             |
         imd |
          2  |   .8966533    .115608    -0.85   0.398      .696429    1.154442
          3  |   .9774392   .1211838    -0.18   0.854     .7665791      1.2463
          4  |   1.123275   .1325191     0.99   0.324     .8913842    1.415491
5 most de..  |   1.199568   .1473874     1.48   0.139     .9428451    1.526194
             |
tot_adults~h |
          2  |   .9090596   .1086291    -0.80   0.425     .7192454    1.148967
          3  |    1.09745   .1389744     0.73   0.463     .8562363    1.406616
             |
   ethnicity |
      Mixed  |    2.58197   .5154184     4.75   0.000     1.745952    3.818298
Asian or ..  |   3.077951   .2974151    11.64   0.000     2.546902    3.719729
      Black  |   2.429148   .3479772     6.20   0.000     1.834505    3.216542
      Other  |    2.53196   .4266404     5.51   0.000     1.819817    3.522784
             |
1.htdiag_o~p |    1.35156   .1158613     3.51   0.000     1.142528    1.598836
1.~y_disease |   2.953291   .5027449     6.36   0.000     2.115458    4.122949
    1.asthma |   1.298578   .1135627     2.99   0.003      1.09403    1.541371
1.~c_disease |   1.698661   .2542611     3.54   0.000     1.266765    2.277809
             |
     diabcat |
T1DM, con..  |   2.405694    1.33369     1.58   0.113     .8116033    7.130779
T1DM, unc..  |   1.981527   .8256913     1.64   0.101     .8756064    4.484262
T2DM, con..  |   1.388582   .2182602     2.09   0.037     1.020418     1.88958
T2DM, unc..  |   2.807889   .3856655     7.52   0.000     2.145195    3.675302
Diabetes,..  |    2.54218    1.78312     1.33   0.183     .6429272    10.05196
             |
cancer_exh~t |
  Last year  |   3.554964   1.481466     3.04   0.002      1.57077    8.045588
2-5 years..  |   1.688265   .5734409     1.54   0.123     .8675994    3.285203
   5+ years  |   .8565756   .3548255    -0.37   0.709      .380335    1.929146
             |
cancer_hae~t |
  Last year  |   3.95e-17   1.05e-17  -141.80   0.000     2.34e-17    6.65e-17
2-5 years..  |   13.60664   4.323175     8.22   0.000     7.299662    25.36292
   5+ years  |   2.250942    1.13256     1.61   0.107     .8396202    6.034561
             |
1.~r_disease |   1.061382   .3906363     0.16   0.871     .5159306    2.183495
1.stroke_d~a |   1.745244   .4322509     2.25   0.025     1.074079    2.835805
1.other_ne~o |   2.056132   .6675639     2.22   0.026     1.088157    3.885173
             |
reduced_ki~t |
Stage 3a/..  |    1.03653   .2814804     0.13   0.895     .6087365    1.764958
Stage 4/5..  |   1.484799   .7176472     0.82   0.413     .5757804     3.82894
             |
      1.esrd |   3.788185    1.67163     3.02   0.003     1.595209    8.995903
1.other_tr~t |   1.503858   1.574606     0.39   0.697     .1931797    11.70718
  1.asplenia |   1.797504   1.308636     0.81   0.421     .4314895    7.488063
1.ra_sle_p~s |   1.341325   .1972295     2.00   0.046     1.005478     1.78935
1.other_im~o |   1.864576   .6855804     1.69   0.090     .9069937     3.83315
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_M
> AINFULLYADJMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULL
> YADJMODEL_ageband_0MAIN.ster saved
(748,903 observations deleted)
   1:   5619.53 /        1 =    5619.5300

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,585,489             Number of obs    =   8,585,489
No. of failures      =        5,947
Time at risk         =   1806450378
                                                Wald chi2(47)    =    12046.99
Log pseudolikelihood =   -72153.454             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,442,130 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9489253   .0402108    -1.24   0.216     .8732975    1.031102
 only 12-18  |   1.084026   .0486318     1.80   0.072     .9927795    1.183658
      mixed  |   1.116205   .0583277     2.10   0.035     1.007544    1.236584
             |
        age1 |   1.081002    .009188     9.16   0.000     1.063143     1.09916
        age2 |   .9645897   .0205026    -1.70   0.090      .925231    1.005623
        age3 |   1.006882   .0561053     0.12   0.902     .9027093    1.123076
      1.male |   1.436614   .0390488    13.33   0.000     1.362083    1.515224
             |
   obese4cat |
Obese I ..)  |   1.585464   .0539949    13.53   0.000      1.48309    1.694904
Obese II..)  |   2.078026   .0896531    16.95   0.000     1.909533    2.261386
Obese II..)  |   2.807808   .1406859    20.60   0.000     2.545176    3.097541
             |
smoke_nomiss |
     Former  |    .948376   .0277235    -1.81   0.070     .8955662      1.0043
    Current  |   .3880045   .0186667   -19.68   0.000     .3530904    .4263709
             |
         imd |
          2  |   1.089899   .0534337     1.76   0.079     .9900449    1.199824
          3  |   1.140334   .0549143     2.73   0.006     1.037627    1.253207
          4  |   1.314857   .0610987     5.89   0.000     1.200397    1.440231
5 most de..  |   1.485923   .0711122     8.28   0.000     1.352882    1.632046
             |
tot_adults~h |
          2  |   .9424423   .0340643    -1.64   0.101     .8779876    1.011629
          3  |   1.096348   .0394526     2.56   0.011     1.021686    1.176466
             |
   ethnicity |
      Mixed  |   2.352018     .20119    10.00   0.000     1.988976    2.781326
Asian or ..  |    2.49916   .1046969    21.86   0.000     2.302156    2.713022
      Black  |   2.557999    .138002    17.41   0.000      2.30133    2.843296
      Other  |   2.447592   .1704322    12.85   0.000     2.135343    2.805501
             |
1.htdiag_o~p |   1.288354   .0398312     8.20   0.000     1.212604    1.368835
1.~y_disease |   2.685931   .1316697    20.15   0.000     2.439874    2.956804
    1.asthma |   1.376502   .0441399     9.97   0.000     1.292652    1.465791
1.~c_disease |   1.473827   .0668985     8.54   0.000     1.348371    1.610955
             |
     diabcat |
T1DM, con..  |   1.469461   .3586064     1.58   0.115     .9108172    2.370745
T1DM, unc..  |   2.445665   .2984797     7.33   0.000     1.925363    3.106572
T2DM, con..  |    1.55673   .0741602     9.29   0.000     1.417958    1.709083
T2DM, unc..  |   2.205345   .1028408    16.96   0.000     2.012717    2.416407
Diabetes,..  |   1.990337   .6323344     2.17   0.030      1.06782     3.70984
             |
cancer_exh~t |
  Last year  |   2.106213    .307951     5.09   0.000     1.581421    2.805156
2-5 years..  |   1.482956   .1493963     3.91   0.000      1.21724    1.806676
   5+ years  |   1.214892   .1075237     2.20   0.028     1.021415    1.445017
             |
cancer_hae~t |
  Last year  |   3.343692   1.072754     3.76   0.000     1.782937    6.270707
2-5 years..  |   4.467705   .7208131     9.28   0.000     3.256513    6.129374
   5+ years  |   1.901728   .3080122     3.97   0.000     1.384471    2.612237
             |
1.~r_disease |   2.024777   .1761864     8.11   0.000     1.707299     2.40129
1.stroke_d~a |   1.534269    .113283     5.80   0.000     1.327556    1.773169
1.other_ne~o |   2.619927   .2182841    11.56   0.000     2.225204     3.08467
             |
reduced_ki~t |
Stage 3a/..  |   1.548067     .10246     6.60   0.000     1.359729    1.762492
Stage 4/5..  |   2.504836   .3387152     6.79   0.000     1.921657    3.264995
             |
      1.esrd |    3.39081   .4396807     9.42   0.000     2.629841    4.371972
1.other_tr~t |   .8005203     .27592    -0.65   0.519      .407365    1.573117
  1.asplenia |   1.657417   .3690958     2.27   0.023     1.071211    2.564418
1.ra_sle_p~s |   1.244432   .0634354     4.29   0.000      1.12611    1.375186
1.other_im~o |   .9975174    .159221    -0.02   0.988     .7295482    1.363914
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_0MAIN.ster n
> ot found)
file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_0MAIN.ster saved
   1:   1725.83 /        1 =    1725.8320

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,684,524             Number of obs    =   2,684,524
No. of failures      =        8,560
Time at risk         =    561156909
                                                Wald chi2(47)    =    12161.10
Log pseudolikelihood =   -95014.052             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,091,789 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.062027   .0845972     0.76   0.450     .9085149    1.241479
 only 12-18  |   1.033094   .0986592     0.34   0.733     .8567438    1.245743
      mixed  |   1.156808   .1336372     1.26   0.207     .9224195    1.450755
             |
        age1 |   1.006076   .0130089     0.47   0.639     .9808992    1.031899
        age2 |    1.30477    .080809     4.30   0.000     1.155623    1.473166
        age3 |   .5862115   .0750547    -4.17   0.000     .4561126    .7534191
      1.male |   1.560209   .0359226    19.32   0.000     1.491367    1.632229
             |
   obese4cat |
Obese I ..)  |   1.163344   .0329076     5.35   0.000     1.100602    1.229664
Obese II..)  |   1.484823   .0612525     9.58   0.000     1.369495    1.609862
Obese II..)  |   1.730403   .1045271     9.08   0.000     1.537196    1.947893
             |
smoke_nomiss |
     Former  |   1.231655   .0314089     8.17   0.000     1.171608     1.29478
    Current  |   .8463174   .0423983    -3.33   0.001     .7671676    .9336332
             |
         imd |
          2  |   1.135233   .0426171     3.38   0.001     1.054704     1.22191
          3  |   1.258807   .0467399     6.20   0.000     1.170453    1.353831
          4  |   1.440078   .0532487     9.86   0.000     1.339405    1.548318
5 most de..  |   1.581303   .0615792    11.77   0.000     1.465101    1.706722
             |
tot_adults~h |
          2  |   .7937279   .0203251    -9.02   0.000     .7548745    .8345811
          3  |   .9395346   .0339936    -1.72   0.085     .8752159     1.00858
             |
   ethnicity |
      Mixed  |   1.213137   .1788575     1.31   0.190     .9086862    1.619593
Asian or ..  |   1.549515   .0736911     9.21   0.000      1.41161    1.700893
      Black  |   1.467321     .10231     5.50   0.000     1.279896    1.682193
      Other  |    1.26586   .1289807     2.31   0.021     1.036706    1.545668
             |
1.htdiag_o~p |   .9712086   .0265675    -1.07   0.286     .9205085    1.024701
1.~y_disease |    1.96341   .0511156    25.92   0.000     1.865738    2.066194
    1.asthma |   1.098072   .0325256     3.16   0.002     1.036138    1.163708
1.~c_disease |   1.377373   .0330129    13.36   0.000     1.314165    1.443621
             |
     diabcat |
T1DM, con..  |   1.871872   .3733141     3.14   0.002     1.266245     2.76716
T1DM, unc..  |   2.105524   .2896083     5.41   0.000     1.607978    2.757022
T2DM, con..  |     1.3691   .0390765    11.01   0.000     1.294614    1.447871
T2DM, unc..  |   1.926783   .0662512    19.07   0.000     1.801212    2.061108
Diabetes,..  |   2.608829   .5905351     4.24   0.000     1.674046    4.065592
             |
cancer_exh~t |
  Last year  |   1.919582   .1379422     9.07   0.000     1.667397     2.20991
2-5 years..  |   1.190715   .0629148     3.30   0.001     1.073574    1.320637
   5+ years  |   1.134736   .0384298     3.73   0.000      1.06186    1.212613
             |
cancer_hae~t |
  Last year  |   2.620258   .4446205     5.68   0.000     1.878915    3.654103
2-5 years..  |   2.505946   .2478622     9.29   0.000     2.064332    3.042031
   5+ years  |   1.488012   .1309409     4.52   0.000     1.252285    1.768112
             |
1.~r_disease |   1.689547   .1315344     6.74   0.000     1.450449    1.968058
1.stroke_d~a |   1.612128   .0477544    16.12   0.000     1.521196    1.708495
1.other_ne~o |   2.085272   .1062138    14.43   0.000     1.887151    2.304193
             |
reduced_ki~t |
Stage 3a/..  |   1.261387   .0327955     8.93   0.000      1.19872    1.327331
Stage 4/5..  |    2.06799   .1011118    14.86   0.000     1.879014    2.275971
             |
      1.esrd |   3.272357   .2748629    14.11   0.000     2.775643    3.857959
1.other_tr~t |   1.132532   .4063555     0.35   0.729     .5605791    2.288041
  1.asplenia |    1.37315   .2378191     1.83   0.067     .9779039    1.928144
1.ra_sle_p~s |   1.241729   .0448832     5.99   0.000     1.156804     1.33289
1.other_im~o |   1.489005   .2607871     2.27   0.023     1.056368    2.098829
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFU
> LLYADJMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJM
> ODEL_ageband_1MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.02462         5.42        1         0.0200
      2.kids_cat4 |      0.01576         2.20        1         0.1382
      3.kids_cat4 |      0.04378        16.85        1         0.0000
      age1        |     -0.00113         0.01        1         0.9162
      age2        |     -0.00602         0.31        1         0.5758
      age3        |      0.00806         0.56        1         0.4544
      0b.male     |            .            .        1             .
      1.male      |     -0.04225        15.70        1         0.0001
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02484         5.42        1         0.0199
      3.obese4cat |     -0.02751         6.74        1         0.0094
      4.obese4cat |     -0.00759         0.50        1         0.4776
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00742         0.48        1         0.4902
      3.smoke_no~s|      0.02229         4.52        1         0.0336
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00357         0.12        1         0.7341
      3.imd       |      0.01008         0.90        1         0.3420
      4.imd       |      0.02080         3.89        1         0.0485
      5.imd       |      0.04382        17.65        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00109         0.01        1         0.9159
      3.tot_adul~h|      0.01412         1.88        1         0.1699
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.01463         2.04        1         0.1531
      3.ethnicity |      0.06549        37.99        1         0.0000
      4.ethnicity |     -0.01736         2.74        1         0.0977
      5.ethnicity |     -0.00590         0.31        1         0.5770
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01495         2.03        1         0.1542
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.02126         4.20        1         0.0405
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01719         2.60        1         0.1069
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.03696        12.91        1         0.0003
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00523         0.25        1         0.6196
      3.diabcat   |      0.00865         0.66        1         0.4149
      4.diabcat   |     -0.00491         0.22        1         0.6426
      5.diabcat   |     -0.02667         6.31        1         0.0120
      6.diabcat   |     -0.01311         1.56        1         0.2111
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.02051         3.71        1         0.0542
      3.cancer_e~t|     -0.00030         0.00        1         0.9779
      4.cancer_e~t|     -0.00082         0.01        1         0.9392
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01501         2.03        1         0.1546
      3.cancer_h~t|     -0.00890         0.71        1         0.4009
      4.cancer_h~t|     -0.01035         0.95        1         0.3286
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01470         1.91        1         0.1667
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00182         0.03        1         0.8582
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00298         0.08        1         0.7722
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01321         1.68        1         0.1945
      3.reduced_~t|     -0.02244         4.70        1         0.0302
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00633         0.33        1         0.5641
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00722         0.46        1         0.4961
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.01769         2.77        1         0.0962
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00590         0.31        1         0.5806
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00067         0.00        1         0.9492
      ------------+---------------------------------------------------
      global test |                    223.39       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   3123.27 /        1 =    3123.2730
   1:     65.97 /        1 =      65.9720

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       44,420             Number of obs    =      44,420
No. of failures      =          186
Time at risk         =      9261694
                                                Wald chi2(41)    =      352.81
Log pseudolikelihood =   -1353.4081             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,511 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.057364   .1818555     0.32   0.746     .7547913    1.481229
3 childre..  |   1.610121    .357727     2.14   0.032     1.041703    2.488705
4+ childr..  |    .812775   .4881553    -0.35   0.730     .2504586    2.637574
             |
        age1 |   1.018737   .0654052     0.29   0.772     .8982823    1.155343
        age2 |   1.143887   .3866159     0.40   0.691     .5897802    2.218584
        age3 |   .7339045    .525529    -0.43   0.666     .1803505    2.986495
      1.male |   1.616237   .2667639     2.91   0.004     1.169532    2.233562
             |
   obese4cat |
Obese I ..)  |   1.940175   .3219418     3.99   0.000     1.401514    2.685867
Obese II..)  |   .8010998   .3026413    -0.59   0.557     .3820478    1.679792
Obese II..)  |   1.757494   .6967166     1.42   0.155     .8080821    3.822367
             |
smoke_nomiss |
     Former  |   1.143909   .2012994     0.76   0.445     .8102167    1.615034
    Current  |   .8587422   .2814368    -0.46   0.642     .4517492    1.632406
             |
         imd |
          2  |   .8806953   .2950572    -0.38   0.705     .4567196     1.69825
          3  |   .9693886   .2994357    -0.10   0.920     .5291382    1.775933
          4  |    1.47686   .4249635     1.36   0.175     .8402489    2.595798
5 most de..  |   1.867932   .5509827     2.12   0.034      1.04781    3.329963
             |
tot_adults~h |
          2  |    .718472   .3054674    -0.78   0.437      .312256    1.653137
          3  |   .6140104   .2407924    -1.24   0.214     .2846857    1.324298
             |
   ethnicity |
      Mixed  |   1.368378   .7765191     0.55   0.580     .4499574    4.161414
Asian or ..  |   1.561298   .3089324     2.25   0.024     1.059399    2.300977
      Black  |   .7854797   .3275257    -0.58   0.563     .3469005    1.778546
      Other  |   1.129395   .4974235     0.28   0.782      .476374    2.677587
             |
1.htdiag_o~p |   .9218778   .1746502    -0.43   0.668     .6359351    1.336392
1.~y_disease |   1.516043   .3101154     2.03   0.042     1.015297    2.263756
    1.asthma |   1.046555    .199025     0.24   0.811     .7209212    1.519275
1.~c_disease |   1.548414   .2632922     2.57   0.010     1.109555    2.160853
             |
     diabcat |
T1DM, con..  |   1.66e-19          .        .       .            .           .
T1DM, unc..  |   1.526867   1.584417     0.41   0.683     .1997635    11.67041
T2DM, con..  |   1.324715    .248728     1.50   0.134     .9168558    1.914008
T2DM, unc..  |   1.844403   .3860731     2.92   0.003     1.223717    2.779909
Diabetes,..  |   1.26e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.426028   .8406599     0.60   0.547     .4490919    4.528153
2-5 years..  |   .9971524   .4571963    -0.01   0.995     .4059607    2.449284
   5+ years  |   .6449308   .2475378    -1.14   0.253     .3039515    1.368428
             |
cancer_hae~t |
  Last year  |   3.33e-19          .        .       .            .           .
2-5 years..  |   1.541397   1.539379     0.43   0.665     .2176844    10.91444
   5+ years  |     2.1385   1.296041     1.25   0.210     .6519845     7.01425
             |
1.~r_disease |   1.715184   .8108347     1.14   0.254     .6790701    4.332186
1.stroke_d~a |   1.099722   .2617021     0.40   0.690     .6897978    1.753252
1.other_ne~o |   2.514677   .8366133     2.77   0.006     1.310069    4.826922
             |
reduced_ki~t |
Stage 3a/..  |   1.678037    .297863     2.92   0.004      1.18497    2.376269
Stage 4/5..  |   3.678071   1.106281     4.33   0.000     2.039847    6.631968
             |
      1.esrd |   2.099456     .94098     1.65   0.098     .8721613    5.053786
1.other_tr~t |   2.21e-19          .        .       .            .           .
  1.asplenia |   3.24e-19          .        .       .            .           .
1.ra_sle_p~s |   1.105657   .3098854     0.36   0.720     .6383403    1.915089
1.other_im~o |   1.14e-19          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_M
> AINFULLYADJMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULL
> YADJMODEL_ageband_1MAIN.ster saved
(72,537 observations deleted)
   1:   1646.74 /        1 =    1646.7410

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,611,987             Number of obs    =   2,611,987
No. of failures      =        8,247
Time at risk         =    546105884
                                                Wald chi2(47)    =    11724.24
Log pseudolikelihood =   -91336.992             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,035,758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.078527    .088446     0.92   0.357     .9183898    1.266587
 only 12-18  |   1.027705   .1016429     0.28   0.782      .846608    1.247541
      mixed  |   1.165054   .1386898     1.28   0.199      .922609    1.471209
             |
        age1 |   1.002865   .0132183     0.22   0.828     .9772897     1.02911
        age2 |   1.321527   .0834468     4.42   0.000      1.16769    1.495631
        age3 |    .571795    .074637    -4.28   0.000     .4427231    .7384966
      1.male |    1.55852   .0365862    18.90   0.000     1.488437    1.631903
             |
   obese4cat |
Obese I ..)  |   1.164073   .0335054     5.28   0.000     1.100222     1.23163
Obese II..)  |    1.47867   .0622617     9.29   0.000     1.361539    1.605878
Obese II..)  |    1.72538   .1062892     8.85   0.000     1.529142    1.946801
             |
smoke_nomiss |
     Former  |   1.237764   .0321603     8.21   0.000     1.176309    1.302429
    Current  |   .8445707   .0432618    -3.30   0.001     .7638966    .9337648
             |
         imd |
          2  |    1.12586   .0430129     3.10   0.002     1.044635      1.2134
          3  |   1.244358   .0470688     5.78   0.000     1.155442    1.340117
          4  |   1.431869   .0538511     9.55   0.000     1.330119    1.541403
5 most de..  |    1.56988   .0620852    11.40   0.000     1.452792    1.696405
             |
tot_adults~h |
          2  |   .7977622   .0207751    -8.68   0.000     .7580655    .8395376
          3  |    .923839   .0342444    -2.14   0.033     .8591013     .993455
             |
   ethnicity |
      Mixed  |   1.234939   .1861514     1.40   0.162     .9190466    1.659408
Asian or ..  |   1.558127   .0759853     9.09   0.000     1.416094    1.714405
      Black  |   1.480091   .1053825     5.51   0.000     1.287309    1.701744
      Other  |   1.309085   .1348403     2.61   0.009     1.069771    1.601933
             |
1.htdiag_o~p |   .9698589   .0270343    -1.10   0.272     .9182941    1.024319
1.~y_disease |   1.975824   .0523185    25.72   0.000     1.875897    2.081074
    1.asthma |   1.092827   .0330149     2.94   0.003     1.029997    1.159489
1.~c_disease |   1.381044   .0337448    13.21   0.000     1.316464    1.448791
             |
     diabcat |
T1DM, con..  |   1.855207   .3770633     3.04   0.002      1.24563    2.763094
T1DM, unc..  |   2.016217   .2878067     4.91   0.000     1.524164    2.667121
T2DM, con..  |    1.36003   .0396237    10.55   0.000     1.284544    1.439951
T2DM, unc..  |   1.920632   .0672845    18.63   0.000     1.793183     2.05714
Diabetes,..  |   2.756779   .6405881     4.36   0.000     1.748275    4.347046
             |
cancer_exh~t |
  Last year  |   1.885969   .1393047     8.59   0.000      1.63178    2.179754
2-5 years..  |   1.206055   .0643495     3.51   0.000     1.086303    1.339009
   5+ years  |   1.112717   .0386152     3.08   0.002     1.039549    1.191035
             |
cancer_hae~t |
  Last year  |   2.673647   .4602731     5.71   0.000     1.907955    3.746622
2-5 years..  |   2.559454   .2544392     9.45   0.000     2.106338    3.110044
   5+ years  |   1.486799   .1333429     4.42   0.000     1.247132    1.772523
             |
1.~r_disease |   1.645256   .1323364     6.19   0.000     1.405293    1.926194
1.stroke_d~a |   1.598454   .0483746    15.50   0.000     1.506399    1.696135
1.other_ne~o |     2.1024   .1091462    14.31   0.000     1.899001    2.327584
             |
reduced_ki~t |
Stage 3a/..  |   1.261472   .0334252     8.77   0.000     1.197631    1.328715
Stage 4/5..  |   2.117688   .1048494    15.15   0.000     1.921843    2.333491
             |
      1.esrd |   3.245715   .2780623    13.74   0.000     2.744021    3.839134
1.other_tr~t |   1.212085   .4352661     0.54   0.592     .5996003    2.450214
  1.asplenia |   1.395991   .2453938     1.90   0.058     .9891328    1.970202
1.ra_sle_p~s |   1.240021   .0456144     5.85   0.000     1.153765    1.332725
1.other_im~o |   1.400082   .2567896     1.83   0.067     .9773148    2.005731
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_1MAIN.ster n
> ot found)
file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_1MAIN.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covidadmissionMAIN.
> log
  log type:  text
 closed on:  24 Jan 2021, 19:40:34
-------------------------------------------------------------------------------
