-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_deathMAIN.log
  log type:  text
 opened on:  24 Jan 2021, 10:00:01

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   3875.79 /        1 =    3875.7940

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,334,392             Number of obs    =   9,334,392
No. of failures      =        1,219
Time at risk         =   1963761391
                                                Wald chi2(47)    =     6519.16
Log pseudolikelihood =   -13959.663             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,833,113 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7146789   .0830924    -2.89   0.004     .5690438    .8975864
 only 12-18  |   .8667304   .1005393    -1.23   0.218      .690472    1.087983
      mixed  |   .7593822   .1189673    -1.76   0.079     .5586096    1.032315
             |
        age1 |   1.162304   .0492156     3.55   0.000     1.069737     1.26288
        age2 |   .9260031   .0826334    -0.86   0.389      .777417    1.102988
        age3 |   1.103321   .2358595     0.46   0.646     .7256692    1.677511
      1.male |   1.785093   .1114752     9.28   0.000     1.579447    2.017514
             |
   obese4cat |
Obese I ..)  |     1.1522   .0890313     1.83   0.067     .9902733    1.340605
Obese II..)  |   1.919362   .1725651     7.25   0.000     1.609264    2.289214
Obese II..)  |    2.43072   .2643687     8.17   0.000     1.964071    3.008243
             |
smoke_nomiss |
     Former  |   1.087394   .0709645     1.28   0.199     .9568339    1.235769
    Current  |   .7440667     .06536    -3.37   0.001     .6263845    .8838585
             |
         imd |
          2  |   1.276124    .151595     2.05   0.040     1.011058    1.610683
          3  |   1.466327   .1666893     3.37   0.001     1.173459    1.832288
          4  |   1.890734   .2049324     5.88   0.000      1.52887    2.338246
5 most de..  |   1.846426   .2103591     5.38   0.000     1.476918     2.30838
             |
tot_adults~h |
          2  |   .7954432   .0608898    -2.99   0.003     .6846225    .9242025
          3  |   1.018647   .0753282     0.25   0.803     .8812067    1.177523
             |
   ethnicity |
      Mixed  |   2.275638   .4424441     4.23   0.000     1.554559    3.331189
Asian or ..  |   2.278682   .2081764     9.02   0.000     1.905107    2.725512
      Black  |   2.319676   .2718976     7.18   0.000      1.84355    2.918769
      Other  |   2.103495   .3455685     4.53   0.000     1.524416    2.902549
             |
1.htdiag_o~p |   1.276408   .0856389     3.64   0.000     1.119127    1.455794
1.~y_disease |   2.491551   .2279234     9.98   0.000     2.082587    2.980824
    1.asthma |   1.155856    .085487     1.96   0.050     .9998821     1.33616
1.~c_disease |   1.480795   .1262291     4.61   0.000     1.252953    1.750068
             |
     diabcat |
T1DM, con..  |   2.009764   .8342605     1.68   0.093     .8908574    4.534005
T1DM, unc..  |    2.88212   .6607349     4.62   0.000     1.838957    4.517027
T2DM, con..  |    1.75389   .1628235     6.05   0.000     1.462112    2.103896
T2DM, unc..  |   2.717902   .2440468    11.14   0.000     2.279305    3.240896
Diabetes,..  |   5.094962   1.985348     4.18   0.000     2.373855    10.93522
             |
cancer_exh~t |
  Last year  |   5.114693   .9387292     8.89   0.000     3.569387    7.329014
2-5 years..  |   2.588057   .3924706     6.27   0.000     1.922613    3.483822
   5+ years  |   1.749943   .2608203     3.75   0.000     1.306642    2.343642
             |
cancer_hae~t |
  Last year  |    7.67175   2.946306     5.31   0.000     3.614047    16.28527
2-5 years..  |   5.501783    1.47251     6.37   0.000     3.256011    9.296534
   5+ years  |    2.36634   .6512786     3.13   0.002     1.379763    4.058355
             |
1.~r_disease |   3.075671   .4195572     8.24   0.000     2.354106    4.018404
1.stroke_d~a |   1.636019   .2025348     3.98   0.000     1.283547    2.085282
1.other_ne~o |   4.230016   .5744691    10.62   0.000     3.241472    5.520035
             |
reduced_ki~t |
Stage 3a/..  |   2.674547   .2686349     9.79   0.000     2.196618    3.256462
Stage 4/5..  |   6.538452   1.342771     9.14   0.000     4.371874    9.778724
             |
      1.esrd |   1.915256   .4380974     2.84   0.004      1.22327    2.998689
1.other_tr~t |   .8495937   .4537564    -0.31   0.760     .2982608    2.420062
  1.asplenia |   1.250437   .5709353     0.49   0.624     .5109908    3.059925
1.ra_sle_p~s |   1.195356   .1270992     1.68   0.093     .9704899    1.472324
1.other_im~o |   2.098184   .4815129     3.23   0.001     1.338138    3.289926
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLY
> ADJMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLYADJMODE
> L_ageband_0MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00878         0.11        1         0.7427
      2.kids_cat4 |      0.02511         0.90        1         0.3421
      3.kids_cat4 |      0.02417         0.80        1         0.3703
      age1        |      0.04707         3.48        1         0.0623
      age2        |     -0.04734         3.47        1         0.0624
      age3        |      0.04557         3.16        1         0.0753
      0b.male     |            .            .        1             .
      1.male      |     -0.04816         3.64        1         0.0565
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.07202         7.65        1         0.0057
      3.obese4cat |     -0.07230         7.77        1         0.0053
      4.obese4cat |     -0.07993        10.58        1         0.0011
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01142         0.17        1         0.6813
      3.smoke_no~s|      0.06245         5.02        1         0.0250
      1b.imd      |            .            .        1             .
      2.imd       |      0.02623         0.93        1         0.3352
      3.imd       |      0.03334         1.52        1         0.2181
      4.imd       |      0.04809         3.13        1         0.0770
      5.imd       |      0.09611        13.44        1         0.0002
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.04094         2.32        1         0.1275
      3.tot_adul~h|     -0.04165         2.26        1         0.1328
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.01503         0.31        1         0.5769
      3.ethnicity |      0.04181         2.50        1         0.1140
      4.ethnicity |     -0.03793         2.15        1         0.1424
      5.ethnicity |     -0.01071         0.16        1         0.6925
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.03252         1.65        1         0.1987
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01706         0.46        1         0.4957
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.01773         0.47        1         0.4931
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00332         0.02        1         0.8922
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01604         0.34        1         0.5576
      3.diabcat   |     -0.03399         1.74        1         0.1869
      4.diabcat   |     -0.03135         1.55        1         0.2135
      5.diabcat   |     -0.04068         2.99        1         0.0839
      6.diabcat   |     -0.00360         0.02        1         0.8912
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.07028         7.05        1         0.0079
      3.cancer_e~t|      0.06271         5.69        1         0.0171
      4.cancer_e~t|      0.01947         0.55        1         0.4586
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02684         1.00        1         0.3174
      3.cancer_h~t|     -0.00605         0.05        1         0.8174
      4.cancer_h~t|     -0.00669         0.06        1         0.8019
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.08749        12.95        1         0.0003
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01216         0.24        1         0.6248
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01324         0.28        1         0.5994
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01149         0.20        1         0.6526
      3.reduced_~t|      0.02476         1.47        1         0.2254
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.02511         1.48        1         0.2238
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.01649         0.46        1         0.4982
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.01953         0.55        1         0.4574
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.04067         2.28        1         0.1308
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.04521         3.15        1         0.0758
      ------------+---------------------------------------------------
      global test |                     98.14       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   5102.01 /        1 =    5102.0100
   1:   2461.10 /        1 =    2461.1020

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,918,698             Number of obs    =   1,918,698
No. of failures      =           92
Time at risk         =    404381540
                                                Wald chi2(47)    =    60353.50
Log pseudolikelihood =   -870.76773             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,098,510 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .7419905   .1768339    -1.25   0.211     .4650899     1.18375
3 childre..  |   .5860061   .2594354    -1.21   0.227     .2460707    1.395547
4+ childr..  |   .8289322   .6044045    -0.26   0.797     .1985533    3.460676
             |
        age1 |   1.063662   .0676208     0.97   0.332     .9390517    1.204807
        age2 |   1.081458   .1714944     0.49   0.621     .7925535    1.475675
        age3 |   .7989675   .3345274    -0.54   0.592     .3516668     1.81521
      1.male |   2.255066    .525287     3.49   0.000     1.428511    3.559878
             |
   obese4cat |
Obese I ..)  |   1.068612   .3273149     0.22   0.828     .5862704    1.947791
Obese II..)  |   2.626023   .8019989     3.16   0.002     1.443238    4.778144
Obese II..)  |   3.848712   1.459166     3.55   0.000     1.830622     8.09156
             |
smoke_nomiss |
     Former  |    .816556   .2011365    -0.82   0.411     .5038665    1.323294
    Current  |   .4834431   .1754279    -2.00   0.045     .2373932    .9845151
             |
         imd |
          2  |   1.273665   .6128439     0.50   0.615     .4960052    3.270575
          3  |   1.869692   .8094705     1.45   0.148     .8002911    4.368094
          4  |   1.630307    .716339     1.11   0.266      .689066    3.857252
5 most de..  |   2.096422   .9388828     1.65   0.098     .8715011    5.043005
             |
tot_adults~h |
          2  |   .4860499   .2006282    -1.75   0.080     .2164353    1.091525
          3  |   .9277299   .3783122    -0.18   0.854     .4171731    2.063131
             |
   ethnicity |
      Mixed  |   6.373132   2.910648     4.06   0.000     2.603778    15.59918
Asian or ..  |   3.138624   1.018893     3.52   0.000     1.661167    5.930146
      Black  |   1.940878    .974369     1.32   0.187     .7255607    5.191855
      Other  |   1.151353   .8258904     0.20   0.844     .2822428    4.696711
             |
1.htdiag_o~p |   .9801499   .2696856    -0.07   0.942     .5715927    1.680731
1.~y_disease |   3.738169    1.32568     3.72   0.000     1.865495    7.490721
    1.asthma |   1.607927   .4097755     1.86   0.062     .9757534    2.649674
1.~c_disease |   1.611862   .5330418     1.44   0.149     .8430166    3.081909
             |
     diabcat |
T1DM, con..  |   1.88e-17   5.93e-18  -121.81   0.000     1.01e-17    3.49e-17
T1DM, unc..  |   3.325554   3.690671     1.08   0.279     .3777529    29.27657
T2DM, con..  |    1.91072    .656325     1.88   0.059     .9745686    3.746119
T2DM, unc..  |   2.724604   1.004115     2.72   0.007     1.323137    5.610506
Diabetes,..  |   11.30226   11.95577     2.29   0.022       1.4215    89.86362
             |
cancer_exh~t |
  Last year  |   9.432082   7.052415     3.00   0.003     2.178512    40.83713
2-5 years..  |   2.091528   1.565338     0.99   0.324     .4824017     9.06815
   5+ years  |   .8153506   .8459011    -0.20   0.844     .1067208    6.229306
             |
cancer_hae~t |
  Last year  |   7.49e-18   3.56e-18   -82.89   0.000     2.95e-18    1.90e-17
2-5 years..  |   34.10283    19.5261     6.16   0.000     11.10253    104.7512
   5+ years  |   7.676203    5.53201     2.83   0.005     1.869437    31.51969
             |
1.~r_disease |    1.72095   1.291948     0.72   0.470     .3951443    7.495155
1.stroke_d~a |   1.426482   .7819513     0.65   0.517     .4871529    4.177029
1.other_ne~o |   2.819877   2.081776     1.40   0.160     .6634838    11.98478
             |
reduced_ki~t |
Stage 3a/..  |   1.761937   .9046291     1.10   0.270     .6441086    4.819719
Stage 4/5..  |   3.800018   3.208241     1.58   0.114     .7263429    19.88061
             |
      1.esrd |    .817617    .952955    -0.17   0.863     .0832628    8.028763
1.other_tr~t |   3.01e-17   1.57e-17   -73.07   0.000     1.08e-17    8.34e-17
  1.asplenia |   1.38e-17   5.44e-18   -98.57   0.000     6.38e-18    2.99e-17
1.ra_sle_p~s |   .7661789   .3967427    -0.51   0.607     .2776906    2.113972
1.other_im~o |   1.920942   2.069439     0.61   0.545     .2325474    15.86781
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAIN
> FULLYADJMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYAD
> JMODEL_ageband_0MAIN.ster saved
(748,903 observations deleted)
   1:   3315.32 /        1 =    3315.3250

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,585,489             Number of obs    =   8,585,489
No. of failures      =        1,150
Time at risk         =   1807134703
                                                Wald chi2(47)    =     6174.66
Log pseudolikelihood =   -13127.064             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,442,130 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7418703   .0880783    -2.51   0.012     .5878538    .9362388
 only 12-18  |   .9000427   .1055307    -0.90   0.369     .7152521    1.132575
      mixed  |   .7908232   .1260391    -1.47   0.141     .5786519     1.08079
             |
        age1 |   1.159731   .0514178     3.34   0.001     1.063209    1.265017
        age2 |   .9287734   .0867593    -0.79   0.429     .7733866     1.11538
        age3 |   1.095844   .2452101     0.41   0.683     .7067742    1.699091
      1.male |   1.783527   .1146007     9.00   0.000     1.572482    2.022897
             |
   obese4cat |
Obese I ..)  |   1.151667   .0917449     1.77   0.076     .9851856    1.346282
Obese II..)  |   1.918012   .1774713     7.04   0.000     1.599892    2.299386
Obese II..)  |   2.446468    .273005     8.02   0.000     1.965861    3.044573
             |
smoke_nomiss |
     Former  |   1.083701   .0722747     1.21   0.228     .9509124    1.235032
    Current  |   .7465366   .0675668    -3.23   0.001     .6251891    .8914372
             |
         imd |
          2  |   1.316122   .1616104     2.24   0.025     1.034605     1.67424
          3  |   1.529157   .1798269     3.61   0.000     1.214372    1.925538
          4  |   1.944397    .218617     5.91   0.000     1.559842    2.423757
5 most de..  |   1.922245    .227308     5.53   0.000      1.52459     2.42362
             |
tot_adults~h |
          2  |   .8275475   .0660045    -2.37   0.018     .7077858    .9675736
          3  |   1.061392   .0819667     0.77   0.440      .912307    1.234839
             |
   ethnicity |
      Mixed  |   2.261224   .4564409     4.04   0.000     1.522383     3.35864
Asian or ..  |   2.242149   .2113988     8.56   0.000     1.863845    2.697237
      Black  |   2.310445   .2801124     6.91   0.000     1.821789    2.930172
      Other  |   2.098674    .359512     4.33   0.000     1.500136    2.936024
             |
1.htdiag_o~p |   1.275605   .0882252     3.52   0.000     1.113894    1.460791
1.~y_disease |     2.4501   .2329957     9.42   0.000     2.033469    2.952093
    1.asthma |   1.143792   .0872221     1.76   0.078     .9850017    1.328181
1.~c_disease |   1.480382   .1300735     4.46   0.000     1.246187     1.75859
             |
     diabcat |
T1DM, con..  |   1.777145   .8107873     1.26   0.208     .7267396     4.34577
T1DM, unc..  |   2.902058   .6838849     4.52   0.000     1.828589    4.605705
T2DM, con..  |   1.774613   .1686949     6.03   0.000     1.472952    2.138056
T2DM, unc..  |   2.669211   .2468627    10.62   0.000     2.226688     3.19968
Diabetes,..  |   4.109549   1.882949     3.08   0.002     1.674107      10.088
             |
cancer_exh~t |
  Last year  |   4.610411    .920446     7.66   0.000     3.117464    6.818328
2-5 years..  |   2.615499   .4049836     6.21   0.000     1.930877    3.542864
   5+ years  |   1.835428    .274182     4.07   0.000     1.369564    2.459759
             |
cancer_hae~t |
  Last year  |   8.391238   3.225613     5.53   0.000     3.950227    17.82502
2-5 years..  |   5.427136   1.501708     6.11   0.000     3.155296     9.33472
   5+ years  |   2.473107   .6824102     3.28   0.001     1.440021    4.247339
             |
1.~r_disease |   3.181394   .4438624     8.30   0.000     2.420245    4.181919
1.stroke_d~a |   1.642834   .2100096     3.88   0.000     1.278738    2.110601
1.other_ne~o |   4.348562    .602759    10.60   0.000     3.314054    5.705998
             |
reduced_ki~t |
Stage 3a/..  |   2.683547   .2788059     9.50   0.000     2.189142     3.28961
Stage 4/5..  |   6.940327   1.445143     9.30   0.000     4.614656    10.43808
             |
      1.esrd |   1.775217   .4169649     2.44   0.015     1.120264    2.813083
1.other_tr~t |   .6842081   .4167884    -0.62   0.533     .2073361    2.257883
  1.asplenia |   1.302347   .5957677     0.58   0.564     .5312982    3.192381
1.ra_sle_p~s |   1.193323    .130173     1.62   0.105     .9636187    1.477784
1.other_im~o |    2.03266    .491071     2.94   0.003     1.265968    3.263675
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_plus_eth_12mo_ageband_0MAIN.ster not 
> found)
file ./output/an_sense_covid_death_plus_eth_12mo_ageband_0MAIN.ster saved
   1:   1344.06 /        1 =    1344.0600

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,684,524             Number of obs    =   2,684,524
No. of failures      =        6,507
Time at risk         =    561790738
                                                Wald chi2(47)    =    13825.95
Log pseudolikelihood =   -70707.802             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,091,789 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8584479   .0903327    -1.45   0.147     .6984636    1.055077
 only 12-18  |   .8030178    .103741    -1.70   0.089     .6233893    1.034406
      mixed  |   .9159616   .1404604    -0.57   0.567     .6781842    1.237106
             |
        age1 |   1.057942   .0190637     3.13   0.002     1.021229    1.095973
        age2 |   1.229484   .1006568     2.52   0.012     1.047215    1.443477
        age3 |   .6608833   .1098855    -2.49   0.013     .4770842    .9154921
      1.male |   1.675885   .0453389    19.09   0.000     1.589337    1.767145
             |
   obese4cat |
Obese I ..)  |   1.149924   .0381954     4.21   0.000     1.077447    1.227276
Obese II..)  |   1.533273   .0754631     8.68   0.000     1.392278    1.688546
Obese II..)  |   2.000548   .1420391     9.77   0.000     1.740659     2.29924
             |
smoke_nomiss |
     Former  |   1.280777   .0374279     8.47   0.000     1.209481    1.356276
    Current  |   1.215502    .066156     3.59   0.000     1.092515    1.352334
             |
         imd |
          2  |   1.173598   .0487524     3.85   0.000     1.081832    1.273149
          3  |   1.245121   .0520399     5.25   0.000      1.14719    1.351411
          4  |   1.453797   .0608889     8.93   0.000     1.339224    1.578172
5 most de..  |     1.6355   .0728002    11.05   0.000     1.498862    1.784595
             |
tot_adults~h |
          2  |   .7814025   .0229924    -8.38   0.000      .737613    .8277916
          3  |   1.000643   .0426099     0.02   0.988     .9205194    1.087741
             |
   ethnicity |
      Mixed  |    1.18779   .2079185     0.98   0.326     .8428292    1.673938
Asian or ..  |   1.541772   .0872016     7.65   0.000     1.379993    1.722517
      Black  |   1.168353   .1043851     1.74   0.082     .9806739     1.39195
      Other  |    1.14575   .1483357     1.05   0.293     .8889722    1.476697
             |
1.htdiag_o~p |   .9070885    .028614    -3.09   0.002     .8527045    .9649409
1.~y_disease |   1.706998   .0514508    17.74   0.000     1.609077    1.810878
    1.asthma |   1.030577    .036322     0.85   0.393     .9617902    1.104283
1.~c_disease |   1.335574   .0363618    10.63   0.000     1.266174    1.408777
             |
     diabcat |
T1DM, con..  |   1.962937   .4495955     2.94   0.003     1.252983    3.075158
T1DM, unc..  |   2.571402   .3817942     6.36   0.000     1.922145    3.439964
T2DM, con..  |   1.439321   .0460592    11.38   0.000      1.35182    1.532487
T2DM, unc..  |   1.921416   .0771186    16.27   0.000     1.776058     2.07867
Diabetes,..  |   1.953883    .595306     2.20   0.028     1.075365    3.550106
             |
cancer_exh~t |
  Last year  |   2.271636   .1736082    10.74   0.000     1.955628    2.638708
2-5 years..  |   1.283541   .0750272     4.27   0.000     1.144601    1.439346
   5+ years  |    1.07626   .0417343     1.90   0.058     .9974934    1.161246
             |
cancer_hae~t |
  Last year  |   2.919486    .534711     5.85   0.000     2.038951    4.180287
2-5 years..  |   2.570664   .2861848     8.48   0.000     2.066729    3.197475
   5+ years  |   1.564779    .152125     4.61   0.000     1.293304    1.893238
             |
1.~r_disease |   1.988985   .1743563     7.84   0.000     1.674999     2.36183
1.stroke_d~a |   1.691235   .0545513    16.29   0.000     1.587626    1.801606
1.other_ne~o |   2.456786   .1328924    16.62   0.000     2.209653    2.731559
             |
reduced_ki~t |
Stage 3a/..  |   1.326433   .0390978     9.58   0.000     1.251974     1.40532
Stage 4/5..  |   2.357952   .1225796    16.50   0.000     2.129535     2.61087
             |
      1.esrd |   3.012782   .3000145    11.08   0.000      2.47859    3.662105
1.other_tr~t |   1.542548   .5904995     1.13   0.258     .7284368     3.26652
  1.asplenia |   .9234377   .2253564    -0.33   0.744     .5723738    1.489826
1.ra_sle_p~s |    1.20809   .0510199     4.48   0.000     1.112119    1.312342
1.other_im~o |   1.914492   .3618786     3.44   0.001     1.321779     2.77299
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLY
> ADJMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLYADJMODE
> L_ageband_1MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.01520         1.55        1         0.2126
      2.kids_cat4 |      0.00211         0.03        1         0.8600
      3.kids_cat4 |      0.03247         7.09        1         0.0077
      age1        |     -0.01272         1.11        1         0.2926
      age2        |      0.01447         1.42        1         0.2336
      age3        |     -0.01365         1.26        1         0.2622
      0b.male     |            .            .        1             .
      1.male      |     -0.05474        21.19        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.04087        10.95        1         0.0009
      3.obese4cat |     -0.01804         2.19        1         0.1392
      4.obese4cat |     -0.02153         3.04        1         0.0811
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01249         1.00        1         0.3163
      3.smoke_no~s|      0.01371         1.28        1         0.2580
      1b.imd      |            .            .        1             .
      2.imd       |      0.01419         1.36        1         0.2435
      3.imd       |      0.02977         5.97        1         0.0146
      4.imd       |      0.02803         5.40        1         0.0201
      5.imd       |      0.03588         9.28        1         0.0023
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01633         1.96        1         0.1613
      3.tot_adul~h|      0.03127         7.62        1         0.0058
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00659         0.30        1         0.5826
      3.ethnicity |     -0.00486         0.16        1         0.6929
      4.ethnicity |     -0.00926         0.60        1         0.4377
      5.ethnicity |     -0.03735         9.63        1         0.0019
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.03774         9.81        1         0.0017
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00384         0.10        1         0.7516
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01698         1.91        1         0.1665
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.01042         0.79        1         0.3752
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01771         2.22        1         0.1365
      3.diabcat   |      0.00390         0.11        1         0.7449
      4.diabcat   |     -0.01759         2.09        1         0.1482
      5.diabcat   |     -0.01462         1.46        1         0.2269
      6.diabcat   |     -0.00183         0.02        1         0.8802
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00688         0.33        1         0.5681
      3.cancer_e~t|      0.01011         0.68        1         0.4081
      4.cancer_e~t|      0.00535         0.19        1         0.6598
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01085         0.81        1         0.3675
      3.cancer_h~t|     -0.00936         0.60        1         0.4397
      4.cancer_h~t|      0.00799         0.43        1         0.5124
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01242         1.06        1         0.3025
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.02628         5.08        1         0.0242
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01985         2.87        1         0.0901
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.03872        11.33        1         0.0008
      3.reduced_~t|     -0.01592         1.98        1         0.1598
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01075         0.76        1         0.3819
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00118         0.01        1         0.9216
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.03286         7.22        1         0.0072
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00591         0.23        1         0.6298
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01548         1.66        1         0.1971
      ------------+---------------------------------------------------
      global test |                    139.57       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   2380.47 /        1 =    2380.4730
   1:     86.35 /        1 =      86.3490

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       44,420             Number of obs    =      44,420
No. of failures      =          101
Time at risk         =      9275816
                                                Wald chi2(40)    =      344.98
Log pseudolikelihood =   -701.63529             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,511 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .8999471   .2089486    -0.45   0.650     .5709342    1.418561
3 childre..  |   1.263252   .3978501     0.74   0.458      .681415    2.341901
4+ childr..  |   1.100726   .6736779     0.16   0.875     .3316791    3.652923
             |
        age1 |    1.01816   .1089387     0.17   0.866     .8255458    1.255715
        age2 |   1.270587   .6909777     0.44   0.660     .4376218    3.689008
        age3 |    .636684   .7210573    -0.40   0.690     .0691705    5.860392
      1.male |   1.234093   .2747258     0.94   0.345     .7977356    1.909136
             |
   obese4cat |
Obese I ..)  |   1.203323   .3020305     0.74   0.461     .7357546    1.968028
Obese II..)  |   .8568201   .4187353    -0.32   0.752      .328776     2.23295
Obese II..)  |   3.277405    1.46574     2.65   0.008     1.364115    7.874251
             |
smoke_nomiss |
     Former  |   1.542831   .3599281     1.86   0.063     .9766545    2.437226
    Current  |   1.507701   .6020598     1.03   0.304     .6893038    3.297764
             |
         imd |
          2  |    .324068   .1800068    -2.03   0.042     .1091008    .9625968
          3  |   .6339094   .2689607    -1.07   0.283     .2759764    1.456071
          4  |   1.123268    .419528     0.31   0.756      .540218    2.335595
5 most de..  |   1.451996   .5539306     0.98   0.328     .6874408     3.06687
             |
tot_adults~h |
          2  |   4.294746   4.501291     1.39   0.164     .5505534    33.50236
          3  |   2.828186   2.927782     1.00   0.315     .3718185    21.51221
             |
   ethnicity |
      Mixed  |   .9391045   .9591453    -0.06   0.951     .1268667    6.951529
Asian or ..  |   1.913371   .5161833     2.41   0.016     1.127625    3.246637
      Black  |   .6372499   .3809015    -0.75   0.451     .1974803    2.056345
      Other  |   3.500812   1.425862     3.08   0.002     1.575719    7.777833
             |
1.htdiag_o~p |   .7452506   .1860295    -1.18   0.239     .4569044    1.215568
1.~y_disease |   1.060647   .3052077     0.20   0.838     .6034376    1.864272
    1.asthma |   .8481333    .234646    -0.60   0.552     .4931389    1.458676
1.~c_disease |   1.495314   .3399752     1.77   0.077      .957641    2.334866
             |
     diabcat |
T1DM, con..  |   4.53e-19          .        .       .            .           .
T1DM, unc..  |   3.977898   4.239881     1.30   0.195     .4924841    32.13032
T2DM, con..  |   2.224189   .5761324     3.09   0.002     1.338704    3.695376
T2DM, unc..  |   3.006521   .8640057     3.83   0.000     1.711781    5.280562
Diabetes,..  |   3.02e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   .8726224   .8915069    -0.13   0.894     .1178159    6.463219
2-5 years..  |    1.77148   .8770076     1.16   0.248     .6713225    4.674564
   5+ years  |   1.236453   .4942295     0.53   0.595     .5648577     2.70655
             |
cancer_hae~t |
  Last year  |   12.64411   13.31169     2.41   0.016        1.606    99.54775
2-5 years..  |   2.47e-19          .        .       .            .           .
   5+ years  |   8.13e-20          .        .       .            .           .
             |
1.~r_disease |    2.05516   1.244732     1.19   0.234     .6270542    6.735751
1.stroke_d~a |   2.400318   .6444924     3.26   0.001     1.418139    4.062738
1.other_ne~o |    3.16396    1.20691     3.02   0.003     1.498081    6.682309
             |
reduced_ki~t |
Stage 3a/..  |   1.357768   .3535601     1.17   0.240     .8150311    2.261917
Stage 4/5..  |   2.425454   1.050527     2.05   0.041     1.037804    5.668532
             |
      1.esrd |   2.656783   1.605235     1.62   0.106     .8129392    8.682689
1.other_tr~t |   2.45e-19          .        .       .            .           .
  1.asplenia |   3.57e-19          .        .       .            .           .
1.ra_sle_p~s |   .6877184   .3206245    -0.80   0.422     .2757833    1.714957
1.other_im~o |   3.44e-19          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAIN
> FULLYADJMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYAD
> JMODEL_ageband_1MAIN.ster saved
(72,537 observations deleted)
   1:   1335.02 /        1 =    1335.0210

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,611,987             Number of obs    =   2,611,987
No. of failures      =        6,220
Time at risk         =    546716867
                                                Wald chi2(47)    =    13265.48
Log pseudolikelihood =   -67442.571             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,035,758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9113037   .0973518    -0.87   0.385     .7391488    1.123555
 only 12-18  |   .7897426   .1070334    -1.74   0.082     .6055118    1.030027
      mixed  |   .9074291   .1453761    -0.61   0.544     .6628948    1.242169
             |
        age1 |   1.057481   .0194691     3.04   0.002     1.020002    1.096337
        age2 |   1.219302   .1019705     2.37   0.018     1.034964    1.436473
        age3 |   .6753061      .1147    -2.31   0.021     .4840888    .9420552
      1.male |    1.66804   .0460247    18.54   0.000     1.580229     1.76073
             |
   obese4cat |
Obese I ..)  |   1.150721   .0390312     4.14   0.000     1.076709    1.229821
Obese II..)  |   1.536873   .0771715     8.56   0.000     1.392824    1.695819
Obese II..)  |   2.006275   .1451261     9.63   0.000     1.741076    2.311868
             |
smoke_nomiss |
     Former  |   1.296549   .0387427     8.69   0.000     1.222796    1.374751
    Current  |   1.206482   .0676667     3.35   0.001     1.080888    1.346671
             |
         imd |
          2  |   1.185874   .0502802     4.02   0.000     1.091311    1.288632
          3  |   1.230694   .0527564     4.84   0.000     1.131518    1.338562
          4  |   1.456958   .0623343     8.80   0.000     1.339767      1.5844
5 most de..  |    1.62464   .0738166    10.68   0.000     1.486217    1.775955
             |
tot_adults~h |
          2  |   .7890183   .0236486    -7.91   0.000     .7440031    .8367571
          3  |   .9769571   .0425677    -0.54   0.593     .8969892    1.064054
             |
   ethnicity |
      Mixed  |   1.267656   .2219847     1.35   0.176     .8993811     1.78673
Asian or ..  |    1.55767   .0903258     7.64   0.000     1.390325    1.745158
      Black  |   1.154412    .106159     1.56   0.118     .9640175     1.38241
      Other  |   1.156012    .153488     1.09   0.275     .8911379    1.499614
             |
1.htdiag_o~p |   .9144338   .0295587    -2.77   0.006     .8582968    .9742424
1.~y_disease |   1.723753   .0530175    17.70   0.000     1.622911    1.830861
    1.asthma |   1.028755   .0370734     0.79   0.431     .9585991    1.104045
1.~c_disease |   1.342814   .0373615    10.59   0.000     1.271548    1.418075
             |
     diabcat |
T1DM, con..  |   2.044827   .4682774     3.12   0.002     1.305349     3.20322
T1DM, unc..  |   2.394981   .3752501     5.57   0.000     1.761709    3.255891
T2DM, con..  |   1.447877   .0472306    11.35   0.000     1.358204     1.54347
T2DM, unc..  |   1.923729   .0789963    15.93   0.000     1.774965     2.08496
Diabetes,..  |   2.176543   .6640075     2.55   0.011     1.196981    3.957738
             |
cancer_exh~t |
  Last year  |   2.241202   .1765867    10.24   0.000     1.920498    2.615459
2-5 years..  |   1.307651   .0773445     4.53   0.000     1.164516     1.46838
   5+ years  |   1.063563   .0423314     1.55   0.122     .9837491    1.149853
             |
cancer_hae~t |
  Last year  |   2.881248   .5453825     5.59   0.000     1.988197    4.175437
2-5 years..  |   2.671545   .2975938     8.82   0.000     2.147552    3.323388
   5+ years  |   1.595189     .15724     4.74   0.000     1.314946    1.935157
             |
1.~r_disease |   1.882492   .1729448     6.89   0.000     1.572292    2.253892
1.stroke_d~a |   1.676381   .0554875    15.61   0.000      1.57108     1.78874
1.other_ne~o |   2.422972   .1355474    15.82   0.000      2.17135    2.703752
             |
reduced_ki~t |
Stage 3a/..  |   1.331774   .0401546     9.50   0.000     1.255353    1.412847
Stage 4/5..  |   2.400099   .1271068    16.53   0.000     2.163468    2.662612
             |
      1.esrd |    3.06687   .3094786    11.11   0.000      2.51652    3.737578
1.other_tr~t |   1.417941   .5834079     0.85   0.396      .633044    3.176016
  1.asplenia |   .8582659    .222786    -0.59   0.556     .5160235    1.427494
1.ra_sle_p~s |   1.204453   .0520896     4.30   0.000     1.106567    1.310999
1.other_im~o |   1.927453   .3709086     3.41   0.001     1.321853    2.810505
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_plus_eth_12mo_ageband_1MAIN.ster not 
> found)
file ./output/an_sense_covid_death_plus_eth_12mo_ageband_1MAIN.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_deathMAIN.log
  log type:  text
 closed on:  24 Jan 2021, 15:32:12
-------------------------------------------------------------------------------
