-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_icuMAIN.log
  log type:  text
 opened on:  24 Jan 2021, 10:44:23

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   4237.98 /        1 =    4237.9850

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,334,392             Number of obs    =   9,334,392
No. of failures      =        1,601
Time at risk         =   1963608110
                                                Wald chi2(47)    =     4917.07
Log pseudolikelihood =   -18973.066             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,833,113 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9051911   .0783817    -1.15   0.250     .7638949    1.072623
 only 12-18  |   1.047787   .0917868     0.53   0.594     .8824851    1.244053
      mixed  |   .9985669   .1067574    -0.01   0.989     .8097942    1.231345
             |
        age1 |   1.091864   .0224268     4.28   0.000     1.048781    1.136716
        age2 |   .9895318    .048217    -0.22   0.829     .8994006    1.088695
        age3 |   .9409293   .1166093    -0.49   0.623     .7380192    1.199627
      1.male |   2.266269   .1250525    14.83   0.000      2.03396    2.525113
             |
   obese4cat |
Obese I ..)  |   1.806122   .1158678     9.22   0.000     1.592722    2.048113
Obese II..)  |   2.496729   .2006775    11.38   0.000     2.132824    2.922723
Obese II..)  |   3.538674   .3341767    13.38   0.000     2.940742    4.258183
             |
smoke_nomiss |
     Former  |   1.010007   .0557927     0.18   0.857     .9063666    1.125497
    Current  |   .3007182   .0312656   -11.56   0.000     .2452791     .368688
             |
         imd |
          2  |   1.195404   .1136439     1.88   0.060     .9921861    1.440244
          3  |   1.301951   .1205176     2.85   0.004     1.085929    1.560945
          4  |   1.469181   .1326537     4.26   0.000      1.23089    1.753602
5 most de..  |   1.626677   .1530449     5.17   0.000     1.352747    1.956078
             |
tot_adults~h |
          2  |   .9604427   .0673978    -0.58   0.565     .8370272    1.102055
          3  |   1.196589   .0827131     2.60   0.009     1.044976    1.370198
             |
   ethnicity |
      Mixed  |   3.110578   .4812319     7.34   0.000     2.296959    4.212394
Asian or ..  |    3.13964   .2547169    14.10   0.000     2.678073    3.680758
      Black  |   3.178127   .3136844    11.72   0.000     2.619128    3.856432
      Other  |    3.32133   .4138176     9.63   0.000     2.601701    4.240007
             |
1.htdiag_o~p |   1.442979   .0854898     6.19   0.000     1.284784    1.620652
1.~y_disease |   2.562898   .2485805     9.70   0.000     2.119198    3.099495
    1.asthma |   1.241847    .079814     3.37   0.001     1.094867     1.40856
1.~c_disease |   1.139502   .1007206     1.48   0.140     .9582463    1.355042
             |
     diabcat |
T1DM, con..  |   2.292102   .8868191     2.14   0.032     1.073748    4.892892
T1DM, unc..  |    3.02278   .6459733     5.18   0.000     1.988398    4.595257
T2DM, con..  |   1.667308   .1427468     5.97   0.000     1.409744     1.97193
T2DM, unc..  |    2.62693   .2171583    11.68   0.000     2.233999    3.088973
Diabetes,..  |   4.307637   1.635536     3.85   0.000     2.046691     9.06621
             |
cancer_exh~t |
  Last year  |   1.010296   .3842357     0.03   0.979     .4794243    2.129009
2-5 years..  |   .9316381   .2169011    -0.30   0.761     .5903004    1.470352
   5+ years  |   .6727381   .1492321    -1.79   0.074     .4355378    1.039121
             |
cancer_hae~t |
  Last year  |   4.277148   2.173914     2.86   0.004     1.579503    11.58212
2-5 years..  |   3.443077   1.159363     3.67   0.000     1.779622    6.661405
   5+ years  |   2.441078   .6502281     3.35   0.001     1.448264    4.114486
             |
1.~r_disease |   1.135252   .2334541     0.62   0.537     .7586656    1.698768
1.stroke_d~a |   1.526328   .2091324     3.09   0.002     1.166861    1.996533
1.other_ne~o |   1.181091   .2704335     0.73   0.467     .7540222    1.850045
             |
reduced_ki~t |
Stage 3a/..  |   1.590335   .1890141     3.90   0.000     1.259858    2.007499
Stage 4/5..  |   1.832758   .4876782     2.28   0.023      1.08795    3.087459
             |
      1.esrd |   4.502555   1.070773     6.33   0.000     2.825081    7.176078
1.other_tr~t |   .8934898     .54337    -0.19   0.853     .2712919    2.942675
  1.asplenia |   2.868277   .9338907     3.24   0.001     1.515221    5.429581
1.ra_sle_p~s |   1.300965   .1247004     2.74   0.006     1.078142    1.569839
1.other_im~o |   1.613036   .3899868     1.98   0.048     1.004263     2.59084
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYAD
> JMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYADJMODEL_
> ageband_0MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.02091         0.80        1         0.3717
      2.kids_cat4 |     -0.02812         1.40        1         0.2372
      3.kids_cat4 |     -0.00554         0.05        1         0.8192
      age1        |     -0.03403         1.88        1         0.1706
      age2        |      0.01132         0.22        1         0.6422
      age3        |     -0.00490         0.04        1         0.8407
      0b.male     |            .            .        1             .
      1.male      |     -0.13905        36.26        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.08756        14.93        1         0.0001
      3.obese4cat |     -0.03718         2.73        1         0.0986
      4.obese4cat |     -0.04739         4.92        1         0.0266
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.02704         1.31        1         0.2516
      3.smoke_no~s|      0.11812        26.36        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.00898         0.14        1         0.7071
      3.imd       |      0.01766         0.53        1         0.4669
      4.imd       |      0.09020        14.21        1         0.0002
      5.imd       |      0.10871        21.69        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.05404         5.06        1         0.0244
      3.tot_adul~h|     -0.00086         0.00        1         0.9714
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.01442         0.37        1         0.5416
      3.ethnicity |      0.04769         4.99        1         0.0255
      4.ethnicity |     -0.06954         9.19        1         0.0024
      5.ethnicity |     -0.04257         3.23        1         0.0722
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.06021         7.51        1         0.0061
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.04162         3.95        1         0.0469
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00652         0.08        1         0.7758
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.02158         0.99        1         0.3194
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.03286         1.98        1         0.1596
      3.diabcat   |      0.06581         7.36        1         0.0067
      4.diabcat   |      0.00314         0.02        1         0.8888
      5.diabcat   |      0.00517         0.06        1         0.8025
      6.diabcat   |      0.01136         0.22        1         0.6396
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.02170         0.82        1         0.3663
      3.cancer_e~t|     -0.00223         0.01        1         0.9244
      4.cancer_e~t|     -0.02113         0.79        1         0.3747
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02511         1.13        1         0.2884
      3.cancer_h~t|     -0.01214         0.26        1         0.6129
      4.cancer_h~t|     -0.00617         0.07        1         0.7884
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.11910        26.35        1         0.0000
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.03205         2.06        1         0.1510
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01161         0.24        1         0.6222
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.02804         1.60        1         0.2061
      3.reduced_~t|      0.07275        16.41        1         0.0001
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.04576         6.48        1         0.0109
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.05469         6.48        1         0.0109
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00720         0.10        1         0.7464
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.04453         3.56        1         0.0591
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.05899         6.49        1         0.0109
      ------------+---------------------------------------------------
      global test |                    222.04       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   6376.44 /        1 =    6376.4400
   1:   1765.65 /        1 =    1765.6510

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,918,698             Number of obs    =   1,918,698
No. of failures      =          193
Time at risk         =    404362178
                                                Wald chi2(42)    =     1173.46
Log pseudolikelihood =   -1935.3573             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,098,510 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9666597   .1524289    -0.22   0.830     .7096609    1.316729
3 childre..  |   .9967747   .2535236    -0.01   0.990     .6054789    1.640949
4+ childr..  |   1.489651   .5754339     1.03   0.302     .6986756    3.176093
             |
        age1 |   1.024993   .0388405     0.65   0.515     .9516256    1.104018
        age2 |   1.093861   .1068117     0.92   0.358     .9033273    1.324582
        age3 |   .7937412   .2101645    -0.87   0.383     .4723895    1.333698
      1.male |   2.699606   .4388434     6.11   0.000     1.963046    3.712533
             |
   obese4cat |
Obese I ..)  |   1.674781   .3179106     2.72   0.007     1.154466    2.429601
Obese II..)  |   2.652291   .6263266     4.13   0.000     1.669605     4.21336
Obese II..)  |   4.303073   1.132812     5.54   0.000     2.568588    7.208801
             |
smoke_nomiss |
     Former  |   .7720083   .1354087    -1.48   0.140     .5474229    1.088732
    Current  |   .3451002   .0952211    -3.86   0.000     .2009459    .5926677
             |
         imd |
          2  |    1.18465   .3541095     0.57   0.571     .6594066    2.128271
          3  |   1.499767    .410772     1.48   0.139     .8767743    2.565428
          4  |   1.801997   .4819471     2.20   0.028     1.066839    3.043753
5 most de..  |   1.539016   .4343874     1.53   0.127     .8850985    2.676054
             |
tot_adults~h |
          2  |   .8118313   .2247464    -0.75   0.451     .4718676    1.396727
          3  |   .9875215   .2870426    -0.04   0.966     .5586349    1.745682
             |
   ethnicity |
      Mixed  |      3.784   1.444284     3.49   0.000     1.790865    7.995385
Asian or ..  |   2.942935   .6410708     4.96   0.000     1.920261    4.510256
      Black  |   3.743916   .9416079     5.25   0.000     2.286894    6.129235
      Other  |   3.072737     1.0908     3.16   0.002     1.532339    6.161633
             |
1.htdiag_o~p |   1.684127    .287433     3.05   0.002      1.20531    2.353157
1.~y_disease |   4.439265   1.325913     4.99   0.000     2.472154    7.971622
    1.asthma |   1.234053   .2358413     1.10   0.271     .8485153    1.794766
1.~c_disease |   .9261314   .2953006    -0.24   0.810     .4957511    1.730141
             |
     diabcat |
T1DM, con..  |   1.92e-19          .        .       .            .           .
T1DM, unc..  |   3.019429   2.220415     1.50   0.133     .7144498     12.7608
T2DM, con..  |   1.544713   .4334244     1.55   0.121     .8912775    2.677212
T2DM, unc..  |   3.372032   .8604861     4.76   0.000     2.044934    5.560375
Diabetes,..  |    8.91731   5.938639     3.29   0.001     2.417471    32.89323
             |
cancer_exh~t |
  Last year  |   2.137502   2.163077     0.75   0.453     .2941172    15.53434
2-5 years..  |   1.298481   .9389741     0.36   0.718     .3147054    5.357563
   5+ years  |   4.28e-20          .        .       .            .           .
             |
cancer_hae~t |
  Last year  |   5.70e-19          .        .       .            .           .
2-5 years..  |    11.6574   7.018934     4.08   0.000     3.581723    37.94121
   5+ years  |   2.192554   2.173226     0.79   0.428     .3142336    15.29847
             |
1.~r_disease |   1.878833   .9784844     1.21   0.226     .6769989    5.214211
1.stroke_d~a |   1.828515    .809317     1.36   0.173     .7679784    4.353593
1.other_ne~o |   2.490604   1.567996     1.45   0.147     .7251341    8.554426
             |
reduced_ki~t |
Stage 3a/..  |   1.344944   .5888428     0.68   0.498     .5702053    3.172319
Stage 4/5..  |   1.250218   1.599257     0.17   0.861     .1018929    15.34008
             |
      1.esrd |   3.629775   3.706875     1.26   0.207     .4904533    26.86344
1.other_tr~t |   5.92e-19          .        .       .            .           .
  1.asplenia |   1.90e-19          .        .       .            .           .
1.ra_sle_p~s |   1.118951   .3667757     0.34   0.732     .5885723    2.127269
1.other_im~o |   1.409848   1.055285     0.46   0.646     .3251171    6.113711
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFU
> LLYADJMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFULLYADJM
> ODEL_ageband_0MAIN.ster saved
(748,903 observations deleted)
   1:   3844.86 /        1 =    3844.8650

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,585,489             Number of obs    =   8,585,489
No. of failures      =        1,497
Time at risk         =   1806991594
                                                Wald chi2(47)    =     4651.00
Log pseudolikelihood =   -17628.126             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,442,130 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9493526   .0844601    -0.58   0.559     .7974428    1.130201
 only 12-18  |   1.076639   .0962385     0.83   0.409     .9036144    1.282795
      mixed  |   1.030718   .1135646     0.27   0.784     .8305284    1.279162
             |
        age1 |   1.087108   .0241064     3.77   0.000     1.040873    1.135398
        age2 |   1.003586   .0523734     0.07   0.945     .9060109    1.111669
        age3 |   .9093173   .1201747    -0.72   0.472     .7018128    1.178174
      1.male |   2.321046   .1328134    14.72   0.000     2.074803    2.596514
             |
   obese4cat |
Obese I ..)  |   1.825945   .1208135     9.10   0.000     1.603866    2.078775
Obese II..)  |    2.50095   .2073757    11.06   0.000      2.12581    2.942291
Obese II..)  |   3.608266   .3500779    13.23   0.000     2.983418    4.363983
             |
smoke_nomiss |
     Former  |   1.001061   .0569126     0.02   0.985     .8955045     1.11906
    Current  |   .2978659   .0321555   -11.22   0.000     .2410633    .3680532
             |
         imd |
          2  |   1.204097   .1184317     1.89   0.059     .9929781    1.460103
          3  |    1.31787   .1260801     2.89   0.004     1.092543    1.589669
          4  |   1.508894   .1404475     4.42   0.000     1.257272    1.810875
5 most de..  |    1.64149   .1592411     5.11   0.000      1.35726    1.985242
             |
tot_adults~h |
          2  |   .9735327   .0714576    -0.37   0.715     .8430864    1.124162
          3  |   1.240982   .0896092     2.99   0.003     1.077213    1.429649
             |
   ethnicity |
      Mixed  |   3.263549   .5181616     7.45   0.000     2.390798    4.454895
Asian or ..  |   3.116821   .2613703    13.56   0.000     2.644428      3.6736
      Black  |   3.257951   .3333863    11.54   0.000     2.665883    3.981512
      Other  |   3.190324   .4258843     8.69   0.000     2.455872     4.14442
             |
1.htdiag_o~p |   1.452393   .0888273     6.10   0.000     1.288324    1.637355
1.~y_disease |   2.581214   .2567505     9.53   0.000     2.124007    3.136838
    1.asthma |   1.240738   .0820233     3.26   0.001     1.089955    1.412381
1.~c_disease |   1.118471   .1021802     1.23   0.220     .9351075     1.33779
             |
     diabcat |
T1DM, con..  |   2.086202   .8690048     1.77   0.078     .9221245    4.719797
T1DM, unc..  |   2.915859   .6532679     4.78   0.000     1.879593    4.523446
T2DM, con..  |   1.618743   .1432802     5.44   0.000     1.360928    1.925397
T2DM, unc..  |   2.564009   .2181851    11.06   0.000     2.170133    3.029374
Diabetes,..  |   4.249903   1.739892     3.53   0.000     1.905025    9.481068
             |
cancer_exh~t |
  Last year  |   .7746261   .3480554    -0.57   0.570     .3210922    1.868764
2-5 years..  |   .9789621   .2281447    -0.09   0.927     .6200054    1.545739
   5+ years  |   .6383065   .1488894    -1.92   0.054     .4040923    1.008272
             |
cancer_hae~t |
  Last year  |   4.618151   2.354407     3.00   0.003     1.700247    12.54366
2-5 years..  |    3.64196   1.227183     3.84   0.000     1.881556    7.049417
   5+ years  |   2.575039      .6878     3.54   0.000     1.525547    4.346524
             |
1.~r_disease |   1.135435   .2430173     0.59   0.553     .7464133     1.72721
1.stroke_d~a |   1.486944   .2126785     2.77   0.006     1.123432    1.968079
1.other_ne~o |   1.262071   .2893272     1.02   0.310     .8052808    1.977971
             |
reduced_ki~t |
Stage 3a/..  |   1.573977   .1937605     3.68   0.000     1.236555    2.003472
Stage 4/5..  |   1.891102   .5214331     2.31   0.021     1.101573    3.246508
             |
      1.esrd |   4.589653   1.122096     6.23   0.000     2.842332    7.411136
1.other_tr~t |   .6531003   .4764877    -0.58   0.559      .156301    2.728964
  1.asplenia |   3.020207   .9865152     3.38   0.001     1.592215    5.728906
1.ra_sle_p~s |   1.258947   .1259197     2.30   0.021     1.034833    1.531597
1.other_im~o |   1.433146   .3785373     1.36   0.173     .8540086    2.405019
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_0MAIN.ster not fo
> und)
file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_0MAIN.ster saved
   1:    855.33 /        1 =     855.3290

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,684,524             Number of obs    =   2,684,524
No. of failures      =          732
Time at risk         =    561746760
                                                Wald chi2(47)    =      656.43
Log pseudolikelihood =    -8148.683             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,091,789 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.091587   .2366308     0.40   0.686     .7137357    1.669472
 only 12-18  |   1.264654   .3336918     0.89   0.374      .754004    2.121143
      mixed  |   .8650044   .3347304    -0.37   0.708     .4051625    1.846747
             |
        age1 |   .9444686   .0305254    -1.77   0.077     .8864956    1.006233
        age2 |    1.26118   .2498589     1.17   0.241     .8553449    1.859572
        age3 |   .4227717   .1971757    -1.85   0.065     .1694789     1.05462
      1.male |   2.667806     .22377    11.70   0.000     2.263379    3.144497
             |
   obese4cat |
Obese I ..)  |   1.448454   .1302082     4.12   0.000     1.214468     1.72752
Obese II..)  |   1.879817   .2346693     5.06   0.000      1.47182    2.400912
Obese II..)  |   1.369473   .2981596     1.44   0.149     .8937813     2.09834
             |
smoke_nomiss |
     Former  |    1.37639   .1184656     3.71   0.000      1.16273    1.629312
    Current  |    .510552   .0993277    -3.46   0.001     .3486897    .7475512
             |
         imd |
          2  |   1.035999   .1234819     0.30   0.767     .8201699    1.308625
          3  |   1.173227   .1387535     1.35   0.177     .9304934    1.479281
          4  |   1.255627   .1547266     1.85   0.065     .9862113    1.598642
5 most de..  |   1.162898   .1568603     1.12   0.263     .8927401    1.514809
             |
tot_adults~h |
          2  |    1.15046   .1066856     1.51   0.131     .9592612    1.379767
          3  |    1.11669   .1337205     0.92   0.357     .8830876    1.412088
             |
   ethnicity |
      Mixed  |    2.66089   .9729136     2.68   0.007     1.299566    5.448234
Asian or ..  |   2.447834   .3613509     6.06   0.000      1.83285    3.269165
      Black  |   3.214056   .6546473     5.73   0.000     2.156148    4.791025
      Other  |   2.981285   .7182026     4.53   0.000     1.859285    4.780365
             |
1.htdiag_o~p |   1.132523    .098758     1.43   0.154      .954599    1.343611
1.~y_disease |   1.550774   .1601271     4.25   0.000      1.26665     1.89863
    1.asthma |   1.109549   .1138355     1.01   0.311     .9074365    1.356677
1.~c_disease |   .9106765   .0848283    -1.00   0.315       .75871    1.093081
             |
     diabcat |
T1DM, con..  |   1.449397   1.040332     0.52   0.605     .3549948    5.917701
T1DM, unc..  |   1.268125   .7407128     0.41   0.684     .4036218    3.984277
T2DM, con..  |   1.144677   .1230344     1.26   0.209     .9272408    1.413102
T2DM, unc..  |   1.634453   .1978002     4.06   0.000      1.28932    2.071974
Diabetes,..  |   1.316949   1.319435     0.27   0.783     .1848249    9.383768
             |
cancer_exh~t |
  Last year  |   .7365803   .2808005    -0.80   0.423     .3489181    1.554951
2-5 years..  |   .6891531   .1571676    -1.63   0.103     .4407492    1.077556
   5+ years  |   1.031774   .1408585     0.23   0.819     .7895472    1.348315
             |
cancer_hae~t |
  Last year  |   5.832613    2.40683     4.27   0.000     2.597853    13.09519
2-5 years..  |   4.836207   1.266299     6.02   0.000     2.894867    8.079437
   5+ years  |   1.258891   .4511637     0.64   0.521     .6236381    2.541226
             |
1.~r_disease |   .7997539    .279232    -0.64   0.522     .4034238    1.585445
1.stroke_d~a |   1.231456   .1703311     1.51   0.132     .9390384    1.614933
1.other_ne~o |   .8631302   .2435569    -0.52   0.602     .4964614    1.500608
             |
reduced_ki~t |
Stage 3a/..  |   1.337768   .1312387     2.97   0.003     1.103762    1.621384
Stage 4/5..  |   1.176075   .3362547     0.57   0.571     .6715308    2.059702
             |
      1.esrd |   3.907205   1.304448     4.08   0.000     2.030891    7.517022
1.other_tr~t |   1.488755   1.530972     0.39   0.699     .1983737    11.17281
  1.asplenia |   1.457026   .8497862     0.65   0.519     .4645344    4.570003
1.ra_sle_p~s |   1.185718   .1518959     1.33   0.184     .9224405    1.524137
1.other_im~o |   .8486119   .6009073    -0.23   0.817     .2118206    3.399775
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYAD
> JMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYADJMODEL_
> ageband_1MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.04893         2.15        1         0.1426
      2.kids_cat4 |     -0.00127         0.00        1         0.9696
      3.kids_cat4 |      0.10809         9.86        1         0.0017
      age1        |     -0.03879         1.29        1         0.2556
      age2        |      0.03476         1.06        1         0.3029
      age3        |     -0.03960         1.40        1         0.2364
      0b.male     |            .            .        1             .
      1.male      |     -0.09430         7.38        1         0.0066
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02709         0.65        1         0.4207
      3.obese4cat |     -0.05576         2.62        1         0.1056
      4.obese4cat |     -0.03333         1.09        1         0.2974
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02551         0.55        1         0.4578
      3.smoke_no~s|      0.05734         3.06        1         0.0801
      1b.imd      |            .            .        1             .
      2.imd       |      0.02951         0.73        1         0.3926
      3.imd       |      0.02691         0.64        1         0.4253
      4.imd       |      0.05280         2.51        1         0.1131
      5.imd       |      0.06403         3.64        1         0.0564
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00448         0.02        1         0.8910
      3.tot_adul~h|     -0.04088         1.65        1         0.1994
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.08409         6.74        1         0.0094
      3.ethnicity |      0.15370        21.00        1         0.0000
      4.ethnicity |      0.00458         0.02        1         0.8857
      5.ethnicity |     -0.02046         0.35        1         0.5523
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.09291         7.22        1         0.0072
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.02186         0.45        1         0.5005
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.05024         2.12        1         0.1458
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.13211        16.08        1         0.0001
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.06765         3.88        1         0.0488
      3.diabcat   |     -0.02898         0.69        1         0.4074
      4.diabcat   |      0.02838         0.84        1         0.3599
      5.diabcat   |      0.10214         9.36        1         0.0022
      6.diabcat   |     -0.03764         1.54        1         0.2140
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.04128         1.37        1         0.2415
      3.cancer_e~t|     -0.04135         1.45        1         0.2280
      4.cancer_e~t|      0.00283         0.01        1         0.9282
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.01642         0.22        1         0.6407
      3.cancer_h~t|     -0.01554         0.20        1         0.6525
      4.cancer_h~t|      0.02400         0.51        1         0.4760
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.02876         0.98        1         0.3226
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.05409         2.78        1         0.0953
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01774         0.28        1         0.5976
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.02512         0.57        1         0.4485
      3.reduced_~t|     -0.02651         0.64        1         0.4221
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.00013         0.00        1         0.9968
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00467         0.02        1         0.8761
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.01271         0.15        1         0.7030
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01007         0.09        1         0.7606
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00053         0.00        1         0.9872
      ------------+---------------------------------------------------
      global test |                    121.65       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   1255.54 /        1 =    1255.5350
   1:     67.56 /        1 =      67.5580

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       44,420             Number of obs    =      44,420
No. of failures      =           25
Time at risk         =      9274732
                                                Wald chi2(42)    =    37813.34
Log pseudolikelihood =   -166.88957             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,511 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.465614   .6202868     0.90   0.366     .6393941     3.35947
3 childre..  |   .8982893   .7167355    -0.13   0.893     .1880406    4.291221
4+ childr..  |   2.313145    2.55274     0.76   0.447     .2659711    20.11738
             |
        age1 |   1.120348   .1915598     0.66   0.506     .8013317    1.566367
        age2 |   .2367094   .2299473    -1.48   0.138     .0352639    1.588915
        age3 |   25.81674   54.55319     1.54   0.124     .4104237    1623.941
      1.male |   2.030731   1.075454     1.34   0.181     .7192255    5.733763
             |
   obese4cat |
Obese I ..)  |   1.432162   .6572747     0.78   0.434     .5825628    3.520802
Obese II..)  |   1.262218   1.013878     0.29   0.772     .2614603    6.093449
Obese II..)  |   5.02e-18   1.93e-18  -103.87   0.000     2.37e-18    1.06e-17
             |
smoke_nomiss |
     Former  |   1.223054   .5826318     0.42   0.673     .4807895    3.111261
    Current  |   .2779279   .2966414    -1.20   0.230     .0343097    2.251371
             |
         imd |
          2  |   .4544391   .4068298    -0.88   0.378      .078605    2.627248
          3  |   1.126633   .8167885     0.16   0.869     .2720676    4.665392
          4  |    .931273   .6465101    -0.10   0.918     .2388659    3.630779
5 most de..  |   1.072095   .7982948     0.09   0.926     .2491256    4.613688
             |
tot_adults~h |
          2  |   .4150322    .487841    -0.75   0.454     .0414529    4.155363
          3  |   .5544147   .5838581    -0.56   0.575     .0703766    4.367583
             |
   ethnicity |
      Mixed  |   1.57e-17   5.79e-18  -105.31   0.000     7.66e-18    3.24e-17
Asian or ..  |   1.940938   .9085104     1.42   0.157     .7755019    4.857808
      Black  |   1.37e-17   6.30e-18   -84.49   0.000     5.57e-18    3.38e-17
      Other  |   1.68e-17   7.12e-18   -91.29   0.000     7.34e-18    3.86e-17
             |
1.htdiag_o~p |    .940374    .462939    -0.12   0.901     .3583113    2.467975
1.~y_disease |   1.863667    .940426     1.23   0.217     .6931752    5.010645
    1.asthma |   1.655475    .650022     1.28   0.199     .7668285    3.573936
1.~c_disease |   2.756877   1.196103     2.34   0.019     1.177914    6.452397
             |
     diabcat |
T1DM, con..  |   4.53e-18          .        .       .            .           .
T1DM, unc..  |   4.96e-18   3.15e-18   -62.65   0.000     1.43e-18    1.72e-17
T2DM, con..  |   .9202342    .487225    -0.16   0.875     .3260042    2.597607
T2DM, unc..  |   1.511171   .6713633     0.93   0.353     .6326343    3.609726
Diabetes,..  |   3.53e-18   1.81e-18   -78.32   0.000     1.29e-18    9.66e-18
             |
cancer_exh~t |
  Last year  |   1.24e-17   5.34e-18   -90.23   0.000     5.31e-18    2.88e-17
2-5 years..  |   2.01e-17   1.39e-17   -55.53   0.000     5.17e-18    7.80e-17
   5+ years  |    .739408   .7642923    -0.29   0.770      .097507    5.607024
             |
cancer_hae~t |
  Last year  |   3.17e-18          .        .       .            .           .
2-5 years..  |   1.91e-18          .        .       .            .           .
   5+ years  |   5.936247    6.42344     1.65   0.100     .7119534    49.49626
             |
1.~r_disease |   3.250715    3.59506     1.07   0.286     .3720578     28.4019
1.stroke_d~a |   4.528345   2.163076     3.16   0.002     1.775587     11.5488
1.other_ne~o |   3.35e-18   1.09e-18  -123.29   0.000     1.76e-18    6.34e-18
             |
reduced_ki~t |
Stage 3a/..  |   .6621789   .4514203    -0.60   0.545     .1740583    2.519162
Stage 4/5..  |   1.36e-17   5.64e-18   -93.95   0.000     6.07e-18    3.07e-17
             |
      1.esrd |   1.55e-16   8.77e-17   -64.26   0.000     5.10e-17    4.70e-16
1.other_tr~t |   8.86e-18          .        .       .            .           .
  1.asplenia |   3.45e-17   4.02e-17   -32.57   0.000     3.53e-18    3.38e-16
1.ra_sle_p~s |   .9091832   .7046058    -0.12   0.902     .1990585     4.15262
1.other_im~o |   2.64e-18          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFU
> LLYADJMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFULLYADJM
> ODEL_ageband_1MAIN.ster saved
(72,537 observations deleted)
   1:    831.40 /        1 =     831.4040

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,611,987             Number of obs    =   2,611,987
No. of failures      =          709
Time at risk         =    546674342
                                                Wald chi2(47)    =      654.34
Log pseudolikelihood =    -7867.879             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,035,758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.166278   .2531991     0.71   0.479     .7620897    1.784835
 only 12-18  |    1.15996   .3267958     0.53   0.598     .6677805    2.014894
      mixed  |   .7879593   .3291766    -0.57   0.568     .3474619      1.7869
             |
        age1 |   .9409807   .0309562    -1.85   0.064     .8822223    1.003653
        age2 |   1.303329   .2624847     1.32   0.188     .8782659    1.934115
        age3 |   .3921677   .1860842    -1.97   0.049     .1547303    .9939585
      1.male |   2.663184   .2275158    11.47   0.000     2.252595    3.148613
             |
   obese4cat |
Obese I ..)  |   1.451477   .1321689     4.09   0.000     1.214231    1.735078
Obese II..)  |   1.816939   .2338564     4.64   0.000     1.411832    2.338286
Obese II..)  |   1.414145   .3084457     1.59   0.112     .9222198     2.16847
             |
smoke_nomiss |
     Former  |   1.419512   .1242427     4.00   0.000     1.195743    1.685157
    Current  |   .5410877    .105713    -3.14   0.002     .3689498    .7935386
             |
         imd |
          2  |   1.024018   .1240746     0.20   0.845     .8075549    1.298503
          3  |   1.159848     .13933     1.23   0.217     .9165327    1.467757
          4  |   1.254452   .1569038     1.81   0.070     .9817204    1.602951
5 most de..  |   1.151629   .1572307     1.03   0.301     .8812499    1.504965
             |
tot_adults~h |
          2  |   1.172033   .1112183     1.67   0.094     .9731195    1.411605
          3  |   1.143641   .1399549     1.10   0.273     .8997515     1.45364
             |
   ethnicity |
      Mixed  |   2.789199    1.02125     2.80   0.005     1.360871    5.716657
Asian or ..  |   2.387041   .3637358     5.71   0.000     1.770738    3.217847
      Black  |   3.017284   .6344618     5.25   0.000     1.998154    4.556205
      Other  |   3.139027   .7565858     4.75   0.000     1.957193      5.0345
             |
1.htdiag_o~p |   1.109893   .0981576     1.18   0.238     .9332579    1.319958
1.~y_disease |   1.553895   .1618515     4.23   0.000     1.266957    1.905819
    1.asthma |   1.093401   .1140965     0.86   0.392     .8911616    1.341536
1.~c_disease |   .8951499    .084828    -1.17   0.242     .7434169    1.077852
             |
     diabcat |
T1DM, con..  |   1.507108   1.081551     0.57   0.568     .3692271    6.151698
T1DM, unc..  |   1.318303    .769896     0.47   0.636     .4196709    4.141155
T2DM, con..  |   1.145444   .1252382     1.24   0.214     .9244995     1.41919
T2DM, unc..  |    1.69744   .2063815     4.35   0.000     1.337526    2.154205
Diabetes,..  |   1.474583   1.478456     0.39   0.698     .2066484     10.5222
             |
cancer_exh~t |
  Last year  |    .759225   .2895536    -0.72   0.470     .3595331    1.603253
2-5 years..  |   .7043248   .1607362    -1.54   0.125     .4503163    1.101611
   5+ years  |   .9665546   .1373274    -0.24   0.811     .7316245    1.276923
             |
cancer_hae~t |
  Last year  |   6.050907   2.499829     4.36   0.000     2.692533    13.59815
2-5 years..  |   4.965032   1.300963     6.12   0.000     2.970885    8.297711
   5+ years  |    1.31503   .4705553     0.77   0.444     .6521557    2.651672
             |
1.~r_disease |   .7200734   .2677686    -0.88   0.377     .3474133    1.492475
1.stroke_d~a |   1.279602   .1776108     1.78   0.076     .9748255    1.679667
1.other_ne~o |   .8897933    .251333    -0.41   0.679     .5115132    1.547823
             |
reduced_ki~t |
Stage 3a/..  |   1.343959   .1339351     2.97   0.003     1.105498    1.633859
Stage 4/5..  |   1.209599    .348097     0.66   0.508     .6881504    2.126176
             |
      1.esrd |   4.031435   1.355028     4.15   0.000     2.086208    7.790437
1.other_tr~t |   1.561844   1.605085     0.43   0.664     .2083865    11.70592
  1.asplenia |   .9956854   .7093787    -0.01   0.995      .246423     4.02312
1.ra_sle_p~s |   1.202544   .1553107     1.43   0.153     .9336125    1.548942
1.other_im~o |   .8848912   .6268568    -0.17   0.863      .220749    3.547161
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_1MAIN.ster not fo
> und)
file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_1MAIN.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_icuMAIN.log
  log type:  text
 closed on:  24 Jan 2021, 16:05:29
-------------------------------------------------------------------------------
