-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covidadmissionW2.lo
> g
  log type:  text
 opened on:  29 Jan 2021, 16:49:39

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   4170.30 /        1 =    4170.2950

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,266,918             Number of obs    =   9,266,918
No. of failures      =        3,615
Time at risk         =    829390579
                                                Wald chi2(47)    =     7395.51
Log pseudolikelihood =   -44394.653             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,781,608 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.17952   .0615061     3.17   0.002     1.064926    1.306446
 only 12-18  |   1.255113   .0701181     4.07   0.000     1.124941    1.400348
      mixed  |   1.444943   .0901326     5.90   0.000     1.278658    1.632852
             |
        age1 |   1.031948   .0096214     3.37   0.001     1.013261    1.050979
        age2 |   1.051624   .0259475     2.04   0.041     1.001977     1.10373
        age3 |   .8353967   .0553281    -2.72   0.007      .733699    .9511907
      1.male |    1.46395   .0506321    11.02   0.000     1.368002    1.566628
             |
   obese4cat |
Obese I ..)  |     1.8503   .0802264    14.19   0.000     1.699555    2.014416
Obese II..)  |    2.51142   .1362475    16.97   0.000     2.258087    2.793174
Obese II..)  |   3.468232   .2188941    19.70   0.000     3.064682    3.924921
             |
smoke_nomiss |
     Former  |   1.028423   .0387961     0.74   0.458     .9551272    1.107344
    Current  |   .3167128   .0210859   -17.27   0.000     .2779681     .360858
             |
         imd |
          2  |   1.070504   .0709495     1.03   0.304     .9400983    1.218998
          3  |   1.194765   .0776913     2.74   0.006     1.051797    1.357166
          4  |   1.380669   .0851032     5.23   0.000     1.223552    1.557963
5 most de..  |   1.692708   .1029154     8.66   0.000     1.502553    1.906929
             |
tot_adults~h |
          2  |   .9026761   .0424717    -2.18   0.030     .8231561    .9898781
          3  |   1.157423   .0537676     3.15   0.002     1.056696    1.267752
             |
   ethnicity |
      Mixed  |   1.801103   .2281453     4.65   0.000     1.405132     2.30866
Asian or ..  |   2.587489   .1299554    18.93   0.000     2.344916    2.855155
      Black  |    1.80186   .1474822     7.19   0.000     1.534794    2.115397
      Other  |   1.846382   .1850142     6.12   0.000     1.517149    2.247062
             |
1.htdiag_o~p |   1.144331   .0456555     3.38   0.001     1.058257    1.237406
1.~y_disease |   3.395534   .2068107    20.07   0.000     3.013452    3.826062
    1.asthma |   1.465605   .0589432     9.50   0.000     1.354515    1.585807
1.~c_disease |   1.372639   .0821616     5.29   0.000     1.220692    1.543499
             |
     diabcat |
T1DM, con..  |   .7792951   .3520359    -0.55   0.581     .3215017    1.888951
T1DM, unc..  |   1.963055   .3559989     3.72   0.000     1.375839    2.800899
T2DM, con..  |   1.561176   .0961171     7.24   0.000     1.383713      1.7614
T2DM, unc..  |   2.112269   .1262169    12.51   0.000     1.878825    2.374718
Diabetes,..  |   2.182495   .8975828     1.90   0.058     .9747298    4.886774
             |
cancer_exh~t |
  Last year  |   2.243134   .4298242     4.22   0.000     1.540813    3.265582
2-5 years..  |   1.349248   .1922429     2.10   0.036     1.020496    1.783907
   5+ years  |   1.204121    .142519     1.57   0.117      .954822    1.518511
             |
cancer_hae~t |
  Last year  |   4.589771   1.758136     3.98   0.000     2.166376    9.724073
2-5 years..  |   2.852418   .7708275     3.88   0.000     1.679529    4.844388
   5+ years  |   1.963861   .4178483     3.17   0.002     1.294201    2.980025
             |
1.~r_disease |   1.157145   .1665371     1.01   0.311     .8727345     1.53424
1.stroke_d~a |    1.24293   .1315562     2.05   0.040     1.010072    1.529469
1.other_ne~o |   2.058756   .2475074     6.01   0.000     1.626567    2.605781
             |
reduced_ki~t |
Stage 3a/..  |   1.286039   .1209945     2.67   0.007     1.069474    1.546456
Stage 4/5..  |    2.34333   .4609779     4.33   0.000     1.593624    3.445729
             |
      1.esrd |   2.878984   .5622566     5.41   0.000      1.96337    4.221592
1.other_tr~t |   2.155882   .7818021     2.12   0.034     1.059127    4.388358
  1.asplenia |   1.899674   .5382583     2.26   0.024     1.090178    3.310248
1.ra_sle_p~s |   1.210603   .0794538     2.91   0.004     1.064477    1.376789
1.other_im~o |   .5689427   .1737091    -1.85   0.065     .3127378    1.035039
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFU
> LLYADJMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJM
> ODEL_ageband_0W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.01074         0.42        1         0.5168
      2.kids_cat4 |     -0.01213         0.55        1         0.4594
      3.kids_cat4 |     -0.00700         0.18        1         0.6705
      age1        |     -0.00636         0.13        1         0.7166
      age2        |      0.00802         0.22        1         0.6429
      age3        |     -0.00776         0.21        1         0.6490
      0b.male     |            .            .        1             .
      1.male      |     -0.01742         1.20        1         0.2740
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.02448         2.49        1         0.1143
      3.obese4cat |      0.00613         0.17        1         0.6839
      4.obese4cat |     -0.00497         0.12        1         0.7270
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00939         0.35        1         0.5566
      3.smoke_no~s|     -0.02713         3.07        1         0.0799
      1b.imd      |            .            .        1             .
      2.imd       |     -0.03107         3.65        1         0.0560
      3.imd       |     -0.00122         0.01        1         0.9396
      4.imd       |      0.00283         0.03        1         0.8595
      5.imd       |      0.00226         0.02        1         0.8847
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01985         1.49        1         0.2229
      3.tot_adul~h|      0.02094         1.69        1         0.1937
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.00026         0.00        1         0.9871
      3.ethnicity |     -0.07546        22.43        1         0.0000
      4.ethnicity |     -0.05336        11.07        1         0.0009
      5.ethnicity |     -0.01475         0.79        1         0.3734
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01882         1.61        1         0.2052
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.01345         0.91        1         0.3400
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01107         0.50        1         0.4773
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00449         0.09        1         0.7678
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01623         1.03        1         0.3094
      3.diabcat   |     -0.00631         0.16        1         0.6877
      4.diabcat   |     -0.00172         0.01        1         0.9084
      5.diabcat   |      0.00655         0.20        1         0.6567
      6.diabcat   |      0.01505         0.85        1         0.3564
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.00761         0.22        1         0.6368
      3.cancer_e~t|      0.01277         0.63        1         0.4273
      4.cancer_e~t|     -0.00886         0.30        1         0.5866
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.03846         5.70        1         0.0170
      3.cancer_h~t|     -0.00802         0.25        1         0.6191
      4.cancer_h~t|     -0.00780         0.25        1         0.6175
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.01536         0.92        1         0.3382
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00681         0.19        1         0.6627
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01906         1.39        1         0.2383
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.02653         2.79        1         0.0946
      3.reduced_~t|     -0.00852         0.38        1         0.5361
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00475         0.11        1         0.7357
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01685         1.08        1         0.2986
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.02087         1.87        1         0.1720
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.02289         2.01        1         0.1567
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00715         0.21        1         0.6458
      ------------+---------------------------------------------------
      global test |                     72.73       47         0.0094
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   7090.88 /        1 =    7090.8770
   1:   1706.47 /        1 =    1706.4740

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,849,103             Number of obs    =   1,849,103
No. of failures      =          553
Time at risk         =    165713293
                                                Wald chi2(43)    =     1243.76
Log pseudolikelihood =   -5915.1514             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,058,848 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.103203   .1054557     1.03   0.304     .9147212    1.330522
3 childre..  |   1.068458   .1607878     0.44   0.660     .7955431    1.434998
4+ childr..  |   1.464026   .3416863     1.63   0.102     .9265922    2.313179
             |
        age1 |   1.003216   .0202706     0.16   0.874     .9642628    1.043743
        age2 |   1.091266   .0595291     1.60   0.109     .9806122    1.214407
        age3 |   .7835804   .1198494    -1.59   0.111     .5806192    1.057489
      1.male |   1.644035   .1480199     5.52   0.000     1.378077    1.961321
             |
   obese4cat |
Obese I ..)  |   1.890245   .2125694     5.66   0.000     1.516336    2.356356
Obese II..)  |   2.680557   .3837922     6.89   0.000     2.024665    3.548926
Obese II..)  |    4.79066   .7610002     9.86   0.000     3.508983    6.540476
             |
smoke_nomiss |
     Former  |   .9101988   .0893993    -0.96   0.338     .7508127     1.10342
    Current  |   .3192053   .0550436    -6.62   0.000     .2276613    .4475596
             |
         imd |
          2  |   1.516893    .276491     2.29   0.022     1.061213    2.168239
          3  |   1.466285   .2679264     2.09   0.036     1.024903    2.097751
          4  |   1.886894   .3229814     3.71   0.000     1.349108    2.639055
5 most de..  |   2.072348   .3568749     4.23   0.000     1.478696    2.904333
             |
tot_adults~h |
          2  |   .7959849   .1136685    -1.60   0.110     .6016602    1.053073
          3  |   .9244798   .1393971    -0.52   0.603     .6879384    1.242354
             |
   ethnicity |
      Mixed  |   .8844836   .3670787    -0.30   0.767     .3921244    1.995059
Asian or ..  |   2.979416   .3480001     9.35   0.000     2.369788     3.74587
      Black  |   1.896086   .3763927     3.22   0.001     1.284948    2.797888
      Other  |   2.506139   .5135606     4.48   0.000     1.677166    3.744849
             |
1.htdiag_o~p |   1.188558   .1306821     1.57   0.116     .9581441    1.474383
1.~y_disease |   3.432859   .7211409     5.87   0.000      2.27428    5.181648
    1.asthma |   1.342307    .142345     2.78   0.006     1.090401    1.652409
1.~c_disease |   1.402892   .2839642     1.67   0.094     .9434732    2.086022
             |
     diabcat |
T1DM, con..  |   6.52e-20          .        .       .            .           .
T1DM, unc..  |   3.227661   1.352614     2.80   0.005      1.41963    7.338384
T2DM, con..  |   1.787899   .3278577     3.17   0.002     1.248111    2.561138
T2DM, unc..  |   2.176693    .395605     4.28   0.000     1.524386    3.108133
Diabetes,..  |   2.15e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   3.386108   1.983343     2.08   0.037     1.074304     10.6727
2-5 years..  |   1.002293   .5855165     0.00   0.997     .3189643    3.149539
   5+ years  |    .915869   .4617193    -0.17   0.862     .3409691    2.460094
             |
cancer_hae~t |
  Last year  |   3.95e-19          .        .       .            .           .
2-5 years..  |   5.829469   3.426027     3.00   0.003     1.842344    18.44536
   5+ years  |   2.768721   1.611592     1.75   0.080     .8847475    8.664409
             |
1.~r_disease |   .7183109   .4184672    -0.57   0.570     .2293121    2.250079
1.stroke_d~a |   .7811833   .3683084    -0.52   0.600     .3100507    1.968218
1.other_ne~o |   1.085656   .6411938     0.14   0.889     .3411678    3.454746
             |
reduced_ki~t |
Stage 3a/..  |   .7328547   .3178174    -0.72   0.474     .3132398    1.714584
Stage 4/5..  |   2.369034   1.314314     1.55   0.120     .7986085    7.027626
             |
      1.esrd |   3.953065   2.201384     2.47   0.014      1.32714    11.77474
1.other_tr~t |   3.50e-19          .        .       .            .           .
  1.asplenia |   3.180149   2.391263     1.54   0.124     .7284497    13.88338
1.ra_sle_p~s |   1.234392   .2311087     1.12   0.261     .8552385    1.781637
1.other_im~o |   .9146047   .6529777    -0.13   0.901     .2256951    3.706336
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_M
> AINFULLYADJMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULL
> YADJMODEL_ageband_0W2.ster saved
(533,406 observations deleted)
   1:   4073.70 /        1 =    4073.6980

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,733,512             Number of obs    =   8,733,512
No. of failures      =        3,473
Time at risk         =    781899655
                                                Wald chi2(47)    =     7197.13
Log pseudolikelihood =   -42436.816             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,502,867 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.178889     .06285     3.09   0.002     1.061923    1.308739
 only 12-18  |   1.270077   .0718214     4.23   0.000      1.13683    1.418942
      mixed  |   1.451483   .0921601     5.87   0.000      1.28164    1.643834
             |
        age1 |   1.033081   .0099112     3.39   0.001     1.013837     1.05269
        age2 |   1.047485   .0264668     1.84   0.066     .9968745    1.100665
        age3 |     .84564   .0572737    -2.48   0.013     .7405172    .9656859
      1.male |   1.475111    .052046    11.02   0.000      1.37655    1.580729
             |
   obese4cat |
Obese I ..)  |     1.8745   .0826995    14.24   0.000     1.719222    2.043802
Obese II..)  |   2.531772   .1398698    16.81   0.000     2.271953    2.821304
Obese II..)  |   3.477697   .2237086    19.38   0.000      3.06575    3.944997
             |
smoke_nomiss |
     Former  |   1.031866   .0397042     0.82   0.415     .9569089    1.112694
    Current  |   .3151065   .0215217   -16.91   0.000     .2756261     .360242
             |
         imd |
          2  |   1.071194   .0722948     1.02   0.308     .9384702    1.222688
          3  |   1.181501    .078402     2.51   0.012     1.037409    1.345607
          4  |   1.376462   .0864109     5.09   0.000     1.217105    1.556685
5 most de..  |   1.700405   .1051862     8.58   0.000     1.506251    1.919584
             |
tot_adults~h |
          2  |   .9184143   .0443764    -1.76   0.078     .8354295    1.009642
          3  |   1.174045    .056074     3.36   0.001     1.069129    1.289256
             |
   ethnicity |
      Mixed  |   1.842781   .2388553     4.72   0.000     1.429367    2.375767
Asian or ..  |   2.625006   .1341937    18.88   0.000     2.374738    2.901649
      Black  |    1.80411   .1517899     7.01   0.000     1.529843    2.127548
      Other  |   1.912862   .1962511     6.32   0.000     1.564423    2.338908
             |
1.htdiag_o~p |   1.136928   .0461044     3.16   0.002     1.050063    1.230979
1.~y_disease |   3.457583   .2134462    20.10   0.000     3.063555    3.902291
    1.asthma |   1.457905   .0598584     9.18   0.000     1.345181    1.580075
1.~c_disease |   1.343711   .0820055     4.84   0.000     1.192224    1.514447
             |
     diabcat |
T1DM, con..  |   .8095524   .3657567    -0.47   0.640      .333942    1.962541
T1DM, unc..  |   1.914426   .3582305     3.47   0.001     1.326662    2.762593
T2DM, con..  |   1.571272    .098218     7.23   0.000     1.390093    1.776065
T2DM, unc..  |    2.12598   .1288451    12.45   0.000      1.88787    2.394122
Diabetes,..  |   2.329792   .9590397     2.05   0.040     1.039746    5.220442
             |
cancer_exh~t |
  Last year  |   2.233848    .436135     4.12   0.000     1.523581    3.275229
2-5 years..  |   1.324462   .1925919     1.93   0.053     .9960134    1.761221
   5+ years  |     1.1699   .1423645     1.29   0.197     .9216512    1.485016
             |
cancer_hae~t |
  Last year  |   4.725712   1.812265     4.05   0.000     2.228639    10.02063
2-5 years..  |   2.927437   .7917536     3.97   0.000     1.722947    4.973971
   5+ years  |   1.933326   .4204604     3.03   0.002     1.262366    2.960906
             |
1.~r_disease |   1.150698   .1689074     0.96   0.339     .8630102    1.534287
1.stroke_d~a |   1.259338   .1347499     2.15   0.031     1.021088    1.553178
1.other_ne~o |   2.098139   .2542309     6.12   0.000     1.654605    2.660566
             |
reduced_ki~t |
Stage 3a/..  |   1.287395   .1229291     2.65   0.008     1.067661    1.552352
Stage 4/5..  |   2.239511   .4445167     4.06   0.000     1.517748    3.304507
             |
      1.esrd |   3.055283   .5930052     5.75   0.000     2.088528    4.469538
1.other_tr~t |   2.202772   .8001303     2.17   0.030     1.080888    4.489089
  1.asplenia |   1.964514   .5570438     2.38   0.017     1.126923    3.424647
1.ra_sle_p~s |   1.227316   .0814275     3.09   0.002     1.077662    1.397753
1.other_im~o |   .5424298   .1733718    -1.91   0.056     .2899225    1.014858
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_0W2.ster not
>  found)
file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_0W2.ster saved
   1:   1257.37 /        1 =    1257.3740

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,706,502             Number of obs    =   2,706,502
No. of failures      =        4,277
Time at risk         =    242099919
                                                Wald chi2(47)    =     5734.63
Log pseudolikelihood =   -48106.346             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,109,800 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9575647   .1050818    -0.40   0.693     .7722509    1.187347
 only 12-18  |   1.039662    .132645     0.30   0.760     .8096397    1.335034
      mixed  |   1.193652   .1693339     1.25   0.212     .9039084    1.576271
             |
        age1 |   1.043041   .0186646     2.35   0.019     1.007093    1.080272
        age2 |   1.043029    .089928     0.49   0.625     .8808608    1.235052
        age3 |   .9179063    .164149    -0.48   0.632     .6465142    1.303223
      1.male |   1.425817   .0459607    11.01   0.000     1.338523    1.518805
             |
   obese4cat |
Obese I ..)  |   1.353881   .0516467     7.94   0.000     1.256347    1.458987
Obese II..)  |   1.612486   .0888452     8.67   0.000     1.447425    1.796369
Obese II..)  |   1.928188   .1499627     8.44   0.000     1.655572    2.245694
             |
smoke_nomiss |
     Former  |   1.347459   .0494593     8.12   0.000     1.253926     1.44797
    Current  |   .7072242   .0531063    -4.61   0.000     .6104349    .8193601
             |
         imd |
          2  |   1.083937   .0611306     1.43   0.153     .9705077    1.210624
          3  |   1.286042   .0718069     4.51   0.000      1.15273     1.43477
          4  |   1.438629   .0785877     6.66   0.000     1.292559    1.601206
5 most de..  |   1.992746   .1064136    12.91   0.000     1.794723    2.212619
             |
tot_adults~h |
          2  |   .9113999   .0332609    -2.54   0.011     .8484865    .9789781
          3  |   1.132519     .05664     2.49   0.013     1.026774    1.249154
             |
   ethnicity |
      Mixed  |   .9082218   .2538919    -0.34   0.731     .5250974    1.570883
Asian or ..  |   2.327469   .1440218    13.65   0.000     2.061637    2.627577
      Black  |   1.093796   .1464015     0.67   0.503     .8414056    1.421894
      Other  |   1.352867    .225986     1.81   0.070     .9751432    1.876903
             |
1.htdiag_o~p |   1.047248   .0404555     1.20   0.232      .970884    1.129618
1.~y_disease |   2.299525   .0838022    22.85   0.000     2.141005    2.469782
    1.asthma |   1.094555    .045268     2.18   0.029     1.009332    1.186974
1.~c_disease |   1.387605   .0469565     9.68   0.000     1.298558    1.482759
             |
     diabcat |
T1DM, con..  |   1.436992   .4825198     1.08   0.280     .7441045    2.775075
T1DM, unc..  |    1.66706   .3673369     2.32   0.020     1.082402    2.567519
T2DM, con..  |   1.263733   .0521086     5.68   0.000      1.16562    1.370104
T2DM, unc..  |   1.776752   .0869943    11.74   0.000     1.614172    1.955707
Diabetes,..  |   .9052256   .5236102    -0.17   0.863     .2913371    2.812664
             |
cancer_exh~t |
  Last year  |   1.282489    .164575     1.94   0.053      .997295     1.64924
2-5 years..  |   1.106307   .0871414     1.28   0.200     .9480441    1.290991
   5+ years  |   1.066927   .0541961     1.28   0.202     .9658216    1.178617
             |
cancer_hae~t |
  Last year  |   1.529558   .5116742     1.27   0.204     .7939966    2.946548
2-5 years..  |   1.904685   .3142136     3.91   0.000     1.378483    2.631752
   5+ years  |   1.777453   .2124412     4.81   0.000      1.40625    2.246641
             |
1.~r_disease |   1.468396   .1698282     3.32   0.001     1.170569    1.841999
1.stroke_d~a |   1.394412   .0620428     7.47   0.000     1.277962    1.521474
1.other_ne~o |   1.667903   .1379605     6.18   0.000     1.418285    1.961452
             |
reduced_ki~t |
Stage 3a/..  |   1.303258   .0473937     7.28   0.000     1.213601    1.399538
Stage 4/5..  |   1.836646   .1415332     7.89   0.000     1.579178     2.13609
             |
      1.esrd |   1.648835   .2899713     2.84   0.004     1.168103    2.327412
1.other_tr~t |   2.611367   1.036792     2.42   0.016     1.199264    5.686184
  1.asplenia |   1.269632    .329675     0.92   0.358     .7632261    2.112041
1.ra_sle_p~s |   1.269119   .0636581     4.75   0.000     1.150288    1.400226
1.other_im~o |   1.223051   .3548564     0.69   0.488     .6925909    2.159795
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFU
> LLYADJMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJM
> ODEL_ageband_1W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00093         0.00        1         0.9512
      2.kids_cat4 |     -0.00152         0.01        1         0.9182
      3.kids_cat4 |     -0.00437         0.08        1         0.7731
      age1        |      0.00253         0.03        1         0.8634
      age2        |     -0.00485         0.11        1         0.7426
      age3        |      0.00533         0.13        1         0.7186
      0b.male     |            .            .        1             .
      1.male      |      0.00005         0.00        1         0.9972
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00651         0.19        1         0.6647
      3.obese4cat |     -0.01358         0.82        1         0.3664
      4.obese4cat |     -0.01556         1.09        1         0.2969
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.02258         2.22        1         0.1361
      3.smoke_no~s|      0.00787         0.30        1         0.5859
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01164         0.62        1         0.4310
      3.imd       |     -0.00725         0.24        1         0.6216
      4.imd       |     -0.02176         2.19        1         0.1386
      5.imd       |     -0.01571         1.19        1         0.2752
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01623         1.25        1         0.2643
      3.tot_adul~h|      0.02660         3.16        1         0.0756
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.00507         0.11        1         0.7356
      3.ethnicity |     -0.05030        10.41        1         0.0013
      4.ethnicity |     -0.00022         0.00        1         0.9881
      5.ethnicity |      0.01150         0.58        1         0.4453
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00527         0.13        1         0.7208
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00136         0.01        1         0.9227
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01653         1.26        1         0.2613
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00232         0.03        1         0.8738
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.04241         7.95        1         0.0048
      3.diabcat   |     -0.02942         3.86        1         0.0493
      4.diabcat   |      0.01244         0.73        1         0.3920
      5.diabcat   |      0.01001         0.48        1         0.4866
      6.diabcat   |     -0.00606         0.16        1         0.6899
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.02469         2.71        1         0.0996
      3.cancer_e~t|     -0.00852         0.32        1         0.5695
      4.cancer_e~t|     -0.01095         0.53        1         0.4657
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00770         0.26        1         0.6084
      3.cancer_h~t|      0.02485         2.72        1         0.0994
      4.cancer_h~t|     -0.01629         1.19        1         0.2751
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00261         0.03        1         0.8622
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00741         0.27        1         0.6067
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.04163         8.02        1         0.0046
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00499         0.12        1         0.7320
      3.reduced_~t|     -0.01185         0.72        1         0.3968
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.02321         2.51        1         0.1129
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01403         0.81        1         0.3682
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00624         0.17        1         0.6785
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00241         0.03        1         0.8722
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00632         0.18        1         0.6693
      ------------+---------------------------------------------------
      global test |                     57.56       47         0.1391
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   2064.91 /        1 =    2064.9110
   1:     65.94 /        1 =      65.9440

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       44,335             Number of obs    =      44,335
No. of failures      =           96
Time at risk         =      3959985
                                                Wald chi2(47)    =    69304.70
Log pseudolikelihood =   -691.38619             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,383 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.122363   .2586554     0.50   0.616     .7144454    1.763186
3 childre..  |   1.372373   .4777017     0.91   0.363     .6937165    2.714952
4+ childr..  |     2.0823   1.155075     1.32   0.186     .7020569    6.176098
             |
        age1 |    1.19115   .1089088     1.91   0.056     .9957255    1.424929
        age2 |   .5752587    .282069    -1.13   0.259     .2200341     1.50396
        age3 |   2.983032   3.168362     1.03   0.303     .3720258    23.91899
      1.male |    1.24384   .2689084     1.01   0.313     .8142195    1.900149
             |
   obese4cat |
Obese I ..)  |   1.482294   .3572994     1.63   0.103     .9241797    2.377454
Obese II..)  |   1.386566   .5563102     0.81   0.415     .6315766    3.044071
Obese II..)  |   1.05e-15   2.32e-16  -156.09   0.000     6.81e-16    1.62e-15
             |
smoke_nomiss |
     Former  |   .9835993   .2246364    -0.07   0.942     .6286647    1.538925
    Current  |   .3542496   .2047247    -1.80   0.073     .1141276    1.099583
             |
         imd |
          2  |   .5747963   .2793685    -1.14   0.255     .2217196    1.490129
          3  |   1.286337   .5299118     0.61   0.541     .5737186    2.884103
          4  |   .7349121   .3021394    -0.75   0.454     .3283119    1.645069
5 most de..  |   1.197256   .4832435     0.45   0.656     .5427756    2.640913
             |
tot_adults~h |
          2  |    .707749    .558895    -0.44   0.662     .1505576    3.327023
          3  |   1.158831   .8433539     0.20   0.839     .2783218     4.82495
             |
   ethnicity |
      Mixed  |   2.602933   1.957767     1.27   0.203     .5959931    11.36802
Asian or ..  |   2.022521   .5407811     2.63   0.008     1.197565    3.415758
      Black  |   .6836033   .5498086    -0.47   0.636     .1413187    3.306805
      Other  |   1.173667   .8539914     0.22   0.826     .2819604    4.885419
             |
1.htdiag_o~p |   1.590097    .453475     1.63   0.104     .9092261    2.780835
1.~y_disease |   1.912566   .5530984     2.24   0.025     1.085066    3.371142
    1.asthma |   1.095936   .2935309     0.34   0.732     .6483401    1.852539
1.~c_disease |   1.110179   .2549628     0.46   0.649     .7077934    1.741322
             |
     diabcat |
T1DM, con..  |   1.21e-15   5.37e-16   -77.38   0.000     5.07e-16    2.89e-15
T1DM, unc..  |   5.267251   5.450783     1.61   0.108     .6929838    40.03546
T2DM, con..  |   2.076578   .5301863     2.86   0.004     1.258989    3.425112
T2DM, unc..  |    2.83503   .7588039     3.89   0.000     1.677765    4.790537
Diabetes,..  |   1.55e-15   4.78e-16  -110.61   0.000     8.46e-16    2.83e-15
             |
cancer_exh~t |
  Last year  |   2.302979   1.668553     1.15   0.250     .5566447    9.528002
2-5 years..  |   1.365636   .8123545     0.52   0.600     .4255922    4.382036
   5+ years  |   1.461695   .6002559     0.92   0.355     .6535885    3.268955
             |
cancer_hae~t |
  Last year  |   31.04206   27.42124     3.89   0.000     5.495855    175.3339
2-5 years..  |   3.693465   3.802159     1.27   0.204     .4911143      27.777
   5+ years  |   2.965374   2.056463     1.57   0.117     .7616894    11.54465
             |
1.~r_disease |   .6247916   .4935733    -0.60   0.552     .1328319    2.938786
1.stroke_d~a |   .7531494   .2851851    -0.75   0.454      .358565    1.581956
1.other_ne~o |   .4462246   .4576652    -0.79   0.431     .0597762    3.331032
             |
reduced_ki~t |
Stage 3a/..  |   1.167926   .3130809     0.58   0.563     .6906175    1.975119
Stage 4/5..  |    1.17638   .5903114     0.32   0.746     .4399585    3.145455
             |
      1.esrd |   5.437445   3.418722     2.69   0.007     1.585671    18.64561
1.other_tr~t |   5.423235   6.029013     1.52   0.128     .6137298    47.92252
  1.asplenia |   4.510153   4.160208     1.63   0.102     .7396646    27.50095
1.ra_sle_p~s |   1.096727   .4340814     0.23   0.816     .5048887    2.382329
1.other_im~o |   1.70e-15   6.77e-16   -85.58   0.000     7.82e-16    3.71e-15
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_M
> AINFULLYADJMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULL
> YADJMODEL_ageband_1W2.ster saved
(55,013 observations deleted)
   1:   1166.14 /        1 =    1166.1370

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,651,489             Number of obs    =   2,651,489
No. of failures      =        4,186
Time at risk         =    237197845
                                                Wald chi2(47)    =     5591.57
Log pseudolikelihood =   -47000.239             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,067,440 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9346336   .1051327    -0.60   0.548     .7497104     1.16517
 only 12-18  |    1.05011   .1351417     0.38   0.704     .8160021    1.351383
      mixed  |   1.215127   .1739294     1.36   0.173     .9178749    1.608644
             |
        age1 |   1.042968   .0188517     2.33   0.020     1.006666    1.080579
        age2 |   1.039817   .0905812     0.45   0.654     .8766101    1.233409
        age3 |   .9239347   .1669779    -0.44   0.662     .6483478    1.316663
      1.male |   1.422523    .046358    10.81   0.000     1.334504    1.516347
             |
   obese4cat |
Obese I ..)  |   1.355251   .0521824     7.89   0.000     1.256739    1.461484
Obese II..)  |   1.603117   .0893631     8.47   0.000     1.437197    1.788191
Obese II..)  |    1.91957   .1510245     8.29   0.000      1.64526    2.239614
             |
smoke_nomiss |
     Former  |   1.342181   .0497942     7.93   0.000      1.24805    1.443412
    Current  |   .7096669   .0537943    -4.52   0.000     .6116904    .8233367
             |
         imd |
          2  |   1.076111   .0615184     1.28   0.199     .9620468    1.203699
          3  |   1.292756    .073002     4.55   0.000     1.157308    1.444055
          4  |   1.451543   .0801768     6.75   0.000     1.302606    1.617508
5 most de..  |   1.998079   .1080778    12.80   0.000     1.797093    2.221544
             |
tot_adults~h |
          2  |    .916913   .0338241    -2.35   0.019     .8529589    .9856623
          3  |   1.137586   .0575758     2.55   0.011     1.030156    1.256219
             |
   ethnicity |
      Mixed  |    .862445    .250894    -0.51   0.611       .48765    1.525298
Asian or ..  |   2.347201   .1474493    13.58   0.000     2.075288     2.65474
      Black  |   1.103431   .1489536     0.73   0.466     .8469157    1.437639
      Other  |   1.351944   .2287501     1.78   0.075      .970364    1.883574
             |
1.htdiag_o~p |   1.046736   .0408989     1.17   0.242     .9695679    1.130045
1.~y_disease |   2.294002   .0845028    22.54   0.000     2.134217     2.46575
    1.asthma |   1.098427   .0458717     2.25   0.025     1.012101    1.192116
1.~c_disease |   1.387384   .0474731     9.57   0.000      1.29739     1.48362
             |
     diabcat |
T1DM, con..  |   1.468551   .4931233     1.14   0.252     .7604401    2.836046
T1DM, unc..  |   1.629285   .3675376     2.16   0.030     1.047083    2.535204
T2DM, con..  |   1.270368    .052903     5.75   0.000     1.170799    1.378405
T2DM, unc..  |    1.78739   .0885588    11.72   0.000      1.62198    1.969669
Diabetes,..  |   .9634029   .5574048    -0.06   0.949     .3099706      2.9943
             |
cancer_exh~t |
  Last year  |   1.308386   .1679516     2.09   0.036     1.017351    1.682677
2-5 years..  |   1.088977   .0872841     1.06   0.288     .9306635     1.27422
   5+ years  |   1.052727   .0543799     0.99   0.320     .9513621    1.164892
             |
cancer_hae~t |
  Last year  |   1.569552   .5250895     1.35   0.178     .8147199    3.023729
2-5 years..  |   1.783477   .3068447     3.36   0.001     1.272974    2.498708
   5+ years  |   1.813213   .2167541     4.98   0.000     1.434482    2.291937
             |
1.~r_disease |    1.49995   .1736315     3.50   0.000     1.195482    1.881959
1.stroke_d~a |    1.36558   .0619342     6.87   0.000      1.24943    1.492527
1.other_ne~o |   1.700635   .1415756     6.38   0.000     1.444607    2.002039
             |
reduced_ki~t |
Stage 3a/..  |   1.315101   .0483613     7.45   0.000     1.223649    1.413386
Stage 4/5..  |   1.834042   .1436062     7.75   0.000     1.573113    2.138251
             |
      1.esrd |   1.680834   .2960582     2.95   0.003     1.190134    2.373851
1.other_tr~t |   2.644906   1.049107     2.45   0.014     1.215569     5.75494
  1.asplenia |   1.212647   .3257575     0.72   0.473     .7162639    2.053031
1.ra_sle_p~s |   1.286001   .0648358     4.99   0.000     1.165002    1.419567
1.other_im~o |   1.256292   .3646113     0.79   0.432     .7112919    2.218877
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_1W2.ster not
>  found)
file ./output/an_sense_covidadmission_plus_eth_12mo_ageband_1W2.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covidadmissionW2.lo
> g
  log type:  text
 closed on:  29 Jan 2021, 22:50:02
-------------------------------------------------------------------------------
