-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_deathW2.log
  log type:  text
 opened on:  24 Jan 2021, 10:10:44

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   3187.54 /        1 =    3187.5440

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,266,919             Number of obs    =   9,266,919
No. of failures      =          591
Time at risk         =    994517312
                                                Wald chi2(47)    =     3035.73
Log pseudolikelihood =   -6693.7696             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,781,608 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5232921   .1077047    -3.15   0.002     .3495817    .7833207
 only 12-18  |   .9724982   .1557448    -0.17   0.862      .710509    1.331092
      mixed  |   .8355445   .1871316    -0.80   0.422     .5386806    1.296008
             |
        age1 |   1.082933   .0566363     1.52   0.128     .9774276    1.199827
        age2 |   1.116303   .1277998     0.96   0.337     .8919329    1.397113
        age3 |   .6802599    .190733    -1.37   0.169     .3926566     1.17852
      1.male |    1.93146   .1755347     7.24   0.000     1.616319    2.308047
             |
   obese4cat |
Obese I ..)  |    1.57442    .167041     4.28   0.000     1.278824    1.938342
Obese II..)  |   1.996115   .2670091     5.17   0.000     1.535766    2.594454
Obese II..)  |   2.890352   .4373876     7.01   0.000     2.148529    3.888305
             |
smoke_nomiss |
     Former  |   1.246838   .1199989     2.29   0.022     1.032496    1.505677
    Current  |   .6210071   .0865036    -3.42   0.001     .4726372    .8159533
             |
         imd |
          2  |   1.332591   .2426846     1.58   0.115     .9325682    1.904204
          3  |   1.561242   .2759674     2.52   0.012     1.104106    2.207648
          4  |   2.114709   .3512858     4.51   0.000     1.527049    2.928521
5 most de..  |   3.000389    .491836     6.70   0.000     2.175931    4.137233
             |
tot_adults~h |
          2  |   .8135286    .088744    -1.89   0.059     .6569302    1.007457
          3  |    1.00889   .1101982     0.08   0.935     .8144597    1.249736
             |
   ethnicity |
      Mixed  |    1.16832   .4834048     0.38   0.707     .5192396    2.628787
Asian or ..  |   2.392294   .3191801     6.54   0.000      1.84182    3.107291
      Black  |   .9469947   .2429069    -0.21   0.832     .5728117    1.565609
      Other  |   .5569955   .2794003    -1.17   0.243     .2083875    1.488784
             |
1.htdiag_o~p |   1.103342   .1071392     1.01   0.311     .9121259    1.334644
1.~y_disease |   3.198997   .3869136     9.61   0.000     2.523843    4.054761
    1.asthma |    1.16886   .1199721     1.52   0.128     .9558612    1.429322
1.~c_disease |   1.688125   .1908312     4.63   0.000     1.352639    2.106819
             |
     diabcat |
T1DM, con..  |   2.180166   1.277034     1.33   0.183     .6916674    6.871977
T1DM, unc..  |   1.801684   .7494737     1.42   0.157     .7972443    4.071606
T2DM, con..  |   1.817767   .2284578     4.75   0.000     1.420885    2.325507
T2DM, unc..  |   2.344382   .3019302     6.62   0.000      1.82139    3.017544
Diabetes,..  |   4.016221   2.867454     1.95   0.051     .9910296    16.27603
             |
cancer_exh~t |
  Last year  |   5.962481   1.495833     7.12   0.000     3.646553    9.749258
2-5 years..  |   2.697758   .5884108     4.55   0.000     1.759327    4.136752
   5+ years  |   1.608852   .3567795     2.14   0.032     1.041725    2.484728
             |
cancer_hae~t |
  Last year  |   7.134064   4.231898     3.31   0.001     2.230528    22.81741
2-5 years..  |   7.233086   2.481765     5.77   0.000     3.692032    14.17039
   5+ years  |   5.186189   1.458441     5.85   0.000      2.98866    8.999537
             |
1.~r_disease |   3.116931   .5887067     6.02   0.000     2.152571    4.513328
1.stroke_d~a |   1.532737   .2768405     2.36   0.018     1.075784    2.183788
1.other_ne~o |   2.754941   .6191748     4.51   0.000      1.77339     4.27977
             |
reduced_ki~t |
Stage 3a/..  |   1.994269   .3126408     4.40   0.000     1.466699    2.711604
Stage 4/5..  |   3.862198   1.374096     3.80   0.000     1.923062    7.756679
             |
      1.esrd |   2.475334   .9832261     2.28   0.022     1.136393    5.391866
1.other_tr~t |   1.623125   1.055707     0.74   0.456     .4536451    5.807477
  1.asplenia |   .8191429   .5958527    -0.27   0.784     .1968735    3.408256
1.ra_sle_p~s |    1.43908    .196802     2.66   0.008     1.100724    1.881444
1.other_im~o |   2.723245   .9438395     2.89   0.004     1.380613    5.371574
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLY
> ADJMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLYADJMODE
> L_ageband_0W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.01029         0.08        1         0.7709
      2.kids_cat4 |     -0.00162         0.00        1         0.9638
      3.kids_cat4 |      0.00280         0.01        1         0.9398
      age1        |      0.03027         0.52        1         0.4722
      age2        |     -0.02330         0.30        1         0.5836
      age3        |      0.02482         0.35        1         0.5558
      0b.male     |            .            .        1             .
      1.male      |     -0.04907         1.97        1         0.1604
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.05026         2.13        1         0.1447
      3.obese4cat |      0.01876         0.30        1         0.5836
      4.obese4cat |     -0.07641         5.75        1         0.0165
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.05256         2.06        1         0.1510
      3.smoke_no~s|     -0.03327         0.89        1         0.3455
      1b.imd      |            .            .        1             .
      2.imd       |      0.00599         0.03        1         0.8744
      3.imd       |      0.00699         0.03        1         0.8572
      4.imd       |      0.02549         0.46        1         0.4979
      5.imd       |      0.01675         0.21        1         0.6465
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.04741         1.63        1         0.2024
      3.tot_adul~h|      0.05011         1.84        1         0.1752
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.04150         1.28        1         0.2588
      3.ethnicity |     -0.08759         5.25        1         0.0219
      4.ethnicity |     -0.02699         0.55        1         0.4586
      5.ethnicity |     -0.03464         0.79        1         0.3736
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.03192         1.02        1         0.3135
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.02075         0.41        1         0.5232
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.02591         0.51        1         0.4748
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.04965         2.08        1         0.1495
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01004         0.07        1         0.7861
      3.diabcat   |     -0.01384         0.15        1         0.7025
      4.diabcat   |      0.06693         3.77        1         0.0523
      5.diabcat   |     -0.00001         0.00        1         0.9997
      6.diabcat   |      0.00809         0.06        1         0.8113
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.04456         1.40        1         0.2374
      3.cancer_e~t|      0.02190         0.40        1         0.5246
      4.cancer_e~t|      0.01728         0.23        1         0.6307
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.02059         0.32        1         0.5707
      3.cancer_h~t|      0.07535         4.88        1         0.0272
      4.cancer_h~t|     -0.05278         2.15        1         0.1425
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.02956         0.88        1         0.3477
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00796         0.05        1         0.8252
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00505         0.02        1         0.8850
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01069         0.09        1         0.7602
      3.reduced_~t|     -0.04967         3.99        1         0.0457
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.08738        12.72        1         0.0004
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.03447         1.29        1         0.2560
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.03938         1.19        1         0.2748
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.02696         0.55        1         0.4588
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.11107         9.43        1         0.0021
      ------------+---------------------------------------------------
      global test |                     68.08       47         0.0238
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   3928.51 /        1 =    3928.5130
   1:   1719.46 /        1 =    1719.4620

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,849,103             Number of obs    =   1,849,103
No. of failures      =           28
Time at risk         =    198739361
                                                Wald chi2(41)    =    61856.97
Log pseudolikelihood =   -223.30912             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,058,848 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9190319   .3916995    -0.20   0.843     .3986034    2.118947
3 childre..  |   1.100666   .7329311     0.14   0.885     .2984298    4.059465
4+ childr..  |   1.741699   1.974265     0.49   0.624     .1888479    16.06328
             |
        age1 |   1.089156   .2638563     0.35   0.724     .6774543    1.751056
        age2 |   1.099131   .5312484     0.20   0.845     .4262204    2.834424
        age3 |   .7660999    .866853    -0.24   0.814     .0833947    7.037723
      1.male |   4.555406   2.314404     2.98   0.003      1.68294    12.33064
             |
   obese4cat |
Obese I ..)  |   2.504897   1.210505     1.90   0.057     .9714985    6.458589
Obese II..)  |   3.961103   2.348155     2.32   0.020     1.239427    12.65934
Obese II..)  |   1.13e-18   4.82e-19   -96.44   0.000     4.86e-19    2.61e-18
             |
smoke_nomiss |
     Former  |   .6649636    .322344    -0.84   0.400     .2571427    1.719577
    Current  |   .5155355   .3170473    -1.08   0.281     .1544476    1.720822
             |
         imd |
          2  |   2.07e+09   1.51e+09    29.36   0.000     4.95e+08    8.67e+09
          3  |   1.19e+09          .        .       .            .           .
          4  |   1.68e+09   1.14e+09    31.34   0.000     4.46e+08    6.35e+09
5 most de..  |   3.26e+09   2.05e+09    34.81   0.000     9.50e+08    1.12e+10
             |
tot_adults~h |
          2  |   .4404841   .2889489    -1.25   0.211     .1217752    1.593315
          3  |   .3913398   .2912803    -1.26   0.208     .0909895    1.683126
             |
   ethnicity |
      Mixed  |   8.64e-19   3.53e-19  -101.90   0.000     3.88e-19    1.92e-18
Asian or ..  |   2.594256   1.082741     2.28   0.022     1.144866    5.878562
      Black  |    .565114    .691114    -0.47   0.641     .0514218    6.210474
      Other  |   7.99e-19   3.26e-19  -102.06   0.000     3.59e-19    1.78e-18
             |
1.htdiag_o~p |   .6041231   .2749901    -1.11   0.268     .2475529     1.47429
1.~y_disease |   5.437472   2.575525     3.57   0.000     2.148894    13.75875
    1.asthma |   1.413549   .6495234     0.75   0.451     .5743615    3.478857
1.~c_disease |    1.75809   .8555526     1.16   0.246     .6773518    4.563181
             |
     diabcat |
T1DM, con..  |   2.14e-18          .        .       .            .           .
T1DM, unc..  |   6.09e-19          .        .       .            .           .
T2DM, con..  |     2.3754   1.434684     1.43   0.152     .7271629    7.759645
T2DM, unc..  |   4.895888   3.095896     2.51   0.012     1.417677    16.90774
Diabetes,..  |   3.65e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.71e-18   5.84e-19  -120.12   0.000     8.79e-19    3.34e-18
2-5 years..  |   2.61e-18   7.22e-19  -146.21   0.000     1.52e-18    4.49e-18
   5+ years  |   6.46e-19   2.65e-19  -101.96   0.000     2.89e-19    1.45e-18
             |
cancer_hae~t |
  Last year  |   9.68e-18          .        .       .            .           .
2-5 years..  |   41.24753   27.98365     5.48   0.000     10.91228    155.9123
   5+ years  |   15.04611   14.48976     2.82   0.005      2.27875    99.34626
             |
1.~r_disease |   1.50e-18   6.17e-19   -99.74   0.000     6.69e-19    3.36e-18
1.stroke_d~a |   .9762604    .818933    -0.03   0.977     .1885983    5.053514
1.other_ne~o |   6.42e-19   3.07e-19   -87.68   0.000     2.52e-19    1.64e-18
             |
reduced_ki~t |
Stage 3a/..  |   5.109215   2.518092     3.31   0.001      1.94463    13.42368
Stage 4/5..  |   19.00848   22.52034     2.49   0.013     1.864164    193.8254
             |
      1.esrd |   1.14e-18   1.16e-18   -40.52   0.000     1.55e-19    8.43e-18
1.other_tr~t |   2.58e-17   2.83e-17   -34.81   0.000     3.00e-18    2.22e-16
  1.asplenia |   1.70e-18          .        .       .            .           .
1.ra_sle_p~s |   4.42e-19   1.07e-19  -174.19   0.000     2.75e-19    7.12e-19
1.other_im~o |   11.07968   12.70827     2.10   0.036     1.170062     104.917
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAIN
> FULLYADJMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYAD
> JMODEL_ageband_0W2.ster saved
(533,406 observations deleted)
   1:   3043.63 /        1 =    3043.6300

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,733,513             Number of obs    =   8,733,513
No. of failures      =          568
Time at risk         =    937626051
                                                Wald chi2(47)    =     2827.58
Log pseudolikelihood =    -6423.366             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,502,867 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5473797   .1131054    -2.92   0.004     .3650938    .8206784
 only 12-18  |   .9691441   .1587294    -0.19   0.848     .7030334    1.335982
      mixed  |      .8352   .1909391    -0.79   0.431     .5335722    1.307338
             |
        age1 |   1.071902   .0553071     1.35   0.178     .9688034    1.185973
        age2 |    1.13045   .1292038     1.07   0.283     .9035741     1.41429
        age3 |    .667262   .1877784    -1.44   0.151     .3843744    1.158346
      1.male |   1.944457   .1806145     7.16   0.000     1.620813    2.332726
             |
   obese4cat |
Obese I ..)  |   1.570133   .1699722     4.17   0.000     1.269963    1.941252
Obese II..)  |   1.994411   .2712993     5.07   0.000     1.527657    2.603775
Obese II..)  |   2.826272   .4394934     6.68   0.000      2.08377    3.833348
             |
smoke_nomiss |
     Former  |   1.271496   .1246332     2.45   0.014     1.049251    1.540815
    Current  |   .6235942    .088893    -3.31   0.001     .4715891    .8245944
             |
         imd |
          2  |   1.331927   .2477476     1.54   0.123     .9250197    1.917828
          3  |   1.548674   .2795989     2.42   0.015     1.087135    2.206159
          4  |   2.113086    .357477     4.42   0.000      1.51676    2.943862
5 most de..  |   3.042716   .5057539     6.69   0.000     2.196729    4.214503
             |
tot_adults~h |
          2  |   .8247003   .0923175    -1.72   0.085     .6622349    1.027023
          3  |   1.026662   .1148995     0.24   0.814     .8244507    1.278469
             |
   ethnicity |
      Mixed  |   1.216232   .5037035     0.47   0.636     .5401208    2.738686
Asian or ..  |   2.373627   .3226291     6.36   0.000     1.818508    3.098203
      Black  |   .9187193   .2405694    -0.32   0.746     .5499119    1.534873
      Other  |   .5884073   .2952158    -1.06   0.290     .2200964    1.573052
             |
1.htdiag_o~p |   1.129213   .1124215     1.22   0.222      .929036    1.372522
1.~y_disease |   3.155311   .3904191     9.29   0.000     2.475824    4.021284
    1.asthma |    1.17606   .1232462     1.55   0.122      .957695    1.444215
1.~c_disease |   1.616062   .1885115     4.11   0.000      1.28578    2.031185
             |
     diabcat |
T1DM, con..  |   2.274191   1.333728     1.40   0.161     .7204916    7.178354
T1DM, unc..  |   1.894652   .7887366     1.54   0.125     .8378716    4.284316
T2DM, con..  |   1.888666   .2397381     5.01   0.000     1.472678    2.422158
T2DM, unc..  |   2.301836   .3071295     6.25   0.000     1.772149    2.989844
Diabetes,..  |   4.302517   3.073724     2.04   0.041     1.060774    17.45108
             |
cancer_exh~t |
  Last year  |   6.224169   1.565285     7.27   0.000     3.802043    10.18933
2-5 years..  |   2.701293    .600081     4.47   0.000     1.747756    4.175059
   5+ years  |   1.605163   .3633946     2.09   0.037     1.029947    2.501633
             |
cancer_hae~t |
  Last year  |   7.171946   4.271852     3.31   0.001     2.231684    23.04842
2-5 years..  |   6.600818   2.393951     5.20   0.000     3.242562    13.43715
   5+ years  |   4.612071   1.396555     5.05   0.000     2.547701    8.349174
             |
1.~r_disease |   2.758968   .5600954     5.00   0.000     1.853298    4.107223
1.stroke_d~a |   1.520317   .2823204     2.26   0.024     1.056495    2.187766
1.other_ne~o |   2.898268   .6525877     4.73   0.000     1.864138    4.506082
             |
reduced_ki~t |
Stage 3a/..  |   1.895462   .3106904     3.90   0.000     1.374651    2.613593
Stage 4/5..  |   3.611434   1.331409     3.48   0.000     1.753361    7.438543
             |
      1.esrd |   2.734319    1.10762     2.48   0.013     1.236072    6.048596
1.other_tr~t |   1.751316   1.148166     0.85   0.393     .4845241    6.330147
  1.asplenia |   .8836913   .6423757    -0.17   0.865     .2125898     3.67332
1.ra_sle_p~s |    1.45238    .201936     2.68   0.007     1.105938    1.907346
1.other_im~o |   2.920582   1.011626     3.09   0.002     1.481262     5.75847
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_plus_eth_12mo_ageband_0W2.ster not fo
> und)
file ./output/an_sense_covid_death_plus_eth_12mo_ageband_0W2.ster saved
   1:   1190.77 /        1 =    1190.7730

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,706,505             Number of obs    =   2,706,505
No. of failures      =        4,108
Time at risk         =    290301479
                                                Wald chi2(47)    =     9864.78
Log pseudolikelihood =   -44630.305             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,109,802 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.094293   .1365035     0.72   0.470     .8569463    1.397377
 only 12-18  |   1.136009   .1602833     0.90   0.366     .8615543    1.497892
      mixed  |   1.440496   .2298264     2.29   0.022     1.053672     1.96933
             |
        age1 |   1.061926   .0243568     2.62   0.009     1.015245    1.110754
        age2 |   1.218151   .1270233     1.89   0.058     .9929827    1.494379
        age3 |   .6637122   .1406689    -1.93   0.053     .4381007    1.005508
      1.male |    1.67183   .0572588    15.01   0.000     1.563289    1.787908
             |
   obese4cat |
Obese I ..)  |   1.159994   .0473779     3.63   0.000     1.070755    1.256671
Obese II..)  |   1.443111   .0885577     5.98   0.000     1.279573     1.62755
Obese II..)  |   2.234073   .1815434     9.89   0.000     1.905143    2.619793
             |
smoke_nomiss |
     Former  |   1.308099   .0492205     7.14   0.000       1.2151    1.408216
    Current  |   1.152126   .0805303     2.03   0.043     1.004623    1.321285
             |
         imd |
          2  |   1.048314   .0569902     0.87   0.385     .9423603    1.166181
          3  |   1.190362    .064323     3.22   0.001     1.070738    1.323351
          4  |   1.482265   .0770809     7.57   0.000     1.338633    1.641308
5 most de..  |   1.706698   .0904723    10.08   0.000     1.538276    1.893559
             |
tot_adults~h |
          2  |   .8536819   .0307823    -4.39   0.000     .7954323    .9161972
          3  |   .9740114   .0530393    -0.48   0.629     .8754115    1.083717
             |
   ethnicity |
      Mixed  |   1.400245   .3244285     1.45   0.146     .8891714     2.20507
Asian or ..  |   1.940902   .1345033     9.57   0.000       1.6944    2.223266
      Black  |   .9542863   .1350072    -0.33   0.741     .7231949    1.259221
      Other  |   1.001887   .2060894     0.01   0.993     .6694615    1.499381
             |
1.htdiag_o~p |   .9698777   .0385658    -0.77   0.442     .8971605    1.048489
1.~y_disease |   1.982347   .0734174    18.48   0.000      1.84355    2.131594
    1.asthma |   1.013709   .0446087     0.31   0.757     .9299416    1.105021
1.~c_disease |   1.591313   .0539772    13.70   0.000      1.48896    1.700702
             |
     diabcat |
T1DM, con..  |   2.024873   .5899462     2.42   0.015     1.143933    3.584224
T1DM, unc..  |   2.269034   .4429618     4.20   0.000     1.547637    3.326694
T2DM, con..  |   1.330025   .0543879     6.97   0.000     1.227586    1.441011
T2DM, unc..  |   1.843715   .0919193    12.27   0.000     1.672079     2.03297
Diabetes,..  |   1.627384   .7295312     1.09   0.277     .6759417    3.918056
             |
cancer_exh~t |
  Last year  |   1.907367   .2071353     5.95   0.000     1.541686    2.359786
2-5 years..  |   1.355201   .0989147     4.16   0.000      1.17456    1.563623
   5+ years  |   1.113786   .0544497     2.20   0.027     1.012019    1.225785
             |
cancer_hae~t |
  Last year  |   1.661682   .5263286     1.60   0.109     .8931707    3.091443
2-5 years..  |   2.133791   .3301195     4.90   0.000     1.575658    2.889625
   5+ years  |   1.884743    .214533     5.57   0.000     1.507868    2.355815
             |
1.~r_disease |   2.079903   .2264835     6.73   0.000     1.680175    2.574729
1.stroke_d~a |   1.613701   .0666896    11.58   0.000     1.488145     1.74985
1.other_ne~o |   2.199558   .1596959    10.86   0.000      1.90781    2.535921
             |
reduced_ki~t |
Stage 3a/..  |   1.405382   .0517096     9.25   0.000     1.307602    1.510475
Stage 4/5..  |   2.864106    .178695    16.87   0.000     2.534437    3.236656
             |
      1.esrd |   1.632341   .2639777     3.03   0.002     1.188932    2.241119
1.other_tr~t |   1.685274   .8488653     1.04   0.300     .6279482    4.522901
  1.asplenia |   1.281453   .3332546     0.95   0.340     .7697311    2.133369
1.ra_sle_p~s |   1.217402   .0641052     3.74   0.000     1.098024    1.349758
1.other_im~o |     1.7796   .4497686     2.28   0.023     1.084409    2.920461
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLY
> ADJMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_MAINFULLYADJMODE
> L_ageband_1W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00941         0.35        1         0.5523
      2.kids_cat4 |     -0.01634         1.18        1         0.2780
      3.kids_cat4 |     -0.00318         0.04        1         0.8337
      age1        |     -0.01728         1.27        1         0.2597
      age2        |      0.02024         1.77        1         0.1838
      age3        |     -0.01930         1.61        1         0.2045
      0b.male     |            .            .        1             .
      1.male      |     -0.00917         0.39        1         0.5347
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.03180         4.16        1         0.0414
      3.obese4cat |     -0.01547         1.03        1         0.3110
      4.obese4cat |     -0.00848         0.31        1         0.5804
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00882         0.33        1         0.5651
      3.smoke_no~s|      0.02685         3.24        1         0.0718
      1b.imd      |            .            .        1             .
      2.imd       |      0.00196         0.02        1         0.8979
      3.imd       |     -0.00521         0.11        1         0.7347
      4.imd       |     -0.00649         0.18        1         0.6747
      5.imd       |     -0.02094         1.94        1         0.1637
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00800         0.28        1         0.5961
      3.tot_adul~h|     -0.01254         0.69        1         0.4061
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.01203         0.61        1         0.4331
      3.ethnicity |     -0.08469        26.62        1         0.0000
      4.ethnicity |      0.00453         0.09        1         0.7676
      5.ethnicity |     -0.01483         0.91        1         0.3406
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.00763         0.25        1         0.6173
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.03702         6.49        1         0.0108
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00712         0.22        1         0.6416
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00580         0.16        1         0.6925
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.03058         4.02        1         0.0451
      3.diabcat   |     -0.01281         0.70        1         0.4013
      4.diabcat   |      0.00539         0.13        1         0.7193
      5.diabcat   |      0.02033         1.87        1         0.1716
      6.diabcat   |     -0.00584         0.14        1         0.7055
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00213         0.02        1         0.8895
      3.cancer_e~t|      0.00796         0.27        1         0.6019
      4.cancer_e~t|      0.00227         0.02        1         0.8815
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00391         0.06        1         0.8000
      3.cancer_h~t|      0.01504         0.98        1         0.3226
      4.cancer_h~t|     -0.00949         0.39        1         0.5342
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.02816         3.51        1         0.0611
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.03057         4.53        1         0.0332
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00945         0.40        1         0.5280
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01674         1.32        1         0.2508
      3.reduced_~t|      0.00894         0.41        1         0.5227
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00392         0.07        1         0.7901
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.01686         1.21        1         0.2708
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01716         1.26        1         0.2616
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.01852         1.48        1         0.2241
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01075         0.50        1         0.4773
      ------------+---------------------------------------------------
      global test |                    100.50       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   2033.26 /        1 =    2033.2640
   1:     68.65 /        1 =      68.6470

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       44,335             Number of obs    =      44,335
No. of failures      =           72
Time at risk         =      4747854
                                                Wald chi2(47)    =    86339.54
Log pseudolikelihood =   -490.70277             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,383 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.750682   .4421831     2.22   0.027     1.067119    2.872114
3 childre..  |   .9192187   .4245007    -0.18   0.855     .3718167    2.272526
4+ childr..  |   2.079619   1.369027     1.11   0.266     .5723109    7.556757
             |
        age1 |   1.156746   .1502574     1.12   0.262     .8967467    1.492129
        age2 |   .8478412    .571321    -0.24   0.806     .2263232    3.176142
        age3 |   1.201347   1.719991     0.13   0.898     .0726085    19.87695
      1.male |   1.640204   .4852071     1.67   0.094     .9185319    2.928878
             |
   obese4cat |
Obese I ..)  |   1.079663   .3516019     0.24   0.814     .5702779    2.044041
Obese II..)  |   2.192141   .8782665     1.96   0.050     .9996322    4.807249
Obese II..)  |   2.013391   1.252871     1.12   0.261     .5946369    6.817176
             |
smoke_nomiss |
     Former  |   .9606941   .2954459    -0.13   0.896     .5257895    1.755328
    Current  |   .6970302   .3950614    -0.64   0.524     .2295141    2.116869
             |
         imd |
          2  |   1.665395   1.076873     0.79   0.430     .4689388    5.914507
          3  |   1.984649   1.223234     1.11   0.266     .5929905    6.642321
          4  |   2.014747   1.204238     1.17   0.241     .6243773    6.501205
5 most de..  |   3.054752   1.736859     1.96   0.050     1.002312    9.309983
             |
tot_adults~h |
          2  |   1.189203   1.277204     0.16   0.872      .144899     9.75993
          3  |   1.580179    1.61563     0.45   0.655      .213014    11.72207
             |
   ethnicity |
      Mixed  |   3.20e-17   1.01e-17  -120.15   0.000     1.72e-17    5.95e-17
Asian or ..  |   3.505293   1.146218     3.84   0.000     1.846649    6.653714
      Black  |   2.173092   1.480715     1.14   0.255     .5715856    8.261807
      Other  |   4.02e-17   1.09e-17  -139.05   0.000     2.36e-17    6.84e-17
             |
1.htdiag_o~p |   1.384323   .4653011     0.97   0.333     .7163579     2.67513
1.~y_disease |     1.5695   .5217998     1.36   0.175     .8180291    3.011299
    1.asthma |   1.078369    .358823     0.23   0.821     .5617375    2.070148
1.~c_disease |    1.44776   .3907852     1.37   0.170     .8529759    2.457289
             |
     diabcat |
T1DM, con..  |   2.39e-17   1.04e-17   -88.49   0.000     1.03e-17    5.59e-17
T1DM, unc..  |    3.75439   3.976642     1.25   0.212     .4709214    29.93163
T2DM, con..  |   1.317315   .3883909     0.93   0.350     .7391376    2.347761
T2DM, unc..  |   1.579456   .4933253     1.46   0.143     .8563361    2.913203
Diabetes,..  |   1.72e-17   6.55e-18  -101.55   0.000     8.18e-18    3.63e-17
             |
cancer_exh~t |
  Last year  |   1.78e-17   3.91e-18  -175.70   0.000     1.16e-17    2.74e-17
2-5 years..  |   1.817943   1.067488     1.02   0.309     .5751205    5.746479
   5+ years  |   1.964559   .8129073     1.63   0.103     .8730711    4.420592
             |
cancer_hae~t |
  Last year  |   1.94e-17   1.07e-17   -69.97   0.000     6.61e-18    5.71e-17
2-5 years..  |   3.524822     3.9062     1.14   0.256     .4016406    30.93406
   5+ years  |   4.173493   2.825155     2.11   0.035     1.107381    15.72903
             |
1.~r_disease |   1.641838   1.308977     0.62   0.534     .3441109    7.833611
1.stroke_d~a |   1.370763   .4655562     0.93   0.353     .7044763    2.667218
1.other_ne~o |   2.768643   1.388082     2.03   0.042     1.036359    7.396459
             |
reduced_ki~t |
Stage 3a/..  |   1.751001   .4931754     1.99   0.047      1.00819    3.041096
Stage 4/5..  |   1.769112   1.085641     0.93   0.353     .5313776    5.889893
             |
      1.esrd |    3.03786   2.653768     1.27   0.203     .5482617    16.83246
1.other_tr~t |   6.38e-18   5.09e-18   -49.63   0.000     1.34e-18    3.05e-17
  1.asplenia |    10.2037   8.716524     2.72   0.007      1.91257    54.43745
1.ra_sle_p~s |   .3858636   .2857592    -1.29   0.198     .0903772    1.647436
1.other_im~o |   1.72e-17   5.86e-18  -113.49   0.000     8.85e-18    3.36e-17
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAIN
> FULLYADJMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYAD
> JMODEL_ageband_1W2.ster saved
(55,013 observations deleted)
   1:   1172.65 /        1 =    1172.6490

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,651,492             Number of obs    =   2,651,492
No. of failures      =        4,016
Time at risk         =    284427435
                                                Wald chi2(47)    =     9653.84
Log pseudolikelihood =   -43545.946             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,067,442 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.102393   .1394324     0.77   0.441       .86035     1.41253
 only 12-18  |   1.151704   .1642955     0.99   0.322       .87079     1.52324
      mixed  |   1.459517   .2347875     2.35   0.019     1.064828    2.000502
             |
        age1 |   1.065367   .0247283     2.73   0.006     1.017986    1.114952
        age2 |   1.198397   .1263488     1.72   0.086     .9746691     1.47348
        age3 |   .6860298   .1470101    -1.76   0.079     .4507524    1.044114
      1.male |   1.674263   .0580245    14.87   0.000     1.564314     1.79194
             |
   obese4cat |
Obese I ..)  |   1.159918   .0478698     3.59   0.000     1.069789     1.25764
Obese II..)  |   1.442049   .0894425     5.90   0.000     1.276982    1.628454
Obese II..)  |   2.229143   .1833757     9.74   0.000     1.897212    2.619149
             |
smoke_nomiss |
     Former  |   1.312847     .04999     7.15   0.000     1.218435    1.414574
    Current  |   1.168334   .0823369     2.21   0.027     1.017606    1.341388
             |
         imd |
          2  |    1.03674   .0571092     0.66   0.512      .930639    1.154938
          3  |   1.183592   .0647588     3.08   0.002     1.063236    1.317573
          4  |   1.494723   .0784936     7.65   0.000      1.34853    1.656763
5 most de..  |   1.711611   .0916958    10.03   0.000     1.541005    1.901106
             |
tot_adults~h |
          2  |   .8610874   .0313591    -4.11   0.000     .8017669    .9247969
          3  |    .972384   .0535288    -0.51   0.611     .8729311    1.083167
             |
   ethnicity |
      Mixed  |   1.443818   .3346889     1.58   0.113     .9166364    2.274197
Asian or ..  |   1.971188   .1378533     9.70   0.000       1.7187    2.260768
      Black  |   .9605406   .1371492    -0.28   0.778     .7260696     1.27073
      Other  |   .9397424   .2015634    -0.29   0.772     .6172149    1.430808
             |
1.htdiag_o~p |   .9664049   .0388339    -0.85   0.395      .893212    1.045596
1.~y_disease |   1.972676   .0736869    18.19   0.000     1.833413    2.122518
    1.asthma |   1.021473   .0453243     0.48   0.632     .9363925    1.114284
1.~c_disease |   1.595191   .0547282    13.61   0.000     1.491453    1.706145
             |
     diabcat |
T1DM, con..  |    2.06813   .6026567     2.49   0.013     1.168251    3.661166
T1DM, unc..  |   2.327637   .4547647     4.32   0.000     1.587123    3.413655
T2DM, con..  |   1.343831   .0554052     7.17   0.000     1.239511    1.456932
T2DM, unc..  |   1.842777   .0931904    12.09   0.000     1.668888    2.034786
Diabetes,..  |   1.740529   .7805043     1.24   0.217     .7227323     4.19165
             |
cancer_exh~t |
  Last year  |   1.929833   .2108293     6.02   0.000     1.557859    2.390624
2-5 years..  |   1.352448   .1000002     4.08   0.000     1.169992    1.563359
   5+ years  |   1.118361   .0552454     2.26   0.024     1.015158    1.232055
             |
cancer_hae~t |
  Last year  |   1.716017   .5434235     1.71   0.088     .9224983     3.19211
2-5 years..  |   2.075107   .3288756     4.61   0.000     1.521027    2.831028
   5+ years  |   1.917753   .2184506     5.72   0.000     1.534025    2.397467
             |
1.~r_disease |   2.099866    .230205     6.77   0.000     1.693853      2.6032
1.stroke_d~a |   1.597721   .0670248    11.17   0.000      1.47161    1.734638
1.other_ne~o |   2.233665   .1634017    10.99   0.000     1.935304    2.578024
             |
reduced_ki~t |
Stage 3a/..  |   1.405643   .0523452     9.14   0.000     1.306703    1.512075
Stage 4/5..  |   2.882803   .1817027    16.80   0.000     2.547791    3.261866
             |
      1.esrd |   1.645226   .2665183     3.07   0.002     1.197665    2.260039
1.other_tr~t |   1.718674   .8659127     1.07   0.282     .6402302    4.613717
  1.asplenia |   1.306765   .3399979     1.03   0.304      .784747    2.176034
1.ra_sle_p~s |   1.219862   .0648806     3.74   0.000     1.099102     1.35389
1.other_im~o |   1.830839   .4629789     2.39   0.017     1.115322    3.005387
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_plus_eth_12mo_ageband_1W2.ster not fo
> und)
file ./output/an_sense_covid_death_plus_eth_12mo_ageband_1W2.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_deathW2.log
  log type:  text
 closed on:  24 Jan 2021, 14:43:46
-------------------------------------------------------------------------------
