-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_tpp_probMAIN.
> log
  log type:  text
 opened on:  24 Jan 2021, 10:21:34

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   9576.25 /        1 =    9576.2490

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,334,392             Number of obs    =   9,334,392
No. of failures      =       51,560
Time at risk         =   1958675680
                                                Wald chi2(47)    =    17325.61
Log pseudolikelihood =   -658591.72             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,833,113 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .981793   .0133954    -1.35   0.178     .9558864    1.008402
 only 12-18  |   1.048799   .0177244     2.82   0.005     1.014629     1.08412
      mixed  |   1.009942   .0189176     0.53   0.597     .9735368    1.047709
             |
        age1 |   1.009048   .0017746     5.12   0.000     1.005575    1.012532
        age2 |   1.000907    .005383     0.17   0.866     .9904122    1.011513
        age3 |   .9552162   .0148371    -2.95   0.003     .9265742    .9847434
      1.male |   .7236621   .0063246   -37.01   0.000     .7113716    .7361649
             |
   obese4cat |
Obese I ..)  |   1.266355   .0155064    19.29   0.000     1.236325    1.297115
Obese II..)  |   1.364169   .0233456    18.15   0.000     1.319171    1.410701
Obese II..)  |   1.534733   .0326029    20.16   0.000     1.472145    1.599982
             |
smoke_nomiss |
     Former  |   1.034129     .01094     3.17   0.002     1.012908    1.055795
    Current  |   .6201948   .0089766   -33.01   0.000     .6028482    .6380405
             |
         imd |
          2  |   1.096917   .0189635     5.35   0.000     1.060372    1.134721
          3  |      1.192   .0203908    10.27   0.000     1.152697    1.232643
          4  |   1.277612   .0213152    14.68   0.000     1.236511     1.32008
5 most de..  |   1.358439   .0233673    17.81   0.000     1.313403    1.405019
             |
tot_adults~h |
          2  |   1.063623   .0135087     4.86   0.000     1.037473    1.090432
          3  |   1.185295   .0153539    13.12   0.000     1.155581    1.215774
             |
   ethnicity |
      Mixed  |   1.552467     .05015    13.62   0.000     1.457222    1.653937
Asian or ..  |   2.612454   .0378482    66.28   0.000     2.539316    2.687698
      Black  |   1.757233   .0391427    25.31   0.000     1.682165     1.83565
      Other  |   1.312305   .0366604     9.73   0.000     1.242384    1.386162
             |
1.htdiag_o~p |   1.132745    .012712    11.11   0.000     1.108102    1.157936
1.~y_disease |   1.514485   .0388896    16.16   0.000     1.440149    1.592658
    1.asthma |   1.109902   .0129174     8.96   0.000     1.084871     1.13551
1.~c_disease |   1.283504   .0282032    11.36   0.000     1.229401    1.339989
             |
     diabcat |
T1DM, con..  |   1.058756   .1173201     0.52   0.606     .8520687    1.315579
T1DM, unc..  |   1.437587   .0818755     6.37   0.000     1.285747     1.60736
T2DM, con..  |   1.236732   .0282012     9.32   0.000     1.182676     1.29326
T2DM, unc..  |   1.513216   .0352708    17.77   0.000     1.445642    1.583949
Diabetes,..  |   1.252355   .2013863     1.40   0.162     .9137954     1.71635
             |
cancer_exh~t |
  Last year  |   1.598481   .1116191     6.72   0.000     1.394022    1.832928
2-5 years..  |   1.115191   .0541805     2.24   0.025     1.013899    1.226603
   5+ years  |   1.070045   .0408114     1.78   0.076     .9929731      1.1531
             |
cancer_hae~t |
  Last year  |   3.086075   .4605294     7.55   0.000     2.303474    4.134564
2-5 years..  |   2.273925   .2257942     8.27   0.000     1.871778    2.762473
   5+ years  |   1.197868   .1020677     2.12   0.034     1.013631    1.415591
             |
1.~r_disease |   1.605306   .0695779    10.92   0.000     1.474568    1.747636
1.stroke_d~a |   1.409039   .0529798     9.12   0.000     1.308934    1.516799
1.other_ne~o |   1.209867   .0563927     4.09   0.000     1.104238    1.325601
             |
reduced_ki~t |
Stage 3a/..  |   1.237177    .044169     5.96   0.000     1.153566    1.326847
Stage 4/5..  |    2.57037   .1870712    12.97   0.000     2.228667    2.964462
             |
      1.esrd |   2.327241    .167258    11.75   0.000     2.021463    2.679273
1.other_tr~t |   .9666361   .1661847    -0.20   0.844     .6901189    1.353949
  1.asplenia |   1.629927   .1590817     5.01   0.000      1.34614    1.973539
1.ra_sle_p~s |   1.064754   .0216326     3.09   0.002     1.023187    1.108008
1.other_im~o |   1.573983   .0844124     8.46   0.000     1.416936    1.748436
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFU
> LLYADJMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFULLYADJM
> ODEL_ageband_0MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.03222        66.00        1         0.0000
      2.kids_cat4 |      0.01218         9.67        1         0.0019
      3.kids_cat4 |      0.02298        34.54        1         0.0000
      age1        |     -0.05478       136.92        1         0.0000
      age2        |      0.01329         8.82        1         0.0030
      age3        |     -0.00219         0.25        1         0.6191
      0b.male     |            .            .        1             .
      1.male      |      0.01725        14.82        1         0.0001
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02363        29.91        1         0.0000
      3.obese4cat |     -0.02387        30.79        1         0.0000
      4.obese4cat |     -0.02338        29.82        1         0.0000
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00032         0.01        1         0.9408
      3.smoke_no~s|      0.03256        59.30        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.01140         7.91        1         0.0049
      3.imd       |      0.03273        66.82        1         0.0000
      4.imd       |      0.04643       135.01        1         0.0000
      5.imd       |      0.06447       269.30        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.00066         0.02        1         0.8756
      3.tot_adul~h|      0.03937        89.22        1         0.0000
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00502         1.38        1         0.2399
      3.ethnicity |      0.11812       952.87        1         0.0000
      4.ethnicity |     -0.02684        41.57        1         0.0000
      5.ethnicity |     -0.02786        44.74        1         0.0000
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01152         7.22        1         0.0072
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01187         7.41        1         0.0065
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.02797        42.04        1         0.0000
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.01587        13.02        1         0.0003
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00745         2.87        1         0.0902
      3.diabcat   |     -0.00305         0.48        1         0.4892
      4.diabcat   |     -0.01048         5.97        1         0.0145
      5.diabcat   |     -0.02153        25.00        1         0.0000
      6.diabcat   |     -0.01200         7.52        1         0.0061
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.00393         0.81        1         0.3667
      3.cancer_e~t|     -0.00279         0.41        1         0.5239
      4.cancer_e~t|     -0.00319         0.53        1         0.4662
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00809         3.47        1         0.0625
      3.cancer_h~t|     -0.01114         6.51        1         0.0107
      4.cancer_h~t|     -0.00819         3.54        1         0.0600
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00497         1.31        1         0.2522
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01077         6.14        1         0.0132
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01164         7.31        1         0.0069
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01032         5.55        1         0.0185
      3.reduced_~t|     -0.02154        24.64        1         0.0000
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.02052        23.07        1         0.0000
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00234         0.30        1         0.5815
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00444         1.05        1         0.3063
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00351         0.64        1         0.4221
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00639         2.15        1         0.1426
      ------------+---------------------------------------------------
      global test |                   4050.93       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:  18801.14 /        1 =   18801.1390
   1:   1870.33 /        1 =    1870.3300

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,918,698             Number of obs    =   1,918,698
No. of failures      =       10,883
Time at risk         =    403333037
                                                Wald chi2(47)    =     3418.61
Log pseudolikelihood =    -122050.5             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,098,510 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9899342   .0231779    -0.43   0.666      .945533     1.03642
3 childre..  |   .9499379   .0359951    -1.36   0.175     .8819449    1.023173
4+ childr..  |   .7590058   .0570743    -3.67   0.000      .654995     .879533
             |
        age1 |   1.005153    .004094     1.26   0.207     .9971604    1.013209
        age2 |   .9795461   .0124547    -1.63   0.104     .9554369    1.004264
        age3 |   1.068017   .0412943     1.70   0.089     .9900721    1.152098
      1.male |   .8206238   .0158119   -10.26   0.000      .790211    .8522071
             |
   obese4cat |
Obese I ..)  |   1.248037   .0336495     8.22   0.000     1.183798    1.315763
Obese II..)  |   1.400258   .0546427     8.63   0.000     1.297153    1.511558
Obese II..)  |   1.580183   .0780746     9.26   0.000     1.434336    1.740861
             |
smoke_nomiss |
     Former  |   1.032395   .0238152     1.38   0.167     .9867579    1.080143
    Current  |   .6177851   .0200277   -14.86   0.000     .5797526    .6583126
             |
         imd |
          2  |   1.106338   .0428422     2.61   0.009     1.025476    1.193576
          3  |   1.169991    .045095     4.07   0.000     1.084862    1.261799
          4  |   1.253766   .0468078     6.06   0.000       1.1653    1.348947
5 most de..  |   1.371829   .0525938     8.25   0.000     1.272525    1.478883
             |
tot_adults~h |
          2  |    1.03669   .0314069     1.19   0.234     .9769261    1.100111
          3  |   1.141993   .0388223     3.91   0.000     1.068382    1.220676
             |
   ethnicity |
      Mixed  |   1.619469   .1084587     7.20   0.000     1.420254    1.846627
Asian or ..  |   2.859067   .0836539    35.90   0.000     2.699721    3.027818
      Black  |   1.996698   .0934909    14.77   0.000     1.821616    2.188608
      Other  |   1.439006   .0827141     6.33   0.000     1.285688    1.610607
             |
1.htdiag_o~p |   1.177197   .0316266     6.07   0.000     1.116814    1.240845
1.~y_disease |   1.424166   .1230388     4.09   0.000     1.202326    1.686937
    1.asthma |   1.066992   .0278229     2.49   0.013      1.01383    1.122942
1.~c_disease |   1.231054   .0815166     3.14   0.002     1.081218    1.401655
             |
     diabcat |
T1DM, con..  |    1.24883   .3027381     0.92   0.359     .7765281    2.008396
T1DM, unc..  |   1.277759   .1957798     1.60   0.110     .9462956    1.725326
T2DM, con..  |   1.296567   .0799415     4.21   0.000     1.148982     1.46311
T2DM, unc..  |   1.547533    .098996     6.83   0.000     1.365175     1.75425
Diabetes,..  |   1.764123   .5367069     1.87   0.062     .9717715    3.202533
             |
cancer_exh~t |
  Last year  |   1.625331   .3406254     2.32   0.020     1.077837    2.450929
2-5 years..  |   1.106776   .1642994     0.68   0.494     .8273709    1.480538
   5+ years  |   .9488477   .1280254    -0.39   0.697     .7283602    1.236081
             |
cancer_hae~t |
  Last year  |   2.911115   1.197809     2.60   0.009     1.299641    6.520714
2-5 years..  |   2.686127   .6825645     3.89   0.000     1.632412    4.420008
   5+ years  |   1.395278   .2992143     1.55   0.120     .9164788    2.124218
             |
1.~r_disease |   1.452143    .176434     3.07   0.002      1.14443    1.842594
1.stroke_d~a |   1.354218   .1646542     2.49   0.013     1.067073    1.718632
1.other_ne~o |   1.292582   .1698506     1.95   0.051     .9990944    1.672281
             |
reduced_ki~t |
Stage 3a/..  |   .8735342   .1238308    -0.95   0.340     .6616296    1.153307
Stage 4/5..  |   1.664607   .4101155     2.07   0.039     1.027065    2.697898
             |
      1.esrd |   2.451262   .5533092     3.97   0.000     1.574899    3.815281
1.other_tr~t |   1.450618   .6919507     0.78   0.435      .569543    3.694704
  1.asplenia |   1.387431   .4020663     1.13   0.258      .786213    2.448402
1.ra_sle_p~s |   1.007845   .0498208     0.16   0.874      .914779    1.110379
1.other_im~o |   1.634522   .2085489     3.85   0.000     1.272875    2.098919
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_M
> AINFULLYADJMODEL_ageband_0MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULL
> YADJMODEL_ageband_0MAIN.ster saved
(748,903 observations deleted)
   1:   8751.05 /        1 =    8751.0510

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,585,489             Number of obs    =   8,585,489
No. of failures      =       47,321
Time at risk         =   1802468630
                                                Wald chi2(47)    =    16046.87
Log pseudolikelihood =   -600723.08             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,442,130 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.012962   .0143933     0.91   0.365     .9851408    1.041569
 only 12-18  |   1.070017   .0185405     3.91   0.000     1.034289     1.10698
      mixed  |   1.040606   .0200826     2.06   0.039      1.00198    1.080721
             |
        age1 |   1.006176   .0018967     3.27   0.001     1.002465      1.0099
        age2 |    1.01086   .0057521     1.90   0.058     .9996492    1.022197
        age3 |   .9310742   .0152083    -4.37   0.000     .9017385    .9613643
      1.male |   .7211378   .0065769   -35.85   0.000     .7083618    .7341443
             |
   obese4cat |
Obese I ..)  |   1.269844   .0161385    18.80   0.000     1.238604    1.301872
Obese II..)  |   1.361486   .0241522    17.39   0.000     1.314962    1.409656
Obese II..)  |   1.531115   .0336544    19.38   0.000     1.466554    1.598518
             |
smoke_nomiss |
     Former  |   1.038813   .0114352     3.46   0.001     1.016641    1.061469
    Current  |   .6219873   .0094288   -31.32   0.000      .603779    .6407448
             |
         imd |
          2  |   1.103746   .0199484     5.46   0.000     1.065332    1.143545
          3  |   1.210989   .0216073    10.73   0.000     1.169372    1.254088
          4  |   1.289737   .0224685    14.61   0.000     1.246443    1.334535
5 most de..  |   1.390126   .0248952    18.39   0.000     1.342179    1.439787
             |
tot_adults~h |
          2  |   1.070028   .0143272     5.06   0.000     1.042313    1.098481
          3  |    1.19546   .0163077    13.09   0.000     1.163921    1.227854
             |
   ethnicity |
      Mixed  |   1.574935   .0537662    13.30   0.000     1.473003     1.68392
Asian or ..  |   2.583906   .0391324    62.68   0.000     2.508335    2.661753
      Black  |   1.728375   .0407788    23.19   0.000      1.65027    1.810176
      Other  |   1.307563   .0391737     8.95   0.000     1.232994    1.386641
             |
1.htdiag_o~p |   1.135864   .0131696    10.99   0.000     1.110343    1.161972
1.~y_disease |   1.505749   .0397938    15.49   0.000      1.42974    1.585798
    1.asthma |   1.114237   .0134591     8.95   0.000     1.088167    1.140931
1.~c_disease |   1.281177     .02894    10.97   0.000     1.225693    1.339173
             |
     diabcat |
T1DM, con..  |   1.048373    .121495     0.41   0.684     .8353544    1.315712
T1DM, unc..  |   1.419958   .0847534     5.87   0.000     1.263193    1.596178
T2DM, con..  |   1.230561   .0288414     8.85   0.000     1.175312    1.288408
T2DM, unc..  |   1.519284    .036358    17.48   0.000     1.449669    1.592242
Diabetes,..  |   1.319825   .2241037     1.63   0.102     .9462027    1.840979
             |
cancer_exh~t |
  Last year  |   1.596962   .1154855     6.47   0.000     1.385923    1.840135
2-5 years..  |   1.126628   .0557243     2.41   0.016     1.022538    1.241315
   5+ years  |   1.082782   .0419352     2.05   0.040     1.003632    1.168173
             |
cancer_hae~t |
  Last year  |    3.17539   .4901625     7.49   0.000     2.346406    4.297255
2-5 years..  |   2.153741   .2262004     7.30   0.000     1.753051    2.646016
   5+ years  |   1.203385   .1052386     2.12   0.034     1.013831    1.428381
             |
1.~r_disease |   1.566156   .0712924     9.86   0.000     1.432478     1.71231
1.stroke_d~a |   1.405858   .0545248     8.78   0.000     1.302952    1.516892
1.other_ne~o |   1.216576   .0583572     4.09   0.000      1.10741    1.336503
             |
reduced_ki~t |
Stage 3a/..  |   1.216679   .0448671     5.32   0.000     1.131844    1.307873
Stage 4/5..  |   2.581966   .1928648    12.70   0.000     2.230327    2.989047
             |
      1.esrd |   2.255525   .1671947    10.97   0.000     1.950522    2.608222
1.other_tr~t |   .9383912   .1700729    -0.35   0.726     .6578293    1.338612
  1.asplenia |   1.654931   .1654839     5.04   0.000     1.360393    2.013239
1.ra_sle_p~s |   1.067787    .022335     3.14   0.002     1.024897    1.112473
1.other_im~o |   1.589139   .0887912     8.29   0.000     1.424302    1.773053
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_0MAIN.ster n
> ot found)
file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_0MAIN.ster saved
   1:   2208.81 /        1 =    2208.8120

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,684,524             Number of obs    =   2,684,524
No. of failures      =       18,893
Time at risk         =    560314456
                                                Wald chi2(47)    =    20254.87
Log pseudolikelihood =   -211711.82             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,091,789 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.04216      .0587     0.73   0.463     .9332336    1.163801
 only 12-18  |   .9218001   .0647208    -1.16   0.246     .8032907    1.057793
      mixed  |   1.174275   .0942635     2.00   0.045     1.003323    1.374355
             |
        age1 |   .9794501   .0080662    -2.52   0.012     .9637676    .9953878
        age2 |   1.296547   .0521986     6.45   0.000     1.198172    1.402999
        age3 |   .6328889   .0528895    -5.47   0.000     .5372717    .7455231
      1.male |    1.23779   .0188375    14.02   0.000     1.201415    1.275267
             |
   obese4cat |
Obese I ..)  |   1.055325   .0205199     2.77   0.006     1.015863    1.096319
Obese II..)  |   1.222351   .0359693     6.82   0.000     1.153847    1.294922
Obese II..)  |   1.439154   .0617299     8.49   0.000     1.323112    1.565374
             |
smoke_nomiss |
     Former  |   1.133129   .0190809     7.42   0.000     1.096341     1.17115
    Current  |   .8888761   .0285861    -3.66   0.000     .8345776    .9467072
             |
         imd |
          2  |   1.130474   .0278565     4.98   0.000     1.077173    1.186411
          3  |   1.202993   .0298361     7.45   0.000     1.145913    1.262915
          4  |   1.410073   .0349665    13.86   0.000     1.343179    1.480299
5 most de..  |   1.571246   .0415691    17.08   0.000     1.491848    1.654869
             |
tot_adults~h |
          2  |   .7915784   .0137757   -13.43   0.000     .7650338    .8190439
          3  |   .9864468   .0253624    -0.53   0.596     .9379692     1.03743
             |
   ethnicity |
      Mixed  |   1.090456   .1160733     0.81   0.416     .8851204    1.343427
Asian or ..  |   1.498776   .0506035    11.98   0.000     1.402805    1.601312
      Black  |   1.223121   .0666706     3.69   0.000     1.099187    1.361028
      Other  |   1.144399   .0856832     1.80   0.072     .9882038    1.325283
             |
1.htdiag_o~p |   .9813104   .0177474    -1.04   0.297     .9471355    1.016718
1.~y_disease |   1.757083   .0320292    30.92   0.000     1.695415    1.820994
    1.asthma |   1.133346   .0226404     6.27   0.000     1.089829    1.178601
1.~c_disease |   1.378388   .0226384    19.54   0.000     1.334724     1.42348
             |
     diabcat |
T1DM, con..  |   1.709532   .2461944     3.72   0.000      1.28912     2.26705
T1DM, unc..  |    2.29913   .2060278     9.29   0.000     1.928797    2.740569
T2DM, con..  |   1.363481   .0266351    15.87   0.000     1.312264    1.416697
T2DM, unc..  |   1.719778   .0425685    21.90   0.000     1.638337    1.805268
Diabetes,..  |   1.838431   .3345354     3.35   0.001     1.286934    2.626266
             |
cancer_exh~t |
  Last year  |    1.91484   .0948789    13.11   0.000     1.737625    2.110128
2-5 years..  |   1.188172   .0432544     4.74   0.000     1.106348    1.276046
   5+ years  |   1.163863   .0265727     6.65   0.000     1.112929    1.217127
             |
cancer_hae~t |
  Last year  |   2.588668   .3068983     8.02   0.000     2.051931    3.265805
2-5 years..  |   2.097648   .1565508     9.93   0.000       1.8122    2.428058
   5+ years  |   1.601496   .0930022     8.11   0.000     1.429206    1.794555
             |
1.~r_disease |   1.774663   .0934804    10.89   0.000     1.600586    1.967673
1.stroke_d~a |   1.744562   .0349877    27.75   0.000     1.677317    1.814502
1.other_ne~o |   2.099668   .0725069    21.48   0.000     1.962259    2.246698
             |
reduced_ki~t |
Stage 3a/..  |   1.193963   .0211122    10.03   0.000     1.153292    1.236067
Stage 4/5..  |   1.899417   .0664487    18.34   0.000     1.773545    2.034223
             |
      1.esrd |   3.314683   .2031514    19.55   0.000     2.939499    3.737754
1.other_tr~t |   1.369174   .3032708     1.42   0.156      .886989    2.113484
  1.asplenia |   1.457351   .1667716     3.29   0.001     1.164547    1.823775
1.ra_sle_p~s |   1.260508   .0305932     9.54   0.000      1.20195    1.321918
1.other_im~o |   1.659625   .1949355     4.31   0.000     1.318347    2.089248
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFU
> LLYADJMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_MAINFULLYADJM
> ODEL_ageband_1MAIN.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.01477         4.60        1         0.0320
      2.kids_cat4 |      0.01625         5.40        1         0.0202
      3.kids_cat4 |      0.02735        15.27        1         0.0001
      age1        |     -0.02614        13.37        1         0.0003
      age2        |      0.01012         2.00        1         0.1574
      age3        |     -0.00685         0.91        1         0.3394
      0b.male     |            .            .        1             .
      1.male      |     -0.06456        79.29        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02870        15.63        1         0.0001
      3.obese4cat |     -0.01841         6.51        1         0.0107
      4.obese4cat |     -0.01714         5.72        1         0.0168
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00127         0.03        1         0.8605
      3.smoke_no~s|     -0.00110         0.02        1         0.8773
      1b.imd      |            .            .        1             .
      2.imd       |      0.01168         2.76        1         0.0965
      3.imd       |      0.00566         0.64        1         0.4225
      4.imd       |      0.02326        10.96        1         0.0009
      5.imd       |      0.03810        30.21        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.03260        22.18        1         0.0000
      3.tot_adul~h|      0.02415        13.72        1         0.0002
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00866         1.49        1         0.2222
      3.ethnicity |      0.08933       157.98        1         0.0000
      4.ethnicity |     -0.00859         1.50        1         0.2205
      5.ethnicity |      0.00276         0.15        1         0.6989
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00727         1.04        1         0.3089
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01892         7.14        1         0.0075
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00056         0.01        1         0.9376
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00095         0.02        1         0.8913
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00873         1.50        1         0.2214
      3.diabcat   |     -0.00124         0.03        1         0.8642
      4.diabcat   |      0.00164         0.05        1         0.8190
      5.diabcat   |     -0.01819         6.40        1         0.0114
      6.diabcat   |     -0.00577         0.65        1         0.4201
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00042         0.00        1         0.9535
      3.cancer_e~t|     -0.00172         0.06        1         0.8109
      4.cancer_e~t|     -0.01010         1.96        1         0.1615
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00207         0.08        1         0.7710
      3.cancer_h~t|     -0.01340         3.48        1         0.0622
      4.cancer_h~t|     -0.00040         0.00        1         0.9554
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.01003         1.95        1         0.1624
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00636         0.87        1         0.3501
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00213         0.09        1         0.7593
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.02875        17.18        1         0.0000
      3.reduced_~t|     -0.02712        15.06        1         0.0001
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01876         6.62        1         0.0101
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00846         1.37        1         0.2419
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00850         1.43        1         0.2314
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00180         0.06        1         0.8029
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00062         0.01        1         0.9298
      ------------+---------------------------------------------------
      global test |                    668.52       47         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   4154.20 /        1 =    4154.2000
   1:     72.65 /        1 =      72.6460

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       44,420             Number of obs    =      44,420
No. of failures      =          401
Time at risk         =      9243539
                                                Wald chi2(47)    =    97268.71
Log pseudolikelihood =   -2969.4813             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,511 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9175133   .1131746    -0.70   0.485     .7204723    1.168443
3 childre..  |   1.294125   .2164499     1.54   0.123     .9324122    1.796159
4+ childr..  |   1.094222    .381387     0.26   0.796     .5526142    2.166649
             |
        age1 |   .9194643   .0388746    -1.99   0.047      .846343    .9989031
        age2 |   1.579014   .3756336     1.92   0.055     .9905868    2.516978
        age3 |   .4162434   .2133473    -1.71   0.087     .1524265     1.13667
      1.male |   1.259597   .1324782     2.19   0.028     1.024959     1.54795
             |
   obese4cat |
Obese I ..)  |   1.379795   .1644202     2.70   0.007     1.092403    1.742794
Obese II..)  |   1.166177   .2311414     0.78   0.438     .7907742    1.719794
Obese II..)  |   1.393075   .3937019     1.17   0.241     .8005956    2.424016
             |
smoke_nomiss |
     Former  |   1.186013   .1444533     1.40   0.161     .9341475    1.505787
    Current  |   .9632463   .1983924    -0.18   0.856     .6433124    1.442291
             |
         imd |
          2  |   1.104209   .2438061     0.45   0.653     .7163224    1.702135
          3  |    1.04091   .2280778     0.18   0.855     .6774906    1.599275
          4  |   1.492883   .2929426     2.04   0.041     1.016244    2.193076
5 most de..  |   1.950518    .389001     3.35   0.001     1.319444    2.883428
             |
tot_adults~h |
          2  |   .7958546   .2593728    -0.70   0.484     .4201681    1.507455
          3  |   .9763603   .2898824    -0.08   0.936     .5456165     1.74716
             |
   ethnicity |
      Mixed  |   1.019744   .5015448     0.04   0.968     .3889031    2.673875
Asian or ..  |   1.608054   .2236224     3.42   0.001     1.224416    2.111894
      Black  |   .9783619   .2718992    -0.08   0.937      .567466    1.686783
      Other  |   1.037009   .3356709     0.11   0.911     .5498644    1.955731
             |
1.htdiag_o~p |   .8853785   .1070557    -1.01   0.314     .6985633    1.122153
1.~y_disease |   1.590541   .2195154     3.36   0.001     1.213579    2.084595
    1.asthma |   .9147373   .1279552    -0.64   0.524     .6953904    1.203273
1.~c_disease |   1.795884   .2102381     5.00   0.000     1.427681    2.259049
             |
     diabcat |
T1DM, con..  |   3.79e-16   9.04e-17  -148.86   0.000     2.38e-16    6.05e-16
T1DM, unc..  |   2.088249   1.258223     1.22   0.222     .6410792    6.802253
T2DM, con..  |   1.355744   .1755425     2.35   0.019     1.051874    1.747398
T2DM, unc..  |     1.4615    .218711     2.54   0.011     1.089979    1.959655
Diabetes,..  |   1.357495    1.39684     0.30   0.766     .1806616    10.20025
             |
cancer_exh~t |
  Last year  |    2.59607   .8335084     2.97   0.003     1.383646    4.870884
2-5 years..  |   .6154486   .2535584    -1.18   0.239     .2744768    1.379996
   5+ years  |   1.546632   .2780732     2.43   0.015     1.087295    2.200021
             |
cancer_hae~t |
  Last year  |   5.806273   4.037262     2.53   0.011      1.48605    22.68618
2-5 years..  |    1.49481   1.075907     0.56   0.576     .3646898    6.127004
   5+ years  |    1.37124   .7046858     0.61   0.539     .5008149    3.754477
             |
1.~r_disease |   1.554473   .5204337     1.32   0.188     .8064975    2.996149
1.stroke_d~a |   1.185505   .1937091     1.04   0.298     .8606349    1.633007
1.other_ne~o |    1.65602   .4552783     1.83   0.067     .9661632    2.838446
             |
reduced_ki~t |
Stage 3a/..  |    1.57074   .1972359     3.60   0.000     1.228061     2.00904
Stage 4/5..  |   2.653078   .6012949     4.31   0.000     1.701506    4.136822
             |
      1.esrd |   1.961469   .6832166     1.93   0.053     .9910415    3.882138
1.other_tr~t |   1.585402    1.48908     0.49   0.624     .2515665     9.99139
  1.asplenia |   3.22e-16   7.86e-17  -146.19   0.000     2.00e-16    5.20e-16
1.ra_sle_p~s |   1.514648   .2573559     2.44   0.015     1.085632      2.1132
1.other_im~o |   3.42e-16   6.22e-17  -195.82   0.000     2.39e-16    4.88e-16
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_M
> AINFULLYADJMODEL_ageband_1MAIN.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULL
> YADJMODEL_ageband_1MAIN.ster saved
(72,537 observations deleted)
   1:   2095.58 /        1 =    2095.5810

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,611,987             Number of obs    =   2,611,987
No. of failures      =       18,130
Time at risk         =    545298281
                                                Wald chi2(47)    =    19464.59
Log pseudolikelihood =   -202723.99             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,035,758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.068739   .0616392     1.15   0.249      .954507    1.196643
 only 12-18  |   .9298957   .0672852    -1.00   0.315     .8069436    1.071582
      mixed  |   1.188545   .0973655     2.11   0.035     1.012245    1.395552
             |
        age1 |   .9765536    .008202    -2.82   0.005     .9606095    .9927624
        age2 |   1.304985   .0536297     6.48   0.000     1.203994    1.414446
        age3 |   .6269955   .0534939    -5.47   0.000     .5304467    .7411176
      1.male |   1.240895   .0192552    13.91   0.000     1.203724    1.279215
             |
   obese4cat |
Obese I ..)  |   1.057997   .0209659     2.84   0.004     1.017692    1.099898
Obese II..)  |   1.225527   .0367616     6.78   0.000     1.155553    1.299739
Obese II..)  |   1.431952   .0628002     8.19   0.000     1.314007    1.560483
             |
smoke_nomiss |
     Former  |   1.136073   .0195114     7.43   0.000     1.098467    1.174965
    Current  |   .8812269    .029058    -3.83   0.000     .8260756    .9400602
             |
         imd |
          2  |   1.131615   .0283867     4.93   0.000     1.077324    1.188642
          3  |   1.189202   .0300932     6.85   0.000     1.131659    1.249671
          4  |   1.405942   .0354661    13.51   0.000     1.338121    1.477202
5 most de..  |   1.563512   .0420147    16.63   0.000     1.483296    1.648066
             |
tot_adults~h |
          2  |   .8004545   .0141861   -12.56   0.000     .7731276    .8287472
          3  |   .9728818   .0253072    -1.06   0.291     .9245237    1.023769
             |
   ethnicity |
      Mixed  |   1.113096    .121173     0.98   0.325     .8992279     1.37783
Asian or ..  |   1.519212   .0525024    12.10   0.000     1.419716     1.62568
      Black  |   1.230463   .0687799     3.71   0.000     1.102779    1.372931
      Other  |   1.162204   .0889766     1.96   0.050     1.000267    1.350359
             |
1.htdiag_o~p |    .982221   .0181358    -0.97   0.331     .9473111    1.018418
1.~y_disease |   1.768758   .0328672    30.69   0.000     1.705499    1.834364
    1.asthma |   1.138271   .0231664     6.36   0.000     1.093759    1.184594
1.~c_disease |   1.381388   .0231534    19.28   0.000     1.336745    1.427521
             |
     diabcat |
T1DM, con..  |   1.731689   .2518854     3.77   0.000     1.302139    2.302941
T1DM, unc..  |   2.203621   .2054617     8.47   0.000     1.835576    2.645461
T2DM, con..  |   1.367029   .0272287    15.70   0.000      1.31469    1.421451
T2DM, unc..  |   1.726945   .0436226    21.63   0.000     1.643529    1.814596
Diabetes,..  |   1.920374   .3622684     3.46   0.001     1.326818    2.779461
             |
cancer_exh~t |
  Last year  |   1.880161   .0960795    12.35   0.000     1.700972    2.078227
2-5 years..  |   1.198807   .0442723     4.91   0.000     1.115101    1.288797
   5+ years  |   1.153475   .0269392     6.11   0.000     1.101866    1.207502
             |
cancer_hae~t |
  Last year  |   2.579285    .314441     7.77   0.000      2.03109    3.275438
2-5 years..  |   2.161474   .1618128    10.30   0.000     1.866497     2.50307
   5+ years  |     1.5937   .0947257     7.84   0.000     1.418447    1.790605
             |
1.~r_disease |   1.752601   .0948191    10.37   0.000     1.576273    1.948654
1.stroke_d~a |   1.729802   .0355588    26.66   0.000     1.661493    1.800919
1.other_ne~o |   2.089258   .0741139    20.77   0.000     1.948932    2.239687
             |
reduced_ki~t |
Stage 3a/..  |   1.195324   .0215703     9.89   0.000     1.153786    1.238358
Stage 4/5..  |   1.920824   .0683542    18.34   0.000     1.791417    2.059578
             |
      1.esrd |   3.402426   .2107999    19.76   0.000     3.013366    3.841719
1.other_tr~t |   1.227261   .2921331     0.86   0.390     .7696968    1.956834
  1.asplenia |   1.432171   .1694017     3.04   0.002     1.135827    1.805833
1.ra_sle_p~s |   1.269342   .0313351     9.66   0.000     1.209388    1.332267
1.other_im~o |   1.568093   .1935845     3.64   0.000     1.231088    1.997351
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_1MAIN.ster n
> ot found)
file ./output/an_sense_covid_tpp_prob_plus_eth_12mo_ageband_1MAIN.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_tpp_probMAIN.
> log
  log type:  text
 closed on:  24 Jan 2021, 23:34:14
-------------------------------------------------------------------------------
