-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_icuW2.log
  log type:  text
 opened on:  24 Jan 2021, 10:55:52

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'`dataset'
> .dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
  4. 
. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
  5. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
  6. if _rc==0{
  7. estimates
  8. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
  9.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 10.         timer on 1
 11.         if e(N_fail)>0 estat phtest, d
 12.         timer off 1
 13.         timer list 
 14.         
. }
 15. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. foreach exposure_type in  gp_number_kids {
 18. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAIN
> FULLYADJMODEL_ageband_`x'`dataset'"
 19. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_MAINFULLYADJMODEL_ageband_`x'`dataset'", replace
 23. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 27. foreach exposure_type in kids_cat4   {
 28. 
. *Age spline model (not adj ethnicity)
. cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`dataset'
 29. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 30. if _rc==0{
 31. estimates
 32. estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'`datas
> et', replace
 33. *estat concordance /*c-statistic*/
. }
 34. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 35. }       
 36. }
   1:   3874.90 /        1 =    3874.9000

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,266,918             Number of obs    =   9,266,918
No. of failures      =        1,101
Time at risk         =    994483342
                                                Wald chi2(47)    =     3608.56
Log pseudolikelihood =    -12948.74             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,781,608 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.186703   .1139581     1.78   0.075     .9831091    1.432459
 only 12-18  |   1.132868   .1163983     1.21   0.225     .9262349    1.385598
      mixed  |   1.218996   .1484894     1.63   0.104     .9600962     1.54771
             |
        age1 |   1.058502     .02263     2.66   0.008     1.015064    1.103798
        age2 |   1.036066   .0548349     0.67   0.503     .9339782    1.149313
        age3 |   .8498064   .1168616    -1.18   0.237     .6490326    1.112688
      1.male |   2.482028   .1675604    13.47   0.000     2.174416    2.833159
             |
   obese4cat |
Obese I ..)  |   2.276407   .1771189    10.57   0.000     1.954434    2.651422
Obese II..)  |   2.968998   .2870612    11.26   0.000     2.456464     3.58847
Obese II..)  |    4.70292   .5123943    14.21   0.000     3.798631     5.82248
             |
smoke_nomiss |
     Former  |   1.104616   .0743881     1.48   0.140     .9680306    1.260474
    Current  |   .2614356   .0348245   -10.07   0.000     .2013634    .3394291
             |
         imd |
          2  |   1.233374   .1503048     1.72   0.085     .9713223    1.566124
          3  |   1.309472   .1563052     2.26   0.024     1.036317    1.654626
          4  |   1.515388    .175137     3.60   0.000     1.208226    1.900637
5 most de..  |   2.103495   .2382217     6.57   0.000     1.684778    2.626277
             |
tot_adults~h |
          2  |   1.067964   .0949614     0.74   0.460     .8971588    1.271288
          3  |   1.337697   .1160958     3.35   0.001     1.128454    1.585739
             |
   ethnicity |
      Mixed  |   2.451459   .5157113     4.26   0.000     1.623148    3.702467
Asian or ..  |   3.540369    .317316    14.11   0.000     2.970005    4.220268
      Black  |    1.70189   .2544693     3.56   0.000     1.269576    2.281417
      Other  |   2.183816   .3946724     4.32   0.000     1.532434    3.112077
             |
1.htdiag_o~p |   1.386226   .0995861     4.55   0.000      1.20416    1.595821
1.~y_disease |   3.708036   .3884451    12.51   0.000     3.019771    4.553169
    1.asthma |    1.28988   .0969982     3.38   0.001     1.113114    1.494718
1.~c_disease |   1.121358   .1178504     1.09   0.276      .912612    1.377851
             |
     diabcat |
T1DM, con..  |   .9309606   .6662292    -0.10   0.920     .2289711    3.785141
T1DM, unc..  |   2.884285   .7496979     4.08   0.000     1.732964    4.800503
T2DM, con..  |   1.493136   .1569684     3.81   0.000     1.215109    1.834777
T2DM, unc..  |   2.404188   .2366396     8.91   0.000     1.982377    2.915752
Diabetes,..  |   6.438144   2.486687     4.82   0.000     3.019883     13.7256
             |
cancer_exh~t |
  Last year  |   2.137879   .7231142     2.25   0.025     1.101725    4.148515
2-5 years..  |   1.262509   .3221713     0.91   0.361     .7656352    2.081838
   5+ years  |   1.105295   .2447351     0.45   0.651     .7161514    1.705893
             |
cancer_hae~t |
  Last year  |   9.088374   4.155314     4.83   0.000     3.709425    22.26721
2-5 years..  |   4.754452   1.694773     4.37   0.000     2.364183    9.561365
   5+ years  |   2.356162   .7978267     2.53   0.011     1.213326    4.575441
             |
1.~r_disease |   .9781553   .2573582    -0.08   0.933     .5840526    1.638188
1.stroke_d~a |   1.120595   .2121058     0.60   0.547     .7732743    1.623917
1.other_ne~o |   .9022031   .2901189    -0.32   0.749      .480381    1.694427
             |
reduced_ki~t |
Stage 3a/..  |   1.720054   .2455812     3.80   0.000     1.300204    2.275478
Stage 4/5..  |   2.544012    .661495     3.59   0.000     1.528233    4.234956
             |
      1.esrd |   3.753169   .9652547     5.14   0.000     2.267163    6.213173
1.other_tr~t |    1.69442   1.069382     0.84   0.403     .4918256    5.837558
  1.asplenia |   .8152542   .5821135    -0.29   0.775     .2011464    3.304257
1.ra_sle_p~s |   1.202976   .1402368     1.59   0.113     .9572567     1.51177
1.other_im~o |   .6907132   .3465968    -0.74   0.461     .2583263     1.84683
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYAD
> JMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYADJMODEL_
> ageband_0W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.05234         3.43        1         0.0640
      2.kids_cat4 |     -0.00242         0.01        1         0.9329
      3.kids_cat4 |      0.02027         0.53        1         0.4666
      age1        |      0.03561         1.27        1         0.2588
      age2        |     -0.02558         0.72        1         0.3974
      age3        |      0.02517         0.72        1         0.3977
      0b.male     |            .            .        1             .
      1.male      |     -0.08108         8.94        1         0.0028
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00952         0.13        1         0.7199
      3.obese4cat |     -0.04999         3.34        1         0.0676
      4.obese4cat |     -0.03702         2.10        1         0.1474
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00310         0.01        1         0.9102
      3.smoke_no~s|      0.04361         2.65        1         0.1036
      1b.imd      |            .            .        1             .
      2.imd       |     -0.02081         0.54        1         0.4609
      3.imd       |     -0.00700         0.06        1         0.8050
      4.imd       |      0.02176         0.66        1         0.4160
      5.imd       |      0.02240         0.70        1         0.4043
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.05374         3.85        1         0.0498
      3.tot_adul~h|      0.05978         4.55        1         0.0329
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.03182         1.20        1         0.2738
      3.ethnicity |     -0.06551         5.36        1         0.0206
      4.ethnicity |     -0.03968         1.88        1         0.1702
      5.ethnicity |     -0.02249         0.61        1         0.4357
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.02149         0.70        1         0.4032
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.04868         4.37        1         0.0366
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.03441         1.59        1         0.2067
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.03167         1.48        1         0.2243
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01985         0.49        1         0.4840
      3.diabcat   |      0.02607         0.93        1         0.3348
      4.diabcat   |      0.03443         1.68        1         0.1953
      5.diabcat   |      0.02588         1.10        1         0.2932
      6.diabcat   |      0.02364         0.74        1         0.3894
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00201         0.01        1         0.9433
      3.cancer_e~t|     -0.05013         3.32        1         0.0683
      4.cancer_e~t|     -0.03214         1.30        1         0.2550
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01779         0.41        1         0.5208
      3.cancer_h~t|      0.03443         1.48        1         0.2234
      4.cancer_h~t|     -0.03160         1.27        1         0.2597
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.01807         0.48        1         0.4887
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00412         0.03        1         0.8739
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01223         0.18        1         0.6693
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.02357         0.79        1         0.3751
      3.reduced_~t|      0.04634         2.49        1         0.1147
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00883         0.11        1         0.7376
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.01275         0.29        1         0.5923
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.03688         1.83        1         0.1766
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00195         0.00        1         0.9457
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.02736         0.92        1         0.3376
      ------------+---------------------------------------------------
      global test |                     57.68       47         0.1366
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   5734.15 /        1 =    5734.1530
   1:   1640.84 /        1 =    1640.8430

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,849,103             Number of obs    =   1,849,103
No. of failures      =          160
Time at risk         =    198734479
                                                Wald chi2(47)    =   195841.14
Log pseudolikelihood =   -1589.5214             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,058,848 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .7749024   .1371715    -1.44   0.150     .5477334    1.096288
3 childre..  |   1.105067   .2860082     0.39   0.699     .6654024    1.835238
4+ childr..  |   .6875565   .4061063    -0.63   0.526     .2160454    2.188124
             |
        age1 |    1.09494   .0603547     1.65   0.100     .9828132     1.21986
        age2 |   .9248687    .120471    -0.60   0.549     .7164812    1.193865
        age3 |   1.202715   .4074957     0.54   0.586     .6191055    2.336475
      1.male |   2.867169   .4986247     6.06   0.000     2.039023    4.031664
             |
   obese4cat |
Obese I ..)  |   2.493817   .4891237     4.66   0.000     1.697909    3.662812
Obese II..)  |   2.058759   .6233182     2.39   0.017     1.137345    3.726651
Obese II..)  |   5.496424    1.57166     5.96   0.000     3.138237    9.626641
             |
smoke_nomiss |
     Former  |   1.156648   .2033763     0.83   0.408      .819469    1.632564
    Current  |   .3162587   .1053469    -3.46   0.001     .1646282    .6075481
             |
         imd |
          2  |   1.812987   .6312367     1.71   0.087     .9162785    3.587251
          3  |   2.063102   .6825633     2.19   0.029     1.078714    3.945799
          4  |   1.794644   .5925641     1.77   0.077     .9395603    3.427931
5 most de..  |   2.324908   .7676854     2.56   0.011     1.217135    4.440919
             |
tot_adults~h |
          2  |    1.32394   .4992235     0.74   0.457     .6322695    2.772263
          3  |   2.053762   .7862793     1.88   0.060     .9697704    4.349418
             |
   ethnicity |
      Mixed  |   1.881436    1.09341     1.09   0.277     .6022928    5.877211
Asian or ..  |   4.002629    .771363     7.20   0.000     2.743512     5.83961
      Black  |   1.954405   .7280242     1.80   0.072     .9417562    4.055933
      Other  |   3.172198   1.144272     3.20   0.001     1.564284    6.432871
             |
1.htdiag_o~p |   1.334811   .2616074     1.47   0.141     .9090631    1.959951
1.~y_disease |   4.494267   1.459828     4.63   0.000     2.377779    8.494663
    1.asthma |   1.193959    .249536     0.85   0.396     .7926648    1.798414
1.~c_disease |   1.412896   .4687034     1.04   0.297     .7374607    2.706956
             |
     diabcat |
T1DM, con..  |   3.76e-17   9.50e-18  -149.59   0.000     2.29e-17    6.17e-17
T1DM, unc..  |   4.91e-17   1.54e-17  -119.68   0.000     2.65e-17    9.08e-17
T2DM, con..  |   1.579492   .4500352     1.60   0.109     .9036284    2.760865
T2DM, unc..  |   1.756042   .5427606     1.82   0.068     .9581728    3.218294
Diabetes,..  |   5.091756   5.226231     1.59   0.113     .6810603    38.06709
             |
cancer_exh~t |
  Last year  |   2.00e-17   2.84e-18  -270.54   0.000     1.51e-17    2.64e-17
2-5 years..  |   2.03e-17   3.20e-18  -244.48   0.000     1.49e-17    2.77e-17
   5+ years  |   2.08e-17   3.17e-18  -252.57   0.000     1.55e-17    2.80e-17
             |
cancer_hae~t |
  Last year  |   2.16e-17   6.63e-18  -125.11   0.000     1.19e-17    3.94e-17
2-5 years..  |   5.082504   5.076316     1.63   0.104     .7176499    35.99506
   5+ years  |   2.80e-17   4.04e-18  -264.05   0.000     2.11e-17    3.71e-17
             |
1.~r_disease |   .6681861   .6779634    -0.40   0.691      .091462    4.881511
1.stroke_d~a |   .7263702    .550446    -0.42   0.673     .1644805    3.207758
1.other_ne~o |   2.24e-17   3.79e-18  -226.08   0.000     1.60e-17    3.12e-17
             |
reduced_ki~t |
Stage 3a/..  |   2.115731   .9210701     1.72   0.085     .9013541    4.966217
Stage 4/5..  |   3.534595   3.225746     1.38   0.167     .5909015    21.14288
             |
      1.esrd |   3.200093   2.815741     1.32   0.186     .5704219    17.95267
1.other_tr~t |   2.18e-17   1.23e-17   -67.67   0.000     7.16e-18    6.61e-17
  1.asplenia |   2.54e-17   6.71e-18  -144.37   0.000     1.51e-17    4.26e-17
1.ra_sle_p~s |   .7461858   .3113348    -0.70   0.483      .329379    1.690433
1.other_im~o |    1.69755   1.719884     0.52   0.601     .2330355    12.36582
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFU
> LLYADJMODEL_ageband_0W2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFULLYADJM
> ODEL_ageband_0W2.ster saved
(533,406 observations deleted)
   1:   3807.45 /        1 =    3807.4530

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,733,512             Number of obs    =   8,733,512
No. of failures      =        1,062
Time at risk         =    937593242
                                                Wald chi2(47)    =     3473.57
Log pseudolikelihood =   -12421.314             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,502,867 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.207371   .1188696     1.91   0.056     .9954909    1.464348
 only 12-18  |   1.155452   .1200334     1.39   0.164     .9425954    1.416375
      mixed  |   1.249195   .1547198     1.80   0.072     .9799504    1.592415
             |
        age1 |   1.058847   .0239483     2.53   0.011     1.012935    1.106841
        age2 |   1.035463   .0575054     0.63   0.530     .9286722    1.154535
        age3 |   .8524173   .1224482    -1.11   0.266     .6432483    1.129603
      1.male |    2.53667   .1755175    13.45   0.000     2.214969    2.905096
             |
   obese4cat |
Obese I ..)  |   2.252848   .1783448    10.26   0.000     1.929067    2.630974
Obese II..)  |   3.008839    .293537    11.29   0.000     2.485177    3.642845
Obese II..)  |   4.725719   .5206453    14.10   0.000     3.807928    5.864717
             |
smoke_nomiss |
     Former  |   1.139704    .077993     1.91   0.056     .9966489    1.303293
    Current  |   .2758243   .0369817    -9.61   0.000      .212083     .358723
             |
         imd |
          2  |   1.260037   .1562495     1.86   0.062     .9881683    1.606703
          3  |   1.295261   .1583036     2.12   0.034     1.019355    1.645845
          4  |   1.529834   .1805356     3.60   0.000     1.213931    1.927945
5 most de..  |   2.147893   .2479957     6.62   0.000     1.712904    2.693348
             |
tot_adults~h |
          2  |   1.105938   .1009372     1.10   0.270       .92479     1.32257
          3  |     1.3637   .1214282     3.48   0.000     1.145315    1.623725
             |
   ethnicity |
      Mixed  |   2.595969   .5466759     4.53   0.000     1.718098    3.922392
Asian or ..  |   3.594106   .3286473    13.99   0.000     3.004392    4.299573
      Black  |   1.723499   .2637856     3.56   0.000     1.276828    2.326427
      Other  |   2.120662   .3999361     3.99   0.000     1.465356     3.06902
             |
1.htdiag_o~p |   1.414552   .1036418     4.73   0.000     1.225329    1.632995
1.~y_disease |   3.602944   .3840166    12.03   0.000     2.923701    4.439991
    1.asthma |   1.266381   .0974319     3.07   0.002     1.089119    1.472494
1.~c_disease |   1.118487   .1191714     1.05   0.293     .9076912    1.378237
             |
     diabcat |
T1DM, con..  |   .9518779   .6813134    -0.07   0.945     .2340603    3.871104
T1DM, unc..  |   2.760949   .7406688     3.79   0.000     1.631962    4.670968
T2DM, con..  |    1.50231   .1596973     3.83   0.000     1.219764    1.850305
T2DM, unc..  |   2.385995   .2384281     8.70   0.000       1.9616    2.902208
Diabetes,..  |   5.837673   2.432311     4.23   0.000     2.579765    13.20989
             |
cancer_exh~t |
  Last year  |   2.200037   .7449879     2.33   0.020       1.1329    4.272364
2-5 years..  |   1.291211   .3296325     1.00   0.317      .782879     2.12961
   5+ years  |   1.025658   .2384121     0.11   0.913     .6503427    1.617568
             |
cancer_hae~t |
  Last year  |    9.32041   4.268744     4.87   0.000     3.798263    22.87099
2-5 years..  |   4.227889   1.609292     3.79   0.000     2.005047    8.915025
   5+ years  |   2.420627    .819932     2.61   0.009     1.246244    4.701679
             |
1.~r_disease |   1.018453   .2681283     0.07   0.945     .6079177    1.706227
1.stroke_d~a |   1.107439   .2130991     0.53   0.596     .7594992    1.614776
1.other_ne~o |   .9345691   .3007403    -0.21   0.833     .4973916       1.756
             |
reduced_ki~t |
Stage 3a/..  |   1.749725   .2527023     3.87   0.000     1.318365    2.322222
Stage 4/5..  |   2.716758   .6984052     3.89   0.000     1.641459    4.496472
             |
      1.esrd |   3.555714   .9190739     4.91   0.000     2.142446    5.901246
1.other_tr~t |   1.754802   1.109359     0.89   0.374       .50829    6.058214
  1.asplenia |   .8392117   .5994291    -0.25   0.806     .2069561    3.403022
1.ra_sle_p~s |   1.173019   .1401202     1.34   0.182     .9281681    1.482461
1.other_im~o |   .7208323   .3617042    -0.65   0.514     .2695954     1.92733
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_0W2.ster not foun
> d)
file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_0W2.ster saved
   1:   2307.58 /        1 =    2307.5760

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,706,505             Number of obs    =   2,706,505
No. of failures      =          784
Time at risk         =    290284353
                                                Wald chi2(46)    =     1110.35
Log pseudolikelihood =    -8698.415             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,109,802 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.303926   .2690976     1.29   0.198     .8701346    1.953978
 only 12-18  |   1.037945   .3022968     0.13   0.898     .5864974    1.836889
      mixed  |   1.864652   .4949777     2.35   0.019     1.108265     3.13727
             |
        age1 |   .9992401   .0338835    -0.02   0.982     .9349883    1.067907
        age2 |   1.046993   .2016611     0.24   0.812     .7177842    1.527191
        age3 |    .687139   .2988846    -0.86   0.388     .2929529    1.611727
      1.male |   2.581443   .2137445    11.45   0.000     2.194738    3.036283
             |
   obese4cat |
Obese I ..)  |    1.75967   .1516838     6.56   0.000     1.486132    2.083554
Obese II..)  |   2.077998   .2478342     6.13   0.000     1.644848    2.625212
Obese II..)  |   2.688087   .4235138     6.28   0.000     1.973943    3.660597
             |
smoke_nomiss |
     Former  |   1.452579   .1245449     4.35   0.000     1.227884    1.718392
    Current  |   .3959535   .0814006    -4.51   0.000     .2646386    .5924275
             |
         imd |
          2  |   .9497848   .1214222    -0.40   0.687      .739275    1.220237
          3  |   1.310995   .1604803     2.21   0.027     1.031346     1.66647
          4  |   1.523151   .1839852     3.48   0.000     1.202055    1.930019
5 most de..  |   1.852766   .2248044     5.08   0.000     1.460631    2.350177
             |
tot_adults~h |
          2  |   .9251682   .0784464    -0.92   0.359     .7835127    1.092434
          3  |   .9825742   .1104694    -0.16   0.876     .7882537    1.224799
             |
   ethnicity |
      Mixed  |   .7062379   .4968431    -0.49   0.621     .1778792    2.803993
Asian or ..  |   2.974645   .4192793     7.73   0.000     2.256615    3.921145
      Black  |   1.857196   .4791631     2.40   0.016     1.120069    3.079433
      Other  |   1.394057    .503251     0.92   0.357     .6870669    2.828539
             |
1.htdiag_o~p |   .9603473   .0802508    -0.48   0.628     .8152639     1.13125
1.~y_disease |    1.89808   .1745844     6.97   0.000     1.584972    2.273043
    1.asthma |   1.094109   .1059547     0.93   0.353     .9049593    1.322793
1.~c_disease |   1.116102   .0949649     1.29   0.197     .9446659    1.318649
             |
     diabcat |
T1DM, con..  |   2.259553   1.302638     1.41   0.157     .7299659    6.994271
T1DM, unc..  |   .4209443   .4226374    -0.86   0.389     .0588301    3.011965
T2DM, con..  |   1.297415   .1263706     2.67   0.008     1.071939    1.570317
T2DM, unc..  |   1.764577   .1946798     5.15   0.000     1.421447    2.190538
Diabetes,..  |   1.458114   1.457174     0.38   0.706     .2056546    10.33819
             |
cancer_exh~t |
  Last year  |   .5567949   .2498571    -1.30   0.192     .2310605    1.341729
2-5 years..  |   1.023941   .1924924     0.13   0.900     .7083639     1.48011
   5+ years  |   1.098694    .138564     0.75   0.455     .8580756    1.406785
             |
cancer_hae~t |
  Last year  |   9.20e-20          .        .       .            .           .
2-5 years..  |    1.74825   .7169296     1.36   0.173     .7825993    3.905421
   5+ years  |   2.385462   .6079613     3.41   0.001     1.447553    3.931069
             |
1.~r_disease |   1.173513   .3259666     0.58   0.565     .6808473    2.022675
1.stroke_d~a |   .8801807   .1250848    -0.90   0.369     .6662012    1.162889
1.other_ne~o |    1.13622   .2800033     0.52   0.604     .7009663    1.841736
             |
reduced_ki~t |
Stage 3a/..  |   1.446148   .1281977     4.16   0.000     1.215502     1.72056
Stage 4/5..  |   1.661203   .3769993     2.24   0.025     1.064751    2.591775
             |
      1.esrd |   2.384143   .8362587     2.48   0.013     1.198853    4.741312
1.other_tr~t |   1.606848    1.64384     0.46   0.643     .2163605    11.93361
  1.asplenia |   .4311337   .4328283    -0.84   0.402     .0602649    3.084318
1.ra_sle_p~s |   1.255491   .1481758     1.93   0.054     .9962148    1.582247
1.other_im~o |   1.445813   .8420617     0.63   0.527     .4617007    4.527555
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYAD
> JMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_MAINFULLYADJMODEL_
> ageband_1W2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.04249         1.58        1         0.2085
      2.kids_cat4 |      0.03610         1.29        1         0.2555
      3.kids_cat4 |     -0.06910         3.98        1         0.0459
      age1        |     -0.02028         0.41        1         0.5211
      age2        |      0.00202         0.00        1         0.9489
      age3        |      0.00636         0.04        1         0.8389
      0b.male     |            .            .        1             .
      1.male      |     -0.02656         0.69        1         0.4045
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.03889         1.46        1         0.2269
      3.obese4cat |     -0.07454         5.11        1         0.0237
      4.obese4cat |      0.05200         2.54        1         0.1110
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02622         0.66        1         0.4156
      3.smoke_no~s|      0.00313         0.01        1         0.9242
      1b.imd      |            .            .        1             .
      2.imd       |     -0.05257         2.48        1         0.1154
      3.imd       |     -0.04353         1.80        1         0.1800
      4.imd       |     -0.04911         2.30        1         0.1291
      5.imd       |     -0.08135         5.85        1         0.0156
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01044         0.10        1         0.7521
      3.tot_adul~h|      0.00773         0.05        1         0.8150
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.02605         0.58        1         0.4455
      3.ethnicity |     -0.02511         0.58        1         0.4448
      4.ethnicity |      0.06139         3.58        1         0.0586
      5.ethnicity |      0.03168         0.87        1         0.3515
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.02997         0.88        1         0.3488
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.02095         0.46        1         0.4973
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.07086         4.68        1         0.0306
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.06589         4.36        1         0.0368
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.07106         4.24        1         0.0396
      3.diabcat   |      0.01104         0.11        1         0.7457
      4.diabcat   |     -0.02701         0.74        1         0.3897
      5.diabcat   |      0.02999         0.89        1         0.3448
      6.diabcat   |     -0.02515         0.54        1         0.4628
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.04382         1.69        1         0.1938
      3.cancer_e~t|      0.01011         0.09        1         0.7605
      4.cancer_e~t|      0.04776         2.10        1         0.1472
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|            .            .        1             .
      3.cancer_h~t|     -0.07742         5.47        1         0.0194
      4.cancer_h~t|      0.01377         0.17        1         0.6771
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.01402         0.18        1         0.6704
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00267         0.01        1         0.9360
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01205         0.13        1         0.7197
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.01688         0.27        1         0.6040
      3.reduced_~t|      0.02504         0.50        1         0.4795
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01777         0.29        1         0.5918
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00165         0.00        1         0.9562
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.02134         0.42        1         0.5183
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00360         0.01        1         0.9120
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00758         0.05        1         0.8191
      ------------+---------------------------------------------------
      global test |                     57.87       46         0.1126
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   1304.88 /        1 =    1304.8830
   1:     70.75 /        1 =      70.7540

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects      =       44,335             Number of obs    =      44,335
No. of failures      =           28
Time at risk         =      4747115
                                                Wald chi2(47)    =    41136.80
Log pseudolikelihood =   -188.15587             Prob > chi2      =      0.0000

                      (Std. Err. adjusted for 36,383 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9506691   .4095173    -0.12   0.907     .4086575    2.211563
3 childre..  |   2.488147   1.166492     1.94   0.052     .9926957     6.23643
4+ childr..  |   1.55e-17   4.67e-18  -128.98   0.000     8.63e-18    2.80e-17
             |
        age1 |   1.193285   .2128605     0.99   0.322     .8412119    1.692713
        age2 |   .7116563   .7506611    -0.32   0.747     .0900359     5.62503
        age3 |   .8973708   2.215913    -0.04   0.965     .0070969     113.469
      1.male |   2.961006   1.455474     2.21   0.027     1.129884      7.7597
             |
   obese4cat |
Obese I ..)  |   2.174418    .935858     1.80   0.071     .9353848    5.054703
Obese II..)  |   1.959952   1.343551     0.98   0.326     .5113816     7.51183
Obese II..)  |   1.68e-17   6.33e-18  -102.35   0.000     8.01e-18    3.51e-17
             |
smoke_nomiss |
     Former  |   .3935445   .1976405    -1.86   0.063     .1470669    1.053107
    Current  |   1.01e-17   4.03e-18   -97.63   0.000     4.58e-18    2.21e-17
             |
         imd |
          2  |   1.413969   1.721782     0.28   0.776      .129998    15.37953
          3  |   2.242829   2.621565     0.69   0.490     .2269114    22.16848
          4  |   3.801936   4.146133     1.22   0.221      .448479    32.23053
5 most de..  |   4.810837   5.361735     1.41   0.159     .5414352    42.74593
             |
tot_adults~h |
          2  |   .3292024   .4071748    -0.90   0.369     .0291509    3.717694
          3  |   .5965738   .6248203    -0.49   0.622     .0765879    4.646953
             |
   ethnicity |
      Mixed  |    2.96555    3.45687     0.93   0.351     .3019117    29.12933
Asian or ..  |    1.52365   .7259287     0.88   0.377     .5988777    3.876432
      Black  |   .7424623   .8271882    -0.27   0.789     .0836254    6.591899
      Other  |    1.36179   1.423274     0.30   0.768      .175581    10.56192
             |
1.htdiag_o~p |   4.891242   3.593432     2.16   0.031     1.158964    20.64279
1.~y_disease |   .9844703   .8764695    -0.02   0.986     .1719419    5.636682
    1.asthma |   1.359445   .6823665     0.61   0.541     .5082827     3.63595
1.~c_disease |    1.24987   .5420231     0.51   0.607     .5342321    2.924152
             |
     diabcat |
T1DM, con..  |   3.21e-17   3.64e-17   -33.44   0.000     3.46e-18    2.97e-16
T1DM, unc..  |   2.51e-17   1.23e-17   -78.17   0.000     9.62e-18    6.54e-17
T2DM, con..  |     1.6203   .6916809     1.13   0.258     .7018284    3.740763
T2DM, unc..  |   1.899403   1.014743     1.20   0.230      .666605    5.412098
Diabetes,..  |   2.20e-17   9.59e-18   -88.08   0.000     9.38e-18    5.17e-17
             |
cancer_exh~t |
  Last year  |   1.63e-17   5.86e-18  -107.73   0.000     8.08e-18    3.30e-17
2-5 years..  |   1.73e-17   5.26e-18  -126.55   0.000     9.49e-18    3.14e-17
   5+ years  |   .7592069   .7689345    -0.27   0.786     .1042923    5.526726
             |
cancer_hae~t |
  Last year  |   2.84e-17   1.59e-17   -67.92   0.000     9.46e-18    8.53e-17
2-5 years..  |   3.84e-17   1.95e-17   -74.47   0.000     1.42e-17    1.04e-16
   5+ years  |   1.85e-17   7.31e-18   -97.44   0.000     8.52e-18    4.01e-17
             |
1.~r_disease |   4.034982   4.257491     1.32   0.186     .5101531    31.91411
1.stroke_d~a |    .910726   .6739837    -0.13   0.899     .2135282    3.884367
1.other_ne~o |   1.36e-17   4.08e-18  -129.29   0.000     7.54e-18    2.45e-17
             |
reduced_ki~t |
Stage 3a/..  |   .9044744   .5354583    -0.17   0.865     .2834498    2.886134
Stage 4/5..  |   .4460166   .3525294    -1.02   0.307      .094747      2.0996
             |
      1.esrd |   7.499857   6.050899     2.50   0.013     1.542773    36.45894
1.other_tr~t |   9.12e-18   1.20e-17   -29.78   0.000     6.89e-19    1.21e-16
  1.asplenia |   1.27e-17   8.73e-18   -56.66   0.000     3.31e-18    4.88e-17
1.ra_sle_p~s |    .481405   .5074199    -0.69   0.488     .0609973    3.799362
1.other_im~o |   2.77e-17   1.37e-17   -77.20   0.000     1.05e-17    7.30e-17
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFU
> LLYADJMODEL_ageband_1W2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_MAINFULLYADJM
> ODEL_ageband_1W2.ster saved
(55,013 observations deleted)
   1:   2065.57 /        1 =    2065.5740

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,651,492             Number of obs    =   2,651,492
No. of failures      =          767
Time at risk         =    284410628
                                                Wald chi2(47)    =   423840.20
Log pseudolikelihood =   -8492.3958             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,067,442 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.215541   .2639998     0.90   0.369     .7941443    1.860542
 only 12-18  |   .9109616   .2892104    -0.29   0.769     .4889475    1.697219
      mixed  |   1.947536   .5186111     2.50   0.012     1.155629    3.282107
             |
        age1 |   .9936945   .0337916    -0.19   0.852     .9296231    1.062182
        age2 |   1.075231   .2085737     0.37   0.708     .7351658    1.572599
        age3 |   .6379862   .2800016    -1.02   0.306     .2699188    1.507959
      1.male |   2.576056   .2160748    11.28   0.000     2.185537    3.036355
             |
   obese4cat |
Obese I ..)  |   1.734367   .1511775     6.32   0.000     1.461993    2.057485
Obese II..)  |   2.047916   .2471686     5.94   0.000      1.61651    2.594454
Obese II..)  |   2.642196   .4212119     6.09   0.000     1.933164    3.611282
             |
smoke_nomiss |
     Former  |   1.467889   .1276352     4.41   0.000     1.237884     1.74063
    Current  |   .4076809   .0839339    -4.36   0.000     .2723164    .6103332
             |
         imd |
          2  |   .9601255   .1239916    -0.32   0.753     .7454233    1.236668
          3  |   1.333373   .1647752     2.33   0.020     1.046555    1.698795
          4  |   1.515477   .1861196     3.39   0.001     1.191272    1.927913
5 most de..  |   1.855391    .228035     5.03   0.000     1.458207    2.360758
             |
tot_adults~h |
          2  |   .9199679   .0788003    -0.97   0.330     .7777904    1.088135
          3  |   .9551205   .1094401    -0.40   0.689     .7630014    1.195614
             |
   ethnicity |
      Mixed  |   .7400087   .5203356    -0.43   0.668      .186516     2.93601
Asian or ..  |   3.026947   .4295259     7.81   0.000     2.292022    3.997523
      Black  |   1.840858   .4892559     2.30   0.022     1.093431    3.099198
      Other  |   1.280985   .4941647     0.64   0.521     .6014184    2.728422
             |
1.htdiag_o~p |   .9583468   .0809612    -0.50   0.615     .8121068    1.130921
1.~y_disease |   1.885663   .1753023     6.82   0.000     1.571562    2.262543
    1.asthma |   1.114459    .108492     1.11   0.266     .9208733    1.348739
1.~c_disease |   1.110788   .0957626     1.22   0.223     .9380972    1.315268
             |
     diabcat |
T1DM, con..  |   2.317841   1.336348     1.46   0.145     .7487287    7.175344
T1DM, unc..  |   .4328142   .4346011    -0.83   0.404     .0604764    3.097542
T2DM, con..  |   1.333175   .1307872     2.93   0.003     1.099974    1.615815
T2DM, unc..  |   1.779901   .2000293     5.13   0.000     1.428025    2.218481
Diabetes,..  |   1.615044    1.61367     0.48   0.631     .2278806    11.44621
             |
cancer_exh~t |
  Last year  |   .5691012    .255401    -1.26   0.209     .2361498    1.371486
2-5 years..  |    1.00888   .1929274     0.05   0.963     .6935298    1.467622
   5+ years  |    1.10873   .1408578     0.81   0.417     .8643415    1.422217
             |
cancer_hae~t |
  Last year  |   1.45e-14   7.92e-16  -581.89   0.000     1.30e-14    1.61e-14
2-5 years..  |   1.791619   .7349348     1.42   0.155     .8018195    4.003267
   5+ years  |   2.436365   .6212921     3.49   0.000     1.478017    4.016108
             |
1.~r_disease |   1.194747    .332044     0.64   0.522     .6929629    2.059879
1.stroke_d~a |   .8726157   .1259675    -0.94   0.345     .6575773    1.157975
1.other_ne~o |   1.100719   .2791894     0.38   0.705      .669538    1.809579
             |
reduced_ki~t |
Stage 3a/..  |   1.463899   .1309265     4.26   0.000     1.228521    1.744376
Stage 4/5..  |    1.63555   .3789927     2.12   0.034     1.038537    2.575763
             |
      1.esrd |   2.459021   .8612093     2.57   0.010     1.237801    4.885104
1.other_tr~t |   1.621717   1.658453     0.47   0.636       .21852    12.03535
  1.asplenia |   .4377328   .4395345    -0.82   0.411     .0611651    3.132667
1.ra_sle_p~s |   1.263211   .1500162     1.97   0.049     1.000897    1.594274
1.other_im~o |   1.480842    .863044     0.67   0.501     .4725232    4.640815
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_1W2.ster not foun
> d)
file ./output/an_sense_covid_icu_plus_eth_12mo_ageband_1W2.ster saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/log/07b_an_multivariable_cox_models_covid_icuW2.log
  log type:  text
 closed on:  24 Jan 2021, 16:43:09
-------------------------------------------------------------------------------
