-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/log/07d_an_multivariable_cox_models_covid_tpp_prob_Sens
> e5_time_intsMAIN.log
  log type:  text
 opened on:  27 Jan 2021, 12:15:54

. 
. 
. foreach x in 0 1 {
  2. ******************************
. *  Multivariable Cox models  *
. ******************************
. display "$S_TIME  $S_DATE"
  3. use "$tempdir/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'`
> dataset'.dta", clear
  4. display "$S_TIME  $S_DATE"
  5. stsplit timeperiod, at(60 90)
  6. 
. *make vars binary
. gen anyreduced_kidney_function = reduced_kidney_function_cat>=2
  7. gen anyobesity = obese4cat>=2
  8. gen highimd = imd>=3
  9. gen anydiab= diabcat>=2
 10. gen any_nonwhite=ethnicity>=2
 11.    
. *Fully adjusted
. stcox   i.kids_cat4      ///
>                         age1 age2 age3          ///
>                         i.tot_adults_hh ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                           ///
>                         i.ethnicity ///
>                         `comordidadjlist'       ///     
>                         60.timeperiod#1.male                                 
>                    ///
>                         90.timeperiod#1.male                                 
>            ///
>                         60.timeperiod#1.tot_adults_hh                        
>                            ///
>                         90.timeperiod#1.tot_adults_hh                        
>                    ///
>                         60.timeperiod#1.anyobesity                           
>                            ///
>                         90.timeperiod#1.anyobesity                           
>                    ///
>                         60.timeperiod#1.any_nonwhite                         
>                            ///
>                         90.timeperiod#1.any_nonwhite                         
>                    ///
>                         60.timeperiod#3.smoke_nomiss                         
>                    ///
>                         90.timeperiod#3.smoke_nomiss                         
>            ///
>                         60.timeperiod#1.highimd                              
>                            ///
>                         90.timeperiod#1.highimd                              
>                    ///
>                         , strata(stp) vce(cluster household_id)
 12. display "$S_TIME  $S_DATE"
 13. estimates save "./output/an_sense_`outcome'_time_int_ageband_`x'`dataset'"
> , replace
 14. estat phtest, d
 15. display "$S_TIME  $S_DATE"
 16. }
12:15:54  27 Jan 2021
12:15:59  27 Jan 2021
(18,532,865 observations (episodes) created)

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -666494.96
Iteration 1:   log pseudolikelihood = -659888.34
Iteration 2:   log pseudolikelihood = -658083.39
Iteration 3:   log pseudolikelihood = -658010.45
Iteration 4:   log pseudolikelihood = -658007.19
Iteration 5:   log pseudolikelihood = -658007.18
Refining estimates:
